[{"idNo": 0, "name": "SheWalksSafe - A Women Safety Application", "desc": "A women safety app that helps women in emergency or dangerous situations or whenever they feel unsafe. Some of the features like Maps, SOS, Voice command, Camera or video, Tips are provided for safety", "devfolioLink": "https://devfolio.co/submissions/shewalkssafe-a-women-safety-application-fa1a", "githubLinks": ["https://drive.google.com/file/d/17fRASw9RWwINYEMx3camfOYouEEYDhqE/view?usp=sharing", "https://github.com/rakulvm/SheWalksSafe"], "special_mention": "10th", "stacksUsed": ["Flutter", "Google Maps API", "Crimeometer API"], "longDesc": "The problem SheWalksSafe - A Women Safety Application solves\nAs women safety has became a huge concern nowadays, the insecurity for the women in rural areas increases day by day. Issues like theft, bullying, sexual injustice increases. So, we have planned use the same to give access to women in serious or dangerous situations to address the issue in a fast and easier way to ensure their security and built an app that could atleast control some of these. We have created an app with some special features like SOS, Voice command, Maps, shake for emergency, camera, police stations, taxi, tips for safety to ensure their safety as much as possible from our side.\nFeatures of our app:-\n⭐ SOS - SOS call and SOS messages to user-provided contacts (Which will be stored in shared preferences).\n⭐ Map - To track the current location of the user, guiding for safe routes and crime-prone areas (user would be able to mark the area safe or can view the number of users that have marked the area as safe, currently we are using crimeometer API to check whether the area is safe or not rather than providing information based on other user input).\n⭐ Voice Assistant - executes features on voice commands (this will detect if the sentence consists of few keywords such as 'SOS SMS', to redirect the user on the essential window).\n⭐ Shake - Detects the frequency of shakes and after a certain frequency sends help message with user location to provided contacts.\n⭐ Camera - To capture image (which can be shared from there itself) or and record video (which is automatically stored in gallery).\n⭐ Police stations - Locates all the nearest police stations.\n⭐ Police siren - Plays the police siren just to divert the people who bully.\n⭐ Taxi - One-touch ola cab facility to books cabs for user.\n⭐ News - To guide the users about self-defense techniques which we have planned to extend for providing other useful health emergency guidance."}, {"idNo": 1, "name": "Self-Stabilizing Spoon with Remote Monitoring", "desc": "The stabilizing spoon compensates for unintended tremors or shivers and keeps the spoon bowl stable. The application displays sensor data graphically to the doctor for remote monitoring.", "devfolioLink": "https://devfolio.co/submissions/selfstabilizing-spoon-with-remote-monitoring-ebe3", "githubLinks": ["https://github.com/DopeyEnvelope/Chiral_HackANova", "https://drive.google.com/drive/folders/14zwQoxRvcQ2v2dMIcUhQ8knZGmvy30W9?usp=sharing"], "special_mention": "7th", "stacksUsed": ["Firebase", "Android", "Java", "Internet of Things (IoT)", "NodeMCU", "Arduino", "Sensors"], "longDesc": "The problem Self-Stabilizing Spoon with Remote Monitoring solves\nParkinson’s disease is a neurological degenerative disease that results in irrepressible shivers in the limbs. Due to unintended tremors in their arms, patients are unable to perform everyday menial tasks like eating food out of a bowl with a spoon.\nThe stabilizing spoon compensates for unintended tremors or shivers received from the user and calibrates its head against these forces, thus keeping the spoon bowl stable at all times. This spoon can move as quickly as 500°/second, hence effectively steadying the spoon and easing the eating process of patients.\nAnother part of the holistic product is a mobile application for a designated doctor to monitor the patient’s progress.\nDuring this pandemic, people have been terrified of entering hospitals for non-COVID diseases and ailments, and we aim to create and market a product to help people adjust better to this new norm.\nWe have developed an application that analyses data collected from the spoon via sensors and statistically displays it to the designated doctor. By using this application, a doctor can not only monitor your progress but also offer diagnosis and treatment remotely, without the patient needing to leave their home.\nWith this project, the absolute aim is to make a product that can make a patient’s life easier.\nThe product will not only make it easy for the user to eat food out of a plate/bowl but also help their recovery by enabling inexpensive and thorough communication with a designated doctor.\nIn an age where people are petrified of the thought of entering the premises of a hospital, we are trying to use all the technical experience we have to create an experience that avoids as much physical contact as possible.\nIn the case of neuro diseases associated with nerves and muscles, it is imperative for the doctor to check up on the patient’s movements regularly, but we have attempted to find a way for doing that without requiring the patient to ever enter a hospital."}, {"idNo": 2, "name": "Auxiliary", "desc": "An all-in-one utility Chrome extension that will keep you mentally happy and organized and physically fit.", "devfolioLink": "https://devfolio.co/submissions/auxiliary-6943", "githubLinks": ["https://github.com/Tuntai/Auxiliary-Version-2.0", "https://docs.google.com/presentation/d/1QYU_TWmjbPZ892BY6QSN0ECeju2Gtw7V1UhyFw-aDiE/edit?usp=sharing"], "special_mention": "6th", "stacksUsed": ["jQuery", "HTML", "CSS", "JavaScript", "JSON", "Chrome Extension", "Chrome APIs"], "longDesc": "The problem Auxiliary solves\nProblems we have targeted:\nAfter the WFH and online classes have become a new normal, many of us have to sit in front of the computer table continuously for a long time, even for virtual hackathons Participants and Organizers are continuously working for more than 12 hrs. This is definitely affecting us physically as well as mentally. Doctors often say that we must take regular breaks to soothe our eyes and nerves, do some stretching, and above all to have some water. But while working we all forget about this and keep working without taking regular breaks and as a result, we go through huge mental stress, anxiety, back pain, headache, sore eyes. During the Tough times of the Pandemic, many of us struggled with a bad cycle of anxiety. Psychiatrists always prescribe that making a note of tasks to be completed helps to stay mentally focused and organized. Also, sometimes while taking breaks we forget about time and the break hampers actual work.\nThe Solution:\nOur Chrome Extension Auxiliary has a variety of functions and features that make it incredibly useful. It features a Task Manager, Reminders, Time Manager, Workout Timers, Music control, Quick Notes and so much more. Imagine you are doing a hackathon and sitting in front of your computer desk for more than 6hrs. how do you feel? dehydrated? back pain? frustrated? I get your pain! :) So I give you Auxiliary - Your Best Friend, which will -\nRegularly remind you to have some water.\nRemind you to soothe your mood by listening to some music.\nSuggest some simple yoga poses that you can do sitting on your chair.\nAllow you to take notes on the go and also to keep them organized.\nHelp you to manage your tasks.\nYou'll be able to track the progress of your work, study, etc.\nhelp you to manage your time by limiting your breaks! Just enter the duration of your break (like the duration of the episode you are watching) and choose the tab you want to get automatically closed and that's it."}, {"idNo": 3, "name": "Ularn", "desc": "Anyone can make, Everyone can learn", "devfolioLink": "https://devfolio.co/submissions/ularn-3019", "githubLinks": ["https://github.com/Chandan-CV/Ularn.git", "https://ularn-f9812.web.app/"], "special_mention": "5th", "stacksUsed": ["HTML", "Firebase", "JavaScript", "React js", "material ui", "CSS3", "React hooks"], "longDesc": "The problem Ularn solves\nI would like to start this section with a question. Which is the first website you visit, if you want to start learning a new skill?\nYoutube right? Yes, even I would do the same (almost everyone will do the same), coz why not, Youtube is the largest content library, 500 million people use youtube for learning, 1 million learning videos are shared every day. on the contrary, It has so much content that you cannot find the right one, if you want to learn a new skill youtube does not provide structured content, the comments are not moderated, you don't know what to do after the first video, there are no notes. The suggestions distract you all the time (I open youtube to study physics, but I end up watching \"shot on iPhone memes\" or \"The Ellen Show\" for an hour). \nTo solve this problem, I am introducing Ularn. Ularn is a platform where anyone can make courses using youtube videos, and everyone can use them, to learn in a systematic way. every course has its own discussion section so that you can interact with the community. Notes can be attached by the educator. you get a healthy community of learners. Most importantly it QUALITY content, STRUCTURED as a course, which is available to anyone for FREE.\nUlarn - A PLACE TO FIND QUALITY CONTENT FROM YOUTUBE, STRUCTURED AS A COURSE, FOR FREE\nLet me give you an example.\nthere is a self-learned web developer called Ram, he learned web development via youtube, which took him really long time to learn as he did not know where to start and what exactly to learn. After a long time, he finally learnt web development, and now he wants to help others like him, by providing DETAILED, STRUCTURED, and FREE content. Now he can use Ularn to make a course by using youtube as the content library. and adding his own notes and tips. Now he can share this free course with anyone, and everyone using the platform can see this course, and wouldn't have to browse through youtube to find some(in most cases, you won't)."}, {"idNo": 4, "name": "Sahayak", "desc": "Bringing Specially Abled People into the MainStream. Even after being mentally fit can't do anything lying on hospital's bed?", "devfolioLink": "https://devfolio.co/submissions/sahayak-27e0", "githubLinks": ["https://github.com/techyashu/Sahayak", "https://drive.google.com/drive/folders/1MHMB9v3lVwJ3JXSHW9HgXsnEATm59O1i?usp=sharing"], "special_mention": "4th", "stacksUsed": ["Java", "C++", "Microcontroller", "Processing", "Inertial Measurement Units (IMU)", "Piezoelectric", "Pde", "Radio Waves"], "longDesc": "The problem Sahayak solves\nThe popularization and constant technological advances of computers have made them a necessary and almost inevitable item in many people’s lives. But unfortunately, people with physical disability or some sort of condition that impedes movement of all the four limbs are unable to adequately use these computers to its fullest.\nUnder HealthCare Track\n“People with physical disability or some sort of condition that restricts movement of all the four limbs are unable to use Computers and Smartphones, impeding their progress in life”\n“People admitted in Healthcare lying on bed with syringes and medical equipment on their hands due to which they aren’t able to do anything even being mentally fit which ends up frustrating them often”\nI have build an aid for them which solves both the stated problems\nSpecially Abled People without having four of limbs or have limbs but are paralyzed, With the Project they Now :\n->Use Computer with all the Clicks (Left, Right, Left Hold(we can have more functions)\n-> Can Read PDF Books Easily than Conventional Hardcopy books where then need to\nturn the physical pages\n-> Can Write Using Virtual Keyboard\n-> Can Surf Internet(help them to remain connected with Everyone as Normal people)\n-> Can Watch Videos and Learn New Set of Skills\n-> Can Teach Online\n-> Can Earn\n-> Can Attend Online Classes\n-> Can Place Calls on their own\n-> Can Use Apps & Websites and lot more\n-> Can switch On/Off Lights/Fans and electrical Appliances thorough Home Automation\n-> Can open Doors with Home Automation through Smartphone\n-> Can be Integrated to Assistive System Based Gesture Controlled Wheelchair\n-> Is Decreasing the Gap between Normal people and Specially Abled People"}, {"idNo": 5, "name": "UNIVERSAL SIGN LANGUAGE INTERPRETER", "desc": "The symbolic view of things is a consequence of long absorption in images. Is sign language the real language of Paradise?", "devfolioLink": "https://devfolio.co/submissions/universal-sign-language-interpreter-be9d", "githubLinks": ["https://github.com/shiv21081999/SignLanguageInterpreter.git"], "special_mention": "3rd", "stacksUsed": ["OpenCV", "Machine Learning", "Deep Learning", "Python", "Convolutional neural network (CNN)"], "longDesc": "The problem UNIVERSAL SIGN LANGUAGE INTERPRETER solves\nThe idea behind this project is to use technology to improve accessibility by finding a creative solution to benefit the lives of those with a disability.\nLooking over the current situation of Global Pandemic it is quite evident that the situation is going to persist for at least 6 more months. In such times the use of technology has increased tremendously for communication and daily-life activities.\nOur goal is to make it easy for 70 million deaf people across the world to be independent of translators for there daily communication needs, so we designed this model so that we can use it in some applications to make persons with disability independent of translators. This will save everyday efforts of those people and help in their day-to-day activities as well.\nSo we have developed a Machine Learning architecture that uses CNN model to convert symbols from the Universal Sign Language into readable text in real-time. As an extension we also aim to convert Video symbols into text.\nThis would immensely help deaf people across the globe and allow them for better and more efficient communication during this time of Global Pandemic where the mode of communication is mostly through video conferences."}, {"idNo": 6, "name": "Get It Right", "desc": "Bend it the right way!", "devfolioLink": "https://devfolio.co/submissions/get-it-right-2e96", "githubLinks": ["https://github.com/Pratye/Get-It-Right"], "special_mention": "2nd", "stacksUsed": ["Machine Learning", "Deep Learning", "MIT App Inventor", "Google Firebase", "MIT Personal image classifier", "Mobile net", "Posenet app extension"], "longDesc": "The problem Get It Right solves\nThe past year has been difficult for the entire world in many spheres, be it personal or professional. But the most prominent issue was maintaining our health and lifestyles. We resorted to various forms of home-workouts, which sadly had more adverse consequences than positive results. This was mainly due to insufficient knowledge of warmups and postures, which resulted in performing the exercise wrong. The sudden surge of heavy-duty positions made our bodies dangerously sore and we would wonder if we had accidentally nicked an artery or burst a blood vessel. Keeping this in mind, we have developed a model which can help us assess our excercise postures using Posenet app extension and Mobile net Deep learning model. The app uses video recognition technology to assess the postures and provide us results. The was constructed using the MIT's Personal Image Classifier and the app was constructed over MIT App inventor."}, {"idNo": 7, "name": "Hiring Node", "desc": "For your one-stop effective hiring", "devfolioLink": "https://devfolio.co/submissions/hiring-node-8396", "githubLinks": ["https://drive.google.com/file/d/1Y9WOPY57d-JRcPManwMF_-0aNqE1RrOG/view?usp=sharing"], "special_mention": "1st", "stacksUsed": ["JavaScript", "Flask", "Python", "Nodejs", "CSS3", "HTML5"], "longDesc": "The problem Hiring Node solves\nHiring? Let us make your process efficient!\nInterview\nSmoothly conduct and manage hiring drives.\nCollaborate\nCollaborate with Panel efficiently.\nFeedback\nBetter feedback consolidation and management.\nAPI\nIntegrate your existing systems with our APIs.\nHiring Drives\nCreate hiring drives with ease.\nAdd as many candidates to the drive.\nConfigure drives hastle-free.\nGet real time analytics for the hiring drive on dashboard.\nDrive\nInterviews\nEasily assign interviewers.\nManage interview rounds and process.\nStore and consolidate feedbacks and ratings.\nMake informed selection decisions.\nInterview\nAnalytics\nGet real time analytics for your hiring drive\nCandidate status.\nNumber of candidates in each round.\nDiversity.\nInterviewer analytics.\nSo on."}, {"idNo": 8, "name": "Accident Detection Using Camera Surveillance Video", "desc": "•The accident detection in traffic using camera surveillance video can be achieved from Artificial Intelligence. •The main objective of our project is to save people from danger occurring by accidents", "devfolioLink": "https://devfolio.co/submissions/accident-detection-using-camera-surveillance-video-1ef5", "githubLinks": ["https://github.com/Megha6319/Accident-Detection-Using-Camera-Surveillance-Video"], "special_mention": " ", "stacksUsed": ["Artificial Intelligence", "Python", "Jupyter Notebook", "OpenSource Datasets"], "longDesc": "The problem Accident Detection Using Camera Surveillance Video solves\n•The Problem Statement-It deals with the issue of 1)Traffic Management and 2)Accident Detection.\n•The Solution Statement-For the issue of Traffic Management and Accident Detection could be -> 1)Smart Traffic Management-It manages the excess traffic flow and 2)Real-time Accident Detection-By detecting real-time,the response time to such events can be reduced drastically.\n•Accidents occur due to collisions between any two objects on any given road at any given time.\n•Accident detection mainly deals with tracking the vehicle movement direction which can help us detect if two objects under consideration have collided based on their movement pattern in real time.\n•The idea of our project is Cameras can be fixed on the roads beside the traffic signals.A sensor will be connected to a camera,as soon as an accident occurs, the sensors gets activated from the sound that occurs due to accidents and it starts capturing video of the accidents and this particular video could be shared to the nearby police station since it could be helpful to reach out to the accident occurred and also to the nearby hospitals.\n•Since the population in India is high , the number of vehicles on the road are also high which results in higher rate of accidents and death rate.\n•We can overcome this limitation by proposing an approach to detect accidents from the Camera video using the vision based techniques.\n•Most of the people are not aware that giving water to the person who meets an accident might cause death.This suggestion is being given from the doctors itself.\n•The quickest response to roadway crashes is important for saving lives of the people from the accidents by Traffic Management.The person who meets with the accident needs to be hospitalized in nearby hospital as early as possible."}, {"idNo": 9, "name": "Solar Slab bike", "desc": "A new invention that is totally contributed to nature regards to energy conseravtion and energy efficiency with dual integrated charging techniques.", "devfolioLink": "https://devfolio.co/submissions/solar-slab-bike-93c7", "githubLinks": ["https://meet.google.com/ryh-kegw-wwx"], "special_mention": " ", "stacksUsed": ["Solar Panel", "DC gear motor"], "longDesc": "The problem Solar Slab bike solves\nAffordable and comfortable bike, convenient to all aged peoples, helpful in controlling pollution to a great extent can be used in the large college campus, offices wherever it is required . highlighting the two problems that it solves are firstly energy conservation i.e it conserves the chemical enegry and fossil fuels that are replenishing from the earth interior, secondly energy efficiency , this newly invented designed bike is totally based on two techniques of charging , where solar energy is present in abundance, also a green source of charging. The parts used are easily repairable and available. the main scope of this bike is to replace the fueled bikes that are regularly causing pollution and this design easily fits for all aged people. considering this model answering how it can be beneficila in future, as all the automobiles are diverted from fuel to E- automobiles, with the few modification of this bike will provide new start-ups and simply directs a positive impact on MSME sector. where every year millions of jobs are created from the renewable energy."}, {"idNo": 10, "name": "Menu Base Program for a CafeBilling.", "desc": "This program represents a Menu of a cafe, through which a customer gives their order and after completing the program show their total amout of Bill to be pain.", "devfolioLink": "https://devfolio.co/submissions/menu-base-program-for-a-cafebilling-3269", "githubLinks": ["https://www.programiz.com/c-programming/online-compiler/"], "special_mention": " ", "stacksUsed": ["C Prograamming"], "longDesc": "The problem Menu Base Program for a CafeBilling. solves\nThis program is used in every cafe counter so that the receptionist may not suffer problem to manage the oder and calculate the particulars bill, and maintain their accounts and reputation in the market."}, {"idNo": 11, "name": "Team11", "desc": "one stop destination for Cricket Enthusiasts", "devfolioLink": "https://devfolio.co/submissions/team-17a2", "githubLinks": ["https://github.com/RuntimeTerror404"], "special_mention": " ", "stacksUsed": ["JavaScript", "scikit-learn", "pandas", "Ionic", "AngularJS", "Python", "PostgreSQL", "XGBoost", "nest.js"], "longDesc": "The problem Team11 solves\nWhen people go to fantasy team platform like dream11 or mpl in order to make our fantasy team, the most common problem which arises is the insufficient knowledge of users about the stats, form and all other factor."}, {"idNo": 12, "name": "Self -Disinfentive Glove and other PPEs", "desc": "To Serve Those, Who Serve Us.", "devfolioLink": "https://devfolio.co/submissions/self-disinfentive-glove-and-other-ppes-e8f5", "githubLinks": ["https://youtu.be/ipFfT6R4xKw"], "special_mention": " ", "stacksUsed": ["C++", "Arduino", "self-disinfection", "alcohol", "successful working prototype"], "longDesc": "The problem Self -Disinfentive Glove and other PPEs solves\nOn the time of COVID-19 pandemic ,It is clearly noticeable that doctor and medical staffs are highly affected with COVID-19 because of the traditional PPEs are not enough to construct an efficient protection against such a contagious virus. It is also proved that novel corona virus can easily spread through medical equipment. So there is a necessity to innovate in the field of Personal Protective Equipment (PPE). So, The spreading of contagious pathogens can be definitely-reducible by the use of this glove.\nPoints-\n1.Doctors and medical staffs are not enough protected from COVID19.\n2.Our limited Recourses are beings harmed by using disposable gloves and other PPEs.\n3.We are making more medical waste ."}, {"idNo": 13, "name": "teaching-made-easy", "desc": "To solve the problems faced by teachers as well as students during online education/classes.", "devfolioLink": "https://devfolio.co/submissions/teachingmadeeasy-8618", "githubLinks": ["https://github.com/Tanmay000009/teaching-made-easy", "https://teaching-made-easy.co/"], "special_mention": " ", "stacksUsed": ["Bootstrap", "CSS", "JavaScript", "OpenCV", "Deep Learning", "ngrok", "Natural language processing (NLP)", "HTML5"], "longDesc": "The problem teaching-made-easy solves\nPandemic has affected almost every person irrespective of their occupation. Even though the medium of education has shifted from Offline to Online,and work from home is encouraged for everyone,yet during these tough times,teachers’ lives have become tougher. As many of our teachers have children,who too have online classes from hom,it becomes really hard for our teachers to manage their time in evaluating assignments and tests. In addition, keeping an eye on every student is also a challenge during online classes. Students of the primary school also struggle as many of them don’t have knowledge of operating computers, and parents have to sit with them throughout the class to assist them in doing so. Keeping in mind that many parents are working, online classes fail to be interactive, comfortable, and productive for many students.We have created an Assignment Checker using NLP.The checker will take the questions and their model answers/ ideal answers as input from the teacher. The students will submit their answers through a form,from which data will be fetched and fed into our Deep Learning Model of NLP following which the grade will be displayed.The web page interface allows options to create assignments, as well as show students’ performance and class performance.For keeping an eye on every student during the online sessions hosted on any platform, we have created a python program using OpenCV library, which will take the video feed of live class as input and give tags to everything it identifies as human.The tags will be - attentive, not attentive, confused, and speaking. Also, many students get unnoticed during classes as they don’t know about the feature of raising their hands and many don’t know how to raise their hands virtually.We have created another deep learning modelwhich will also take the live feed of online class as input. It will try to identify hand gestures of students, and will classify them as “raising hand”, “mute” and “unmute”"}, {"idNo": 14, "name": "Proctured Based Examination System", "desc": "An Easy and Efficient Way to conduct Examinations", "devfolioLink": "https://devfolio.co/submissions/proctured-based-examination-system-f445", "githubLinks": ["https://github.com/shahhilag/Proctured_Examination_System"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "OpenCV", "Python", "CSS3", "HTML5"], "longDesc": "The problem Proctured Based Examination System solves\nWith our tool we target to touch the-\nTeachers-Teachers are always doubtful whether students are clear about a topic or not in online mode and examination is the only way they can get this problem answered. Thus creating a secure testing environment will benefit the teachers as well as students.\nGovernment Organisations- Government organisations are like universities and NTA, as we observed during the pandemic trust offline mode more than the online examination as security is a foremost issue during such exams. But our tools would ensure the maximum safety to all the users.\nMNCs- MNCs also can take interviews on the tool to increase their reach to maximum talented people and trusting their talent due to the secure environment offered by the tool.\nOur tool can be used by any range of people who aim to conduct a secure examination and that to with minimum work at their end.\nHOW OUR APPLICATION WILL BE DIFFERENT FROM OTHERS\n1.Student will able to login only when his/her face will be match by the photographs uploaded by exam authority i.e this will act as face lock.\n2.Whenever student will try to exit full screen without submitting answers then they will be automatically get log out and act as cheated.\n3.We have implemented other securities apart from face detection so that in any case if face goes undetected or there is low network bandwidth a secure enviornment does not get compromised.(We have disabled few keyboard keys like ctrl, shift and right click.)\n4.Teacher can upload question even before one month and exam will only start at given time.\n5.No invigilator is required because our backend will handle this.\n6.Results will be automatically get calculated by our application."}, {"idNo": 15, "name": "AR Museum", "desc": "It is an AR portal of a mueseum where you enter into a exciting educative world", "devfolioLink": "https://devfolio.co/submissions/ar-museum-c646", "githubLinks": ["https://github.com/coder1712/AR-mueseum.git"], "special_mention": " ", "stacksUsed": ["ARCore", "Blender", "Unity3d"], "longDesc": "The problem AR Museum solves\nProvides an interactive educational enviournment"}, {"idNo": 16, "name": "Room automation of light", "desc": "This project basically works upon that whenever a human motion detected; if amount of light is less then the bulb automatically glow and if there is sufficient light then the bulb wouldn’t glow.", "devfolioLink": "https://devfolio.co/submissions/room-automation-of-light-9ac0", "githubLinks": ["https://github.com/akabundi/room-automation-"], "special_mention": " ", "stacksUsed": ["● Arduino Uno R3", "● Motion sensor (PIR sensor)", "● Light bulb", "● Photoresistor", "● Kohm Resistor", "● (0.6) amperes", "7.19999 volts power supply"], "longDesc": "The problem Room automation of light solves\nRoom automation allows you to add smart lighting to your system so that you can be able to monitor and control your home's lighting from an app on your smartphone. It can even detect if amount of light is less then the bulb automatically glow and if there is sufficient light then the bulb wouldn’t glow."}, {"idNo": 17, "name": "Infographs", "desc": "We offer modern insights and solutions for growing your business.", "devfolioLink": "https://devfolio.co/submissions/infographs-b7c7", "githubLinks": ["https://github.com/rgdevelopings/Infographs", "https://infographs.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["CSS", "JavaScript", "Flask", "PyTorch", "Machine Learning", "Python", "Nodejs", "HTML5", "Streamlit"], "longDesc": "The problem Infographs solves\nIn today’s global marketplace, the ability to communicate effectively and multi-culturally should not be underestimated. To communicate in such an environment, it’s important for professionals to act culturally intelligent which can be done when the professional develop cross-cultural communication skills. We at Infographs work with individuals from a wide range of diverse backgrounds and cultures.\nCompanies across most sectors and industries aspire towards facilitating decision-making, driving innovation, reducing costs and improving quality. Today companies can achieve these objectives by harnessing the power of analytics, which has greatly evolved due to the explosive growth of business data and technological advancements. We pledge to deliver the impossible. Having responsibility and commitment to the preservation of corporate data is of utmost importance to the people at Infographs. Infographs as an organization understands that when a customer undergoes leakage of information, the consequences can be very serious. Infographs make sure that while providing services to our customers we respect their data integrity."}, {"idNo": 18, "name": "Next Gen e-Classroom", "desc": "Tagline : Standalone web/mobile application alternative for managing all Classrooms.", "devfolioLink": "https://devfolio.co/submissions/next-gen-eclassroom-9406", "githubLinks": ["https://github.com/RaajeevChandran/Hack-A-Nova-Project"], "special_mention": " ", "stacksUsed": ["Firebase", "JavaScript", "Dart", "Flutter"], "longDesc": "The problem Next Gen e-Classroom solves\nThe problem it solves : Our application lets the teachers and students communicate in a streamlined way under a single platform rather than opting for different websites to manage their classwork.\nOur key features include:\nFor Teachers:\n1. Teachers can create classrooms which will then let them create Quiz,Assignments and Coding Assignments.\n2. Coding Assignments are enabled to be graded based on the test-cases given by the teacher.\n3. Statistics about the student's grades.\n4. Interaction with students in inbuilt chat for each classroom\nFor Students:\n1. Easy interaction with teachers.\n2. Can submit code assignments through builit-in code compiler.\n3. Easy interaction with teachers with inbuilt chat.\n4. Scan assignments in PDF format using built in PDF scanner"}, {"idNo": 19, "name": "MILA KYA?", "desc": "THE LOST & FOUND APP OF DTU", "devfolioLink": "https://devfolio.co/submissions/mila-kya-b24b", "githubLinks": ["https://github.com/debugger13524/MilaKya", "https://drive.google.com/drive/folders/1g8_IgOi1IytZfs2qWynquMJR_NntL7L-", "https://youtu.be/G0TwCRQ3hW8"], "special_mention": " ", "stacksUsed": ["Firebase", "Flutter", "Google Maps API", "Adobe Photoshop", "Adobe Illustrator", "Firestore", "Google Location services", "Firebase Authentication"], "longDesc": "The problem MILA KYA? solves\nProblem :\nAlmost everyone of us had either lost or found any item but didn’t got the right platform to\nmake sure the lost item is returned to its owner.\nThis is what happened with us when we found a Rs 500 money note in college campus\nnear Maggie baba and as a traditional practice we gave it to the Maggie baba.\nFrom here we got the solution to the daily life problems by designing and developing this\napplication for DTU specifically in its initial stage.\nAim :\nThe application aims to make ONE-STOP destination for all the students and professors in a\nuniversity to facilitate finding lost items which get lost in the campus and nearby locations\nthrough this application.\nIntroduction :\nThis project is an application where each person inside University can find the lost Personal\nproperty or Disseminate the lost property.\nIf you find something lost such as a wallet or mobile this application would make it easier\nfor you to search for its owner.\nThrough this application we can announce the lost property if any item gets lost or we can\nalso announce the found item's details to find its owner."}]