[{"idNo": 0, "name": "RAHAT", "desc": "Remote Application for Health Assistance And Tracking \"COVID mein dooriyan nahi\"", "devfolioLink": "https://devfolio.co/submissions/rahat-b7fc", "githubLinks": ["https://github.com/mrcodefrost/bitbox_220_volts", "https://drive.google.com/drive/folders/1n7m83BC7HIsAB22Z02U7yCpzIJEsBkI1?usp=sharing"], "special_mention": "Top 5", "stacksUsed": ["Java", "Internet of Things (IoT)", "REST API", "Arduino Uno", "Flutter", "Sensors", "ESP8266 Wifi MCU", "Cloud"], "longDesc": "The problem RAHAT solves\nRAHAT implements sensor technology and the internet to communicate with loved ones in case of problems. This system also shows patients' temperature and heartbeat tracked live data with timestamps over the Internetwork. Using the cloud nearby hospitals can access the data and help the patient if in case of an emergency. The mobile app has been developed as a smart portal for end-users integrated with a push notification service. It also has other features like COVID-19 News, videos. The app has an authentication feature also. This project will continuously monitor the vitals of the patient and send the alert to the app if and when some unusual trend is seen for a period of time. It will also intimate the nearby hospitals."}, {"idNo": 1, "name": "Food Finders", "desc": "It is a platform which will provide reliable and nutrious food to undernourished and malnourished people in order to eliminate the problem of \"HUNGER\" from our society.", "devfolioLink": "https://devfolio.co/submissions/food-finders-02ad", "githubLinks": ["https://github.com/viditrv123/BitBox"], "special_mention": "Top 5", "stacksUsed": ["JavaScript", "MERN stack", "echoAR", "CSS3", "HTML5", "Ethereum Blockchain"], "longDesc": "The problem Food Finders solves\nOur project is a medium of communication between NGO’s and the Hotels and Restaurants to serve one mission that is Zero Hunger. The food that gets wasted in Hotels and Restaurants can fill someones stomach. So our website will give information of the amount of food that can be distributed to people in need to the various NGO’s who can collect the food from Hotels and Restaurants for distribution. It will also serve a medium for common people to post request to NGO’s to collect the food that might be left in any of their personal event. There is also an option for donation of money so that we may feed people."}, {"idNo": 2, "name": "Secret Angel", "desc": "Allow only verified NGO/ organization.Collaboration with streamer.Provide E-certificate, Hampers & ITR-7 certificate.", "devfolioLink": "https://devfolio.co/submissions/secret-angel-f3d9", "githubLinks": ["https://github.com/sarthakpant772/BruteForcefinal"], "special_mention": "Top 5", "stacksUsed": ["Django", "JavaScript", "Python", "PostgreSQL", "HTML/CSS", "Pga"], "longDesc": "The problem Secret Angel solves\nProvide Financial resources to combat Poverty\nImprove quality of life of the Neediest"}, {"idNo": 3, "name": "MedShare", "desc": "When we refuse to reuse, it's our Earth we abuse.", "devfolioLink": "https://devfolio.co/submissions/medshare-403f", "githubLinks": ["https://github.com/Aps1177/MedShare"], "special_mention": "Top 5", "stacksUsed": ["* Android - Native Development using Kotlin * Firebase Authentication * Firebase Real time Database * Firebase Firestore * MVVM Architecture"], "longDesc": "The problem MedShare solves\nWe often end up having leftover medicines that we no longer needs. These meds\nwill surely go into trash, creating waste, polluting and damaging our lovely earth.\nOur app presents a solution to this. Anyone can donate their leftover meds, these\nmeds can be use by others (needy). Reducing medicinal waste, saving our earth,\nand at the same time earning discounts on next medicine purchase.\nWin Win for all."}, {"idNo": 4, "name": "CareClub", "desc": "Happiness doesn't result from what we get, but from what we give. To care is to share. 🤗", "devfolioLink": "https://devfolio.co/submissions/careclub-d03f", "githubLinks": ["https://github.com/shubhangi-singh21/CareClub", "https://tinyurl.com/careclub-apk", "https://tinyurl.com/careclub-ppt"], "special_mention": "Top 5", "stacksUsed": ["Flutter", "Adobe XD", "Firebase Authentication", "Firebase Firestore", "Razorpay API", "Adobe After Effects", "Firebase Geolocation"], "longDesc": "The problem CareClub solves\nOur application solves the problem of having a secure as well as a transparent donation app that aligns with the UN global Sustainable Development Goals (SDGs). Our app is designed to bridge the gap between the needy and the donor by providing contactless pickup from the user's doorstep during an uncertain pandemic.\nWe built this app with a vision to help those in need, and reach out to them from any part of the world, right from your home. To eliminate the stigma of monetary donations, we promote donations in the form of food, clothes, books, advertisements, and money as well, via our app. Our app includes various checkpoints for the verification of authentic and usable non-monetary donations to eliminate fraud/not usable donations (clothes, food, etc). Our app also provides a final donation verification in the form of pictures uploaded by the NGOs for the donor to see their donations reach the needy."}, {"idNo": 5, "name": "Shiwu", "desc": "A soil detector and crop predictor to promote sustainable agriculture.", "devfolioLink": "https://devfolio.co/submissions/shiwu-1769", "githubLinks": ["https://github.com/Nishtha0801/shiwu", "https://youtu.be/zITK5kN8mzU"], "special_mention": "Best All Girls", "stacksUsed": ["Flask", "TensorFlow", "Machine Learning", "Deep Learning", "Keras CNN", "cnn"], "longDesc": "The problem Shiwu solves\nTechnology is supposed to be utilised for the greater good and our project aims to cover three vital sustainable development goals. When technology started to exist, it did because of one commmon goal - Technology for the greater good. Since childhood, we are being taught the principles of sustainable development and ways we can revolutionise the world and take care of our planet.\nZero Hunger: With the knowledge of the right crop for your soil, more crops can be produced thereby ending hunger.\nResponsible Consumption and Production: We detect the correct soil and suggest the best crops which can be grown thereby ensuring sustainable production patterns.\nLife on Land: When the right crop is being grown on the soil, the soil resources are utilised properly thereby preventing desertification and trying to halt desertification.\nHow does this work? \nWe used a soil classification dataset with four different types of soil - alluvial, black, clay and red soil which was available on Kaggle. It contains both train and test datasets for the different soil types. We have 5 hidden layers in the model. Our first layer is sequential as there's only a single input. Since it is a picture we need to flatten the RGB content. We have then used batch normalisation layer to normalise the mean output and standard deviation. Then we have densely connected 4 layers. Again, to normalise the output we have used batch normalisation and we have used the activation function 'softmax'. We have compiled the whole model using optimiser 'Adam' , handled losses using 'categoricalCrossentropy' and using metrics 'accuracy'. We have set up 50 epochs for better accuracy. Then we used flask to integrate it with our website,\nWho can use this tech?\nFarmers and even people who wish to have an in-house garden at their place can utilise this software and get the best suggestions for their next produce."}, {"idNo": 6, "name": "ZEROHUNGER", "desc": "OUR WEBSITE PROVIDE LEFTOVER FOOD IN WEDDING ,HOTELS,HOMES TO THE NEEDY PEOPLE/POOR PEOPLE", "devfolioLink": "https://devfolio.co/submissions/zerohunger-a4a6", "githubLinks": ["https://github.com/krishna-s11/Bitbox"], "special_mention": "Best Freshers Team", "stacksUsed": ["JavaScript", "SASS", "PUG", "Express.js", "MongoDB", "mongoose", "Google Direction API", "Nodejs", "CSS3", "HTML5"], "longDesc": "The problem ZEROHUNGER solves\nPEOPLE CAN USE IT TO DONATE THE LEFTOVER FOOD. IT AVOIDS WASTAGE OF FOOD AND PROVIDES EMPLOYEMENT TO THE DELIVERY BOYS AS THEY WILL TAKE THE LEFTOVER FOOD FROM THE FOOD DONOR AND GIVES IT TO THE ORGANIZATIONS/NGO'S. WHICH WILL ALSO MAKE THEIR WORK EASIER."}, {"idNo": 7, "name": "DustBinz", "desc": "Get the nearest dustbin in one click", "devfolioLink": "https://devfolio.co/submissions/dustbinz-c6cb", "githubLinks": ["https://expo.io/@_extreme_/projects/DustBinz"], "special_mention": "Victory Stand(3rd Place)", "stacksUsed": ["FrontEnd-> ReactNative(Expo)", "BackEnd->NodeJs", "OtherApi's->Google OAuth Google Map"], "longDesc": "The problem DustBinz solves\nThe project comes under Goal-12(Responsible Consumption & Production) of the 17 Sustainable Development Goals of the United Nations. Through this project our aim is to motivate and educate citizens to throw waste in garbage containers. We aim to achieve this goal through a mobile APP which will give the nearest dustbin location to the user, and also a leaderboard system for contributing the location of dustbins, not only this we are also giving the feature of rating the dustbins based on how clean it is, through this data of ratings we can rate an entire area on its cleanliness. For example a user wants to buy a new house he/she can check the rating of the cleanliness of that area before buying."}, {"idNo": 8, "name": "Self-Stabilizing Spoon with Remote Monitoring", "desc": "The stabilizing spoon compensates for unintended tremors or shivers and keeps the spoon bowl stable. The application displays sensor data graphically to the doctor for remote monitoring.", "devfolioLink": "https://devfolio.co/submissions/selfstabilizing-spoon-with-remote-monitoring-f26a", "githubLinks": ["https://github.com/DopeyEnvelope/Team-Chiral_Bitbox", "https://drive.google.com/drive/folders/1yrFd5iVQ36Mkd-xYi6ZPiH8YEsUyserh?usp=sharing"], "special_mention": "Runner-up(2nd place)", "stacksUsed": ["Firebase", "Java", "Internet of Things (IoT)", "NodeMCU", "Kotlin", "Arduino", "Android NDK", "Sensors"], "longDesc": "The problem Self-Stabilizing Spoon with Remote Monitoring solves\nParkinson’s disease is a neurological degenerative disease that results in irrepressible shivers in the limbs. Due to unintended tremors in their arms, patients are unable to perform everyday menial tasks like eating food out of a bowl with a spoon.\nThe stabilizing spoon compensates for unintended tremors or shivers received from the user and calibrates its head against these forces, thus keeping the spoon bowl stable at all times. This spoon can move as quickly as 500°/second, hence effectively steadying the spoon and easing the eating process of patients.\nAnother part of the holistic product is a mobile application for a designated doctor to monitor the patient’s progress. \nDuring this pandemic, people have been terrified of entering hospitals for non-COVID diseases and ailments, and we aim to create and market a product to help people adjust better to this new norm.\nWe have developed an application that analyses data collected from the spoon via sensors and statistically displays it to the designated doctor. By using this application, a doctor can not only monitor your progress but also offer diagnosis and treatment remotely, without the patient needing to leave their home.\nWith this project, the absolute aim is to make a product that can make a patient’s life easier.\nThe product will not only make it easy for the user to eat food out of a plate/bowl but also help their recovery by enabling inexpensive and thorough communication with a designated doctor.\nIn an age where people are petrified of the thought of entering the premises of a hospital, we are trying to use all the technical experience we have to create an experience that avoids as much physical contact as possible.\nIn the case of neuro diseases associated with nerves and muscles, it is imperative for the doctor to check up on the patient’s movements regularly, but we have attempted to find a way for doing that without requiring the patient to ever enter a hospital."}, {"idNo": 9, "name": "Prayog", "desc": "Do science practicals virtually by speaking. no more practicals memorisation:)", "devfolioLink": "https://devfolio.co/submissions/prayog-1598", "githubLinks": ["https://github.com/AkshaySharmaDEV/Prayog3d", "https://akshaysharmadev.itch.io/prayog"], "special_mention": "Winners", "stacksUsed": ["Blender", "Unity3d", "C#", "windows speech"], "longDesc": "The problem Prayog solves\nwe are working on theme \"Quality Education\". Practical knowledge is must for an engineer due to covid 19 lockdown it is not possible for the institutions to physically host practical classes so to tackle this problem we have made Practical Simulation Software \"Prayog\" using Unity Engine, it will help students to perform practicals virtually, the main feature of this software is that practical can be performed by speaking. it will help to perform the experiment without touching mouse, touchscreen or keyboard so the there will be less chance to come in contact with covid 19 or any other viruses."}, {"idNo": 10, "name": "EndangAR", "desc": "Life is life's greatest gift! Lets not let it get extinct.", "devfolioLink": "https://devfolio.co/submissions/endangar-bfce", "githubLinks": ["https://github.com/daemon1024/endangAR", "https://daemon1024.github.io/endangAR/"], "special_mention": "echoAR", "stacksUsed": ["jQuery", "Bootstrap", "CSS", "JavaScript", "echoAR", "Leaflet.js", "HTML5"], "longDesc": "The problem EndangAR solves\nAnimals all around are being hunted and consumed to satisfy the wants of humans. And while not necessary, it’s being done a lot. A lot of animals have been completely wiped out due to the damage caused by us humans, and we don’t even realise or acknowledge it. We wanted to spread and create more empathy and knowledge towards the environment and wildlife out there."}, {"idNo": 11, "name": "EasyDocs", "desc": "Student needs, simplified.", "devfolioLink": "https://devfolio.co/submissions/easydocs-c918", "githubLinks": ["https://github.com/adityashukzy/Easy-Docs", "https://share.streamlit.io/adityashukzy/easy-docs/main/st_app.py"], "special_mention": " ", "stacksUsed": ["TensorFlow", "Keras", "Google Text to Speech", "sumy", "Pdfplumber", "Streamlit", "EasyOCR"], "longDesc": "The problem EasyDocs solves\nThe essence of EasyDocs is in the name: we want to simplify and make educative tools a no-nonsense aspect. From our minimalistic UI (crafted through Streamlit) and easy-to-use tools, efficiency with time and simplicity of use have been some of the most important motivating factors for EasyDocs.\nEducation is hard enough for so many of us. This is more so the case for students with learning disorders such as dyslexia and ADHD. Going through pages and pages of monotonous text can be especially laborious which was the motivation behind the summarization and PDF to audiobook modules.\nIn addition, we also added EzPz: a cute little chatbot to guide you about EasyDocs :)"}, {"idNo": 12, "name": "BrezCare", "desc": "Save the Pink!", "devfolioLink": "https://devfolio.co/submissions/brezcare-26a1", "githubLinks": ["https://drive.google.com/drive/u/1/folders/14OLquF3DmJ4iOwcIgVgrb1-lt727PDdX"], "special_mention": " ", "stacksUsed": ["We built our app on Android Studio using language – JAVA and XML. Its is an android friendly app. We made the user interface on Adobe xd."], "longDesc": "The problem BrezCare solves\nBreast Cancer is a prevailing health issue which needs a feasible solution to it. According to statistics, non-detection of the disease leads to exponential number of deaths. Our app helps in early detection and its cure."}, {"idNo": 13, "name": "Diabetes Detection WebApp", "desc": "Users will first need to log in to our site(we will get their data) in order to use our services to predict if they are diabetic or not", "devfolioLink": "https://devfolio.co/submissions/diabetes-detection-webapp-dc26", "githubLinks": ["https://github.com/Heuristic-Hex-Hack/BitBox", "https://anidec.github.io/final-website/"], "special_mention": " ", "stacksUsed": ["Firebase", "JavaScript", "scikit-learn", "pandas", "Python", "Pillow", "HTML/CSS", "Heruko", "Jitsi", "Streamlit"], "longDesc": "The problem Diabetes Detection WebApp solves\nDiabetesis an increasingly growing health issueduetoourinactivelifestyle. Ifdiabetesis notdetectedtimely it may leadto variousotherproblemslike kidney failure,etc."}, {"idNo": 14, "name": "RAKSHAK", "desc": "My safe place-for the women,by the women", "devfolioLink": "https://devfolio.co/submissions/rakshak-f74d", "githubLinks": ["https://www.canva.com/design/DAEZU5DX-yI/rVjc3-dn-9x-RFVIDHZB3g/view?utm_content=DAEZU5DX-yI&utm_campaign=designshare&utm_medium=link&utm_source=sharebutton", "https://rakshak-jlc.netlify.app/"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "CSS", "JS"], "longDesc": "The problem RAKSHAK solves\nNot a day goes by where you don’t hear of the news of a crime against women in India. In fact, there are at least five news articles that tell us about the horrific details of the various crimes. It is extremely painful to watch the status of women’s safety in India, especially in a country where women are given the stature of goddesses. The list of crimes against women is quite long, to say the least.So we came with a solution RAKSHAK, if you ever feel unsafe you can contact your near one, or the police with live GPS tracking facility."}, {"idNo": 15, "name": "Music Recommendation using facial expression", "desc": "Detect the face and recommend the songs . Based on the expression of a person", "devfolioLink": "https://devfolio.co/submissions/music-recommendation-using-facial-expression-8a23", "githubLinks": ["https://github.com/lohitslohit/Music-Recommendation"], "special_mention": " ", "stacksUsed": ["Deep Learning"], "longDesc": "The problem Music Recommendation using facial expression solves\nTo solve Depression of person"}, {"idNo": 16, "name": "Open-Source Learning Assistant AR", "desc": "Useful to anyone who is interested to learn about Open-Source Technologies and Linux kernel and mainly useful to children by teaching them these complex concepts in a fun way using Augmented Reality.", "devfolioLink": "https://devfolio.co/submissions/opensource-learning-assistant-ar-7c18", "githubLinks": ["https://github.com/gbhanuteja23/BitBox_Project_2021", "https://github.com/gbhanuteja23/BitBox_Project_2021/blob/main/APKs/1-%20Final%20Build%20APK/Open-Source%20Learning%20Assistant%20AR%20v2.0.4%20Final%20Build.apk", "https://youtu.be/jIlL40Cf2f0"], "special_mention": " ", "stacksUsed": ["Dart", "C#", "unity engine", "Augmented Reality(AR) SDKs like ARFoundation by Unity and ARCore by Google", "Flutter SDK by Google", "Flutter Unity Integration Plugin"], "longDesc": "The problem Open-Source Learning Assistant AR solves\nThis AR APP(Open-Source Learning Assistant AR ) will be useful to anyone who is interested to learn about Open-Source Technologies and Linux kernel and mainly useful to children by teaching them these complex concepts in a fun way using Immersive Technologies like Augmented Reality(AR).\nOne can type some commands on the terminal which gets augmented into reality and can see what those commands do in AR.\nOur app presents users with a list of commands from which he can choose and learn the functionality of that command in a Terminal presented to him in Augmented Reality. If that command does not exist in the list of commands then our app redirect him to another scene where using Unity Web View feature one can browse about that command on the web.\nWe will even be analyzing the way the user is using the APP, by storing the usage time on various sections, no of taps on the screen which will tell whether the user is really learning or not and many more parameters, using all this data our ML model will analyze this and can predict the outcomes like with what pace user is learning, how much one has learnt, how much is one able to understand and much more."}, {"idNo": 17, "name": "EDEZE", "desc": "Easing out exams, assignments and other classroom activities enchanced by google search. We are focusing on quality education goal.", "devfolioLink": "https://devfolio.co/submissions/edeze-cf70", "githubLinks": ["https://github.com/YashashwiniDixit/EDEZE"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "Django", "JavaScript", "Python", "CSS3", "Remote SQL", "Google Search Enhance"], "longDesc": "The problem EDEZE solves\nIt is a platform wherein continuous assessments, final exams and even mock exams can be conducted using web proctored environment with automatic assessments for mock exams including descriptive long answers. It provides personalized feedback after each exam and progress analysis for a class and a student. This will also include google enhanced search."}, {"idNo": 18, "name": "Dosti", "desc": "Living Without Fear", "devfolioLink": "https://devfolio.co/submissions/societree-898d", "githubLinks": ["https://github.com/"], "special_mention": " ", "stacksUsed": ["CSS", "Java"], "longDesc": "The problem Dosti solves\nWomen in India are very unsafe. Aim to make it safer for them."}, {"idNo": 19, "name": "THE WATER CO", "desc": "Be a pro conserve H2O", "devfolioLink": "https://devfolio.co/submissions/the-water-co-2c8a", "githubLinks": ["https://github.com/Cosmovid21?tab=projects"], "special_mention": " ", "stacksUsed": ["HTML", "JS", "CSS3"], "longDesc": "The problem THE WATER CO solves\nIt aims at sdg 6 clean water and sanitation ,our website delivers only the required amounts of water to a household \nin addition it also provides other information regarding environmental issues also it gives other cool features as well A PERFECT SITE FOR AN ENVIRONMENTALIST LIKE YOU."}]