[{"idNo": 0, "name": "library management system", "desc": "how many books are there in the library and how do manage them?", "devfolioLink": "https://devfolio.co/submissions/library-management-system-8bbe", "githubLinks": ["https://github.com/jYOTIHARODE/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "MongoDB", "HTML/CSS"], "longDesc": "The problem library management system solves\nIf someone wants to find a particular book in the library then he/she can search it online and then see how many quantities are there and how many writers of that book ..."}, {"idNo": 1, "name": "OrganicChain", "desc": "Seamlessly share Organic Food data across with high transparency.", "devfolioLink": "https://devfolio.co/submissions/organicchain-c80d", "githubLinks": ["https://haxplore-orange.web.app/login/login", "https://github.com/NaikAayush/orange-haxplore-2.0/"], "special_mention": " ", "stacksUsed": ["Firebase", "scikit-learn", "AngularJS", "Hyperledger", "Nodejs"], "longDesc": "The problem OrganicChain solves\nTraceability of Organic Food\nOrganic Food is becoming increasingly popular these days, but how do we ensure that the ingredients used in it have been produced where the manufacturer says it has been produced, that they have been stored at ideal temperatures and that this data has not been tampered with.\nOganicChain does exactly this.\nOrganicChain connects producers, suppliers, sellers and consumers to automate the process of supply chain tracking. This increases consumer's trust in the system to ensure organic foods are always safe and of the best quality.\nSimplicity\nFor producer, suppliers and sellers the process is the same as data entry into a system which is already begin undertaken in most establishments. On the producer's side, there is an additional step of printing and applying the QR code to the ingredient.\nFor the consumer, a QR code will be displayed on the food item which they simply have to scan using a QR code scanner (built into most phones these days) and OrganicChain will display all details of the producer, supplier and seller along with item weight, storage temperature and exact timestamp of dispatch and arrival at each location.\nThe consumer does not need to have any special app installed, they only have to scan the QR code and click on the link.\nSecurity\nThe consumer needs to ensure that the data is not tampered with at any point in the supply chain. The change log needs to reflect which part of the data was changed and store the previous version too. OrganicChain does this by using a blockchain network to store all data.\nIn summary, OrganicChain stores all versions of the data thereby ensuring that it cannot be tampered with.\nFeatures\nHyperledger Blockchain for data\nProducer login\nProducer create new item\nQR Code gen\nSupplier login\nSupplier update existing item\nSeller login\nSeller update existing item\nQR code scanning to get all data (consumer)"}, {"idNo": 2, "name": "Exam Buddy", "desc": "Group study sessions? Exam buddy is here!", "devfolioLink": "https://devfolio.co/submissions/exam-buddy-d7be", "githubLinks": ["https://tanisha1431.github.io/ExamBuddy/main.html", "https://github.com/tanisha1431/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["", "1. Node.Js (logo/icon)", "2. MongoDb Atlas (logo/icon)", "3. Heroku (logo/icon)", "5.AWS (logo/icon)", "4. Discord.js npm package (logo/icon)"], "longDesc": "The problem Exam Buddy solves\nIn a time where online classes is the norm individuals feel disconnected as they don't get to do the collaborative group studies which not only had the potential of improving the efficiency of studies but also take out the stress out of the minds of the individuals. While trying to solve this problem the intention is to create a tool which promotes collaborative studies among individuals in existing platforms familiar to them like Discord"}, {"idNo": 3, "name": "Peer IO", "desc": "Review | Grow | Share", "devfolioLink": "https://devfolio.co/submissions/peer-io-7356", "githubLinks": ["https://github.com/Peer-IO/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["Express.js", "MongoDB", "MongoDB Atlas", "axios", "NuxtJS", "Nodejs", "VueJS"], "longDesc": "The problem Peer IO solves\nPeer IO is not just a tool that can provide you with insights into your students’ performance and save you time. It also creates a much better learning experience for your students. Don’t believe us? There’s a bunch of studies that actually prove that it can increase learning up to 30%!\nIn the online post-pandemic world, more and more educational institutions are shifting to the online mode of education. While they are not the best alternative but they seem to do the task. But the situation has been dire where students aren't able to learn from each other and easily receive a review on their work from respective mentors and guides.\nWith Peer IO we intend on solving this issue. So what does Peer IO provide\nAbility to create new assignments and courses for teachers\nAnonymous Feedback and Review amongst students\nGrading system with normalization\nTracking of interaction among students for teachers"}, {"idNo": 4, "name": "Park.ai", "desc": "park anywhere and everywhere, legally!", "devfolioLink": "https://devfolio.co/submissions/parkai-aa70", "githubLinks": ["https://github.com/CHAITANYASAI-del/park.ai", "https://drive.google.com/file/d/1yjOP_oc5GCR5Af3qyaxcSxrgupLeRLiY/view"], "special_mention": " ", "stacksUsed": ["Java", "Python"], "longDesc": "The problem Park.ai solves\n1.On any given working day approximately 40% of the roads in urban India are taken up for just parking the cars.\n2.Tremendous pressure on parking spaces have led to serious concerns like traffic congestion, accidents, disproportionate demand and supply ratio, environmental hazards etc.\n3.Pollutants like oil and grease are washed off from the parking lots into the water bodies during the rains. The pollutants contaminate the water table and are also responsible for urban heat island effect. The pollutants it emits causes health hazards and may cause respiratory and cardiovascular damages.\nPARK.ai :-\npark anywhere and everywhere, legally!\npark.ai is a cross-platform application which allows people to host and park their vehicles at private parking spaces. People can now host their own private parking spaces on a rental basis. It also allows the user to find available parking spaces near them using the app.\nWhy park.ai?\nOn any given working day approximately 40% of the roads in urban India are taken up for just parking the cars.\nTremendous pressure on parking spaces have led to serious concerns like traffic congestion, accidents, disproportionate demand and supply ratio, environmental hazards etc.\nPollutants like oil and grease are washed off from the parking lots into the water bodies during the rains. The pollutants contaminate the water table and are also responsible for urban heat island effect. The pollutants it emits causes health hazards and may cause respiratory and cardiovascular damages."}, {"idNo": 5, "name": "AnnData (अन्नदाता)", "desc": "We are looking to create a one-stop destination for farmers across the nation, that will cater to all their daily needs right from buying,selling assorted items to comparing market prices of products.", "devfolioLink": "https://devfolio.co/submissions/anndata-fded", "githubLinks": ["https://github.com/Shourya-Chambial/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["Bootstrap", "Embedded Javascript (EJS)", "TensorFlow", "AngularJS", "Express.js", "MongoDB", "Nodemailer", "mongoose", "HTML/CSS", "Nodejs"], "longDesc": "The problem AnnData (अन्नदाता) solves\n1) Buying and Selling space: Products can be sold and bought in bulk according to their quality. This service can create a competition between bestselling quality products and can offer services for unique Agro products according to the demand client partners. \n2) Compare the market prices: Person in Agro industry cannot compare the prices of product. So, they can compare the prices of products. \n3) Buying of raw inputs: Fertilizers, manures used are of inferior quality. An excellent quality product (fertilizer) can be put up on the site. It can provide wide of product in Agri input sector especially fertilizers, manures, micro nutrient fertilizers, bio pesticides, Agro chemical, plant hormones and plant regulators. \n4) Basic awareness: It can be served as smart agricultural platform that provided end to end integration solution increasing the yield efficiency and profitability and complete traceability for all the agricultural stake holder. \n5) Constant notifications for farmers: Sending them constant emails regarding purchases, buying quotes and also their applications of various product materials. We also give the numbers of those who are interested to buy items\n6)Compare the market prices: Person in Agro industry cannot compare the prices of product. So, they can compare the prices of products.\n7)Prediction model tells users the exact crops suitable for the given climate and soil conditions.\n8)After prediction the Guidance model will provide the weekly information necessary to grow the crops along with the right amount of Fertilizer and Water required. This ensures that the wastage and hence pollution is reduced.\n9)We have integrated an e-commerce store to our platform so that the users can buy crops directly from the farmers. This will also enable urban farmers to sell their surplus. All the users will also have an added benefit to buying various tools and fertilizers from the platform."}, {"idNo": 6, "name": "Trojan", "desc": "The secret of getting ahead is getting started.", "devfolioLink": "https://devfolio.co/submissions/trojan-b301", "githubLinks": ["https://github.com/aswinidev/Trojan"], "special_mention": " ", "stacksUsed": ["HTML", "Vue.js", "CSS", "JavaScript"], "longDesc": "The problem Trojan solves\nInformative and interactive site for raising awareness in the society regarding health and fitness whose pupose is the empowerment and betterment of society."}, {"idNo": 7, "name": "Art Book", "desc": "The ArtBook for an artist to show, buy and sell paintings. Users can also bid their paintings", "devfolioLink": "https://devfolio.co/submissions/art-book-3349", "githubLinks": ["https://github.com/sauravgpt/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["Dart", "Flutter", "Google Firebase"], "longDesc": "The problem Art Book solves\nA social media app specially made for Art lovers and Artists. \nUsers can upload painting Images or Videos along with sell tags and locations to sell their paintings. \nIt has features like Comment a post, One To One Live Chat, Like on Post, Follow a user with a request, receive live notifications, and GPS support to add upload location."}, {"idNo": 8, "name": "demo", "desc": "demo", "devfolioLink": "https://devfolio.co/submissions/rahat-9298", "githubLinks": ["https://github.com/"], "special_mention": " ", "stacksUsed": ["Java"], "longDesc": "The problem demo solves\ndemo"}, {"idNo": 9, "name": "Feather", "desc": "A simple to use, lightweight video calling service", "devfolioLink": "https://devfolio.co/submissions/feather-507f", "githubLinks": ["https://feather.cf/", "https://github.com/IshaanOhri/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JavaScript", "WebRTC", "PeerJS"], "longDesc": "The problem Feather solves\nDuring the lockdown period, the only means of connecting to our dear ones is through a video call. But at times the video becomes laggy or pixilated and it gets frustrating that we can't view the other person clearly. This leaves us with the only other solution, an audio call. But audio calls are just too boring!\nWell, not anymore. Connect to your dear ones using Feather.\nFeather is a simple to use, lightweight video calling service that lets you connect to your dear ones even in the poorest of networks.\nSo how exactly does Feather work?\nFeather converts your video stream into an ASCII stream right before transmission, in order to provide a seamless user experience, simply because transmission of text requires less bandwidth as compared to the transmission of a video stream.\nConventional video calling services transmit video and audio, while Feather transmits text and audio."}, {"idNo": 10, "name": "Mobile shop", "desc": "displays and sells mobile phones", "devfolioLink": "https://devfolio.co/submissions/mobile-shop-c229", "githubLinks": ["https://github.com/bLackFlasH7/haxplore-2.0-submissions.git"], "special_mention": " ", "stacksUsed": ["Spring"], "longDesc": "The problem Mobile shop solves\ndisplays and sells mobile phones"}, {"idNo": 11, "name": "She Shield", "desc": "Be Sure, Be Safe! Considering the safety and security of women in India in the recent times, We wanted to give a try from our end to address the issue in a simpler and safer way.", "devfolioLink": "https://devfolio.co/submissions/she-shield-3afd", "githubLinks": ["https://github.com/nb9960/haxplore-2.0-submissions", "https://drive.google.com/file/d/1K_SStw8GIY5sMxiKRCtOT1oEjvPWO8om/view?usp=sharing"], "special_mention": " ", "stacksUsed": ["Flutter", "Google Map API", "Crimeometer API"], "longDesc": "The problem She Shield solves\nLooking at the recent trends and the most powerful weapon with humanity - technology, we planned to use the same to give access to women in serious or dangerous situations to address the issue in a fast and easier way to ensure their security.\nMain Features\nMap - To track the current location of the user, guiding for safe routes and crime-prone areas (user would be able to mark the area safe or can view the number of users that have marked the area as safe, currently we are using crimeometer API to check whether the area is safe or not rather than providing information based on other user input)\nVoice Assistant - executes features on voice commands (this will detect if the sentence consists of few keywords such as 'SOS SMS', 'SOS Call', 'Police', 'News' to redirect the user on the desired window)\nSOS - SOS call and SOS messages to user-provided contacts (Which will be stored in shared preferences)\nAdditional Features\nShake - Detects the frequency of shakes and after a certain frequency sends help message with user location to provided contacts\nCamera - To capture image (which can be shared from there itself) or and record video (which is automatically stored in gallery)\nPolice stations - Locates all the nearest police stations\nPolice siren - Rings the police siren\nTaxi - One-touch ola cab facility to books cabs for user\nNews - To guide the users about self-defense techniques which can be extended for providing other useful health emergency guidance."}, {"idNo": 12, "name": "CarVilla -A Car Renting Website(enhanced features)", "desc": "Car Renting Website with enhanced features for making the user's experience better and ease of booking.", "devfolioLink": "https://devfolio.co/submissions/car-renting-website-with-enhanced-features-e9e0", "githubLinks": ["https://github.com/Prashantsetia/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "JavaScript", "CSS3", "H2 DATABASE", "SPRINGBOOT"], "longDesc": "The problem CarVilla -A Car Renting Website(enhanced features) solves\nGeographical condition like Arunachal Pradesh or hilly areas where possibility for renting a car is very less. More people will get access to cars whom wish to rent a car for a trip under a certain price range and at affordable price which will be provided by the customer. People who have car and is not being used can give their car for renting so the car could be easily maintained and they could also earn money. We will provide drivers for those customers who don’t know driving or who opted for driver service. There are not many websites or apps which are being used at such terrains and people often depends on the local markets for renting cars. On occasions like Wedding, Vacation, house shifting, and tour and on many other situations they feel the necessity of a vehicle to sort out the problems. So if it is possible to design or develop a web based application for availing transport whenever and wherever possible, then it will be beneficial for both renter and transport provider. Now a days, by some clicks only, we can get whatever you want at home. We already know about the online shopping, e-banking etc. Similarly, The Car Rental System is the online facility to book cars online within few clicks only. Some people cannot afford to have a car, for those people this system becomes very helpful. This system includes various cars, as per the customer order and comfort, it place the order and deliver the car as per the location within the area. For travelling a long distance, booking can be done via internet service only."}, {"idNo": 13, "name": "Coffee order", "desc": "It is a app for ordering coffees", "devfolioLink": "https://devfolio.co/submissions/coffee-order-d021", "githubLinks": ["https://github.com/pinnacle20/Hypertext-Assassins", "https://github.com/silkie261001/CoffeeOrder"], "special_mention": " ", "stacksUsed": ["Java", "Android Studio", "XML"], "longDesc": "The problem Coffee order solves\nHere person can order coffees of their choice based on 3 different choices available and when user clicks order button it will mail the details which (includes costumer name, costumers' choice and total price of coffee ordered) of coffee ordered to coffee shop owner"}, {"idNo": 14, "name": "ResumePlus", "desc": "Generate your own resume.", "devfolioLink": "https://devfolio.co/submissions/resumeplus-8633", "githubLinks": ["https://github.com/raghav-blacklist1/django-resume"], "special_mention": " ", "stacksUsed": ["Generate your own resume"], "longDesc": "The problem ResumePlus solves\nGenerate your own resume"}, {"idNo": 15, "name": "TECH'N FOOD", "desc": "Know what you eat.", "devfolioLink": "https://devfolio.co/submissions/techn-food-ad2b", "githubLinks": ["https://github.com/RIKI-05/haxplore-2.0-submissions/blob/main/submission_README.md"], "special_mention": " ", "stacksUsed": ["Python", "CSS3", "HTML5"], "longDesc": "The problem TECH'N FOOD solves\nWe built an overall food traceability system that allows customer to compare what the actual information is and what they are served with. It will allow the user to scan the QR on the food product and the user will be directed to a web page of that product where they will see the comparision between the real information and the information given to them . The real information will be kept in the database maintained by the trustworthy third party who will keep track of ingredients their quantity nutritional value etc. The user will be able to compare this information with the information given on the packaging which is usually not that reliable and decide if the product is safe for consumption or not.\nIn simple words the tagline \"know what you eat\" the customers will be able to see the authenticity of what they get."}, {"idNo": 16, "name": "Filling_Gaps", "desc": "Button Dabao Coolie Bulao", "devfolioLink": "https://devfolio.co/submissions/fillinggaps-2f80", "githubLinks": ["https://github.com/yuvaraj-06/Filling_Gaps_", "https://yuvaraj-06.github.io/Filling_Gaps_/", "https://drive.google.com/file/d/18ht1HC51PrYMc1J1ALRM5BfZOIOy_N8n/view?usp=sharing"], "special_mention": " ", "stacksUsed": ["Firebase", "Android Studio", "Python", "FastAPI"], "longDesc": "The problem Filling_Gaps solves\nThe pandemic has made us all learn many things. Whether it's studies, food ordering or jobs we all faced several challenges and the only help to us during this time was the internet. Whether we agree or not, the world is moving towards digitalization at a very rapid rate. Several services are getting digitalized. Thinking about the same we came up with an idea of why we can’t make our railway journeys much more easier, especially that part of the journey off the train. Think of how clumsy it gets when you're carrying huge luggages and searching for coolies everywhere in the station and then bargaining with them. The idea of our project is to save time and efforts for you by finding a coolie. You can now book your coolie before you even reach the station. If you are a patient or with disability you need not worry. We have got a service to book wheelchairs at railway stations which will be made ready for you before your arrival. On the other hand, this app benefits coolies and gets customers to them through one click of a button who otherwise had to literally run beside passengers to get a pickup. Currently the realization of the idea only contains baggage pickup and wheelchair services. But the idea doesn't stop here, in future we also think to add more services for both the users and coolie, using which they can benefit a lot.\nWith digitalization and the stablishment of free wifi and services at railway stations, we are moving towards the path of hightech railways stations. The availablity of 24/7 internet facility makes the task for the coolie easier. They just need a smartphone availability and they are all set to operate the services provided by the app. Looking at many ongoing services outside the railway stations like Swiggy, Zomato, Urban Clap, Uber, and Ola we feel that someday it's possible to get a facility like these into the stations as well."}, {"idNo": 17, "name": "Hassle-free grocery shopping in COVID-19", "desc": "2 gaz duri, app hai zaruri!", "devfolioLink": "https://devfolio.co/submissions/hasslefree-grocery-shopping-in-covid-2f88", "githubLinks": ["https://github.com/divya-gupta-2499/The_Farzi_Rockstars"], "special_mention": " ", "stacksUsed": ["Java", "SQL", "JSP", "Spring Framework", "JDBC", "Maven", "Tomcat"], "longDesc": "The problem Hassle-free grocery shopping in COVID-19 solves\nIn times of COVID-19, social distancing has become of utmost importance. A lot of delivery partners also shut down due to lack of funds, etc. However, daily essentials such as fruits, vegetables, medicines, etc. are of utmost importance and need to be purchased regularly. To enhance grocery shopping experience, we aim to introduce the concept of \"Takeaway Shopping\", similar to Takeaway food deliveries offered by many food chain partners. Our concept enables the user to select the products they need to shop, wherein they also put up an estimated pickup time. This will be entered by the user during checkout, while also paying for the items purchased. This will help in preventing crowding at billing centres at such shops, which is needed to contain the spread of COVID-19. Vendors have also been adversely affected due to COVID with lockdown being imposed in the entire country, hampering their sales and their daily meals. Some have also suffered to earn bread for their family members. Our webapp provides the option to partner up with the store, wherein they can sell their products at our quoted price. Thus, this will have a 2-way benefit: benefitting the customers to avoid over-crowding and have a smooth hassle-free shopping experience, and benefitting the vendors by providing them employment means in these challenging times."}, {"idNo": 18, "name": "Recommendation by tracking user’s scroll behaviour", "desc": "Track user's scroll activity using frontend techniques, and use it to place ads or recomendations at the point frequently used or seen by users.", "devfolioLink": "https://devfolio.co/submissions/recommendation-by-tracking-users-scroll-behaviour-69a9", "githubLinks": ["https://prod-recommend.herokuapp.com/", "https://github.com/adithyaharish/haxplore-2.0-submissions"], "special_mention": " ", "stacksUsed": ["JavaScript", "AJAX", "NumPy", "Machine Learning", "Heroku", "Python", "Kaggle"], "longDesc": "The problem Recommendation by tracking user’s scroll behaviour solves\nPeople’s behaviors are rarely stable and their usability gestures change over time. But one user behavior that did change is the tendency to scroll. Most of the time we spend in an app goes in scrolling, and the remaining few in actual viewing of the content. So, what if we can track the scrolling behaviour, understand where they stop and recommend based on that.\nMost of the user's time goes wasted in scrolling content that he/she isn’t interested in. To understand their interest, their scrolling behaviour can be tracked. Point where they stop scrolling and spend some time viewing the content shows that they are interested in that content. So, our idea is to retrieve the products when scrolling stops, get similar products to that using ML techniques and display that at their point of scroll. We can aslo display ads instead of recommendations.\nTo track the user’s scroll behavior, we use Javascript. The JavaScript detects the scrolling activity. It also creates a div with an id which is used to display the data present on the screen. Once, the user stops scrolling, we extract the product present in that div tag and send it to the recommendation system. After finding the user’s interesting products we intend to find similar products using cosine similarity. For this, we implement ML techniques based on content recommendation."}, {"idNo": 19, "name": "Imposter Syndrome", "desc": "The goal is to help users recognize if they have the syndrome through sentiment analysis . If yes, then help them further with getting over perfectionism .", "devfolioLink": "https://devfolio.co/submissions/imposter-syndrome-7e8e", "githubLinks": ["https://github.com/Akshima-Ghai/ImpostorSyndrome"], "special_mention": " ", "stacksUsed": ["Java", "Android Studio", "Firebase Authentication"], "longDesc": "The problem Imposter Syndrome solves\nPeople can use it as a companion to talk to about their feelings of doubt or inadequacy. It will help them acknowledge what their true feelings are and tackle them . Dealing with Impostor Syndrome takes long-term effort, but sometimes we need tactics to deal with it at particularly stressful moments . So the questionnaire has been designed to challenge the user’s response tactics to counter the tendency of self doubt . Also, it would be helpful as for people found to be having the syndrome few necessary actions would be advised. For example: Learn how to take a compliment, and draw strength from it, maintaining a regular journal to vent out daily thoughts . This app teaches you the skills you need for a happy and successful career."}]