[{"idNo": 0, "name": "MediFast", "desc": "A full-stack web application to provide complete healthcare assistance to people", "devfolioLink": "https://devfolio.co/submissions/medifast-5d91", "githubLinks": ["https://github.com/Grumpyyash/HackOverFlow-4.0", "https://evening-meadow-96782.herokuapp.com/", "https://docs.google.com/presentation/d/1U5CC_zkoWhfCSslf31Ri-UcxQXGCTRHTGQVYEffXbYc/edit?usp=sharing"], "special_mention": "2nd Runners Up", "stacksUsed": ["JavaScript", "Embedded Javascript (EJS)", "Heroku", "Google Maps API", "Express.js", "MongoDB", "Nodejs", "CSS3", "HTML5", "Passsport.js"], "longDesc": "The problem MediFast solves\nHealthCare is one of the most important services among all sectors but what if I tell you-\nAccording to the latest statistics, approximately 40% of the people are unaware of good hospitals and medical facilities available even in their own locality.\nSevere accidents and delay of treatment because of waiting for ambulances cause approximately 2 lakh death alone in India every year.\nThe current situation caused by COVID has given rise to a few precautions like- going out only when very much needed and avoiding public gatherings, maintaining social-distancing and much more.\nIt is definitely obvious that having a like-minded community of people to interact and discuss among themselves would help improve people perspective about medical conditions and ultimately would contribute to awareness and mutual help.\nAll the statistics have been referred from different surveys and studies conducted by reliable sources like Outlook, MIT, Indian Express and others.\nWhat's the solution then, well-\nWhat if we could build an application that would give people all the needed information regarding hospitals, their specializations, their contacts, allowing them to search and filter based on areas, kind of treatment and much more with a single click.\nWhat if we could use machine learning and data analysis to early diagnose early symptoms that a person is having beforehand\nWhat if we could build an integrated system of ambulance services and hospitals available just at a single tap on a mobile screen.\nWhat if we could bring hospitals at the doorstep hosted on the web for application forms and appointments by the doctor.\nWhat if we could build and support a like-minded community of people willing to help each other in need and also spread the word of medic awareness among themselves.\nFuture prospects of the project could be integrating machine learning models with the web to diagnose early symptoms and predict diseases. We would love to work further on it"}, {"idNo": 1, "name": "Park.ai", "desc": "Park anywhere and everywhere, legally!", "devfolioLink": "https://devfolio.co/submissions/parkai-bedf", "githubLinks": ["https://github.com/CHAITANYASAI-del/park.ai", "https://bit.ly/3dB22Tg"], "special_mention": "1st Runners Up", "stacksUsed": ["Java", "Python"], "longDesc": "The problem Park.ai solves\nWe make it easy to Park & Go!\n• On any given working day approximately 40% of the roads in urban India are taken up for just parking the cars.\n• Tremendous pressure on parking spaces have led to serious concerns like traffic congestion, accidents, disproportionate demand and supply ratio, environmental hazards etc.\n• Pollutants like oil and grease are washed off from the parking lots into the water bodies during the rains. The pollutants contaminate the water table and are also responsible for urban heat island effect. The pollutants it emits causes health \nhazards and may cause respiratory and cardiovascular damages.\nGuess what? It removes all the above and many more!"}, {"idNo": 2, "name": "MeetInPeace", "desc": "Your handy anti-snooping, pro privacy, browser extension to save you from everyone peeping into your screen during important meetings.", "devfolioLink": "https://devfolio.co/submissions/meetinpeace-6489", "githubLinks": ["https://github.com/uds5501/meet-in-peace"], "special_mention": "Winner", "stacksUsed": ["HTML", "CSS", "JavaScript", "Chrome Extension"], "longDesc": "The problem MeetInPeace solves\nThe Problem\nUpon the advent of Covid19 and a rise in Work From Home culture, and even during the pre-pandemic times where the video calls are very frequent and sensitive organisation data is shared among the folks, its risky in situations where people keep looking into your screen when you are attending the meeting / chat in let's say, a metro / hostel / crowded cafe etc. Not only risky, the peeping tom behaviour is a major cause of irritation among working class who like to travel and work / work in a cafe / someone who simply doesn't have the priviledge of privacy yet. So what to do for these?\nExisting solutions\nThis calls for a easy but viable solution to counter all these peeping toms. Some are already in the market like a 2500 INR Filter Screen, or locking your screen everytime someone looks at your laptop, or asking them to shoo away and handling awkward questions like \"What is it that you are doing that you have to hide it?\"\nOur Solution\nThese solutions are not really the best ones, so why not identify certain points of senstivity in the webapps (like gmeet, zoom and slack, which we have handled specifically in this project) and simply blur them! To reveal / unblur them, all you need to do is hover over it. To keep the solution as accessible and compact, we chose a browser extension - MeetInPeace ( which is of size < 1 MB )\nTo make the accessibility even quicker, all you need to do is use \"Alt + X\" as the hotkey to toggle this extension On / Off to keep your privacy secure quickly.\nHow it works?\nWe blur the sensitive areas on toggle using custom CSS and DOM manipulation, which is initiated on onCheck listeners attached to the popup.\nFinal Aim\nOur aim is to make this solution more accessible to everyone, for that we can't really make a custom tab for each webapp in our extension.\nSo, our final aim is to allow the user to mark the specifc areas of the web page as sensitive areas and toggle blurring / unblurring them as required."}, {"idNo": 3, "name": "Eco Map", "desc": "A guide for reducing your Carbon Footprint using CryptoCurrency & also towards a green & Carbon neutral future!", "devfolioLink": "https://devfolio.co/submissions/eco-map-a3c6", "githubLinks": ["https://github.com/d-rorschach/Eco-Map", "https://eco-map.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "CSS", "Django", "JavaScript", "Heroku", "Python", "Geocoding", "Mapbox API", "Portis"], "longDesc": "The problem Eco Map solves\nMain Idea:\nIn this project, we have tried to incorporate Crypto-Currency with Carbon Footprint. We will calculate the carbon footprint the user generates while traveling by car & the equivalent Ether amount, Then the user can be able to neutralize/remove the generated carbon offset by donating Ether via Portis wallet.\nThe problem we target:\nMany of us are still unaware of the term Carbon Neutrality, it was added in the oxford dictionary in the year 2007 but its real theoretical meaning or practical applications are still not clear to a huge part of society.\nWhen we see the statistics that globally transport accounts for a quarter of total CO2 emission, it really astonishes us that how the mode of travel from home to work or even to a local shop can affect our environment & can play a major role in increasing our carbon footprint.\nStill, the bigger part of the society remains unaware. due to a lack of knowledge, they are not interested in removing their Carbon offset.\nWe must realize that as we maintain a monetary budget, we must maintain a Carbon Budget too!\nOur Product:\nFirst thing we wanted is to make people aware of the terms Carbon Footprint, Carbon Offset, Carbon Neutrality. So we have provided the user with some resources to actually understand the theoretical definition as well as the practical application of these terms.\nHow much CO2 the user generates every time they travel by their Car, so the app will calculate it as users will select their destination and their mode of travel. The app will also show the equivalent Carbon Offset in INR and Ether.\nOnce the user understands the concepts of Carbon Footprint, Carbon Offset, and Carbon Neutrality, they can keep a Detailed Record of their Offset Contribution.\nThe user will have an option to neutralize their Carbon Offset by Donating an amount(Using Portis Wallet) proportional to their Carbon Offset, towards Tree Plantation."}, {"idNo": 4, "name": "LEARNING GLOW-REVOLUTION WE NEEDED", "desc": "The Revolutionized way of learning free of cost.", "devfolioLink": "https://devfolio.co/submissions/learning-glowrevolution-we-needed-30d5", "githubLinks": ["https://abhi070902.github.io/Learning-Glow/", "https://github.com/abhi070902/Learning-Glow"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "Java", "Android Studio", "Image-to-Image Translation", "Google Forms", "Google OAuth", "CSS3", "HTML5", "Google Firebase"], "longDesc": "The problem LEARNING GLOW-REVOLUTION WE NEEDED solves\nWith the learning glow project we want to solve the problem that we faced during our preparation time that is the teacher was either to fast or slow we were not able to keep up with the pace of teacher.So in this project we are trying to solve this problem by giving every student module according to his need and without any cost.He just have to answer the question asked in google form related to his academics and after that we will take short test of him and will give module most suited for him for his desired competitive exam . We have made this platform not for any specific course u can opt for any course according to your need and we will provide quality module according to what u have selected.We did this as this is our small contribution towards promoting digital and quality education free of cost.We have tried to keep this website as simple as possible as we wanted students from every region should have access to it.We tried to do something which is missing in our education.We have also added chat system so that every student can ask any query related to website or academics.We will try to solve that doubt as quickly as possible.We also added a feedback form so that if someone can suggest anything for the betterment of our website they can suggest us and we will try to adapt to it and make this website better.There is also an app linked for it which can be downloaded simply if anyone wants to download the app. Existing system was lacking this thing so we thought this would help for students who are either too slow or too fast."}, {"idNo": 5, "name": "Silkworm Cocoon Segregation", "desc": "Our project is a automation system that uses CNN (using Mobile net architecture) to segregate silkworm cocoons using image filtering based on their shape, color and size.", "devfolioLink": "https://devfolio.co/submissions/silkworm-cocoon-segregation-61da", "githubLinks": ["https://drive.google.com/file/d/1I6ZQ2cv75H7UwsC4X6_V5rTutJe-bYys/view?usp=sharing", "https://github.com/Ruthsan345/Hackoverflow"], "special_mention": " ", "stacksUsed": ["conveyer belt", "CNN (Convolutional Neural Network) using Mobile net architecture.", "Raspberry Pi 3 A+", "PIR Sensor", "Two cameras(Raspberry Pi cameras)"], "longDesc": "The problem Silkworm Cocoon Segregation solves\nOur program can be used in the sericulture industry where silkworm cocoons are cultivated. It can be used to segregate the cocoons based on their shape, color and the size of each cocoon that determines the quality of silk. It segregates cocoons into different qualities of silk. It will help people to remove the process of the existing method of segregation which is by hand picking which is a time consuming task and involves lots of labourers."}, {"idNo": 6, "name": "Share And Care - A Food Management Web Application", "desc": "Live simply so that others may simply live", "devfolioLink": "https://devfolio.co/submissions/share-and-care-a-food-management-web-application-d39a", "githubLinks": ["https://github.com/aniruddha2000/ShareAndCare"], "special_mention": " ", "stacksUsed": ["jQuery", "HTML", "CSS", "Django", "Python", "Bootstrap", "django-filter", "django-countries", "jinja-templates"], "longDesc": "The problem Share And Care - A Food Management Web Application solves\nFood wastage is a real concern at places where a lot of ready-to-eat food is produced. Create a web/mobile platform to put up leftover food for the nearby locals.\nShare-and-Care is a web app designed to handle such scenarios. People can log in to the Share-and-Care website, create an account, upload details about leftover food by creating a food post, see and filter global food posts. \nWith this web app, we aim to solve the food disbalance in our society, by simply posting about the details of the leftover or excess food. The government organisations, NGOs or people who are in need can simply follow the notifications of the app to get post notifications and may respond accordingly."}, {"idNo": 7, "name": "Covid Tracker", "desc": "Track CORONA save YOURSELF.", "devfolioLink": "https://devfolio.co/submissions/covid-tracker-093c", "githubLinks": ["https://github.com/Chiratna/covid_app2"], "special_mention": " ", "stacksUsed": ["Flutter"], "longDesc": "The problem Covid Tracker solves\nThe lack of information regarding the upsurge of corona cases among the general public of India is alarming. It awares people with the number of cases and provides the information within just one click,."}, {"idNo": 8, "name": "KisanFoods For Farmers", "desc": "Eat fresh and oragnic.", "devfolioLink": "https://devfolio.co/submissions/kisanfoods-for-farmers-be91", "githubLinks": ["https://github.com/DebjitPramanick/KisanFoods", "https://kisan-foods.web.app/"], "special_mention": " ", "stacksUsed": ["Bootstrap", "React", "Firebase", "Firestore", "Stripe API", "Material-UI"], "longDesc": "The problem KisanFoods For Farmers solves\nUsing this we can deliver fresh and organic foods to customers direct from the source."}, {"idNo": 9, "name": "11th Hour", "desc": "For students, by students.", "devfolioLink": "https://devfolio.co/submissions/th-hour-634d", "githubLinks": ["https://github.com/anshumaan255/11th_Hour"], "special_mention": " ", "stacksUsed": ["React", "Firebase", "Redux", "Flutter", "Razorpay", "Provider"], "longDesc": "The problem 11th Hour solves\nThe main problem our project \"11th Hour\" solves is of the students. Many students are not able to study for their college examinations due to some prior commitments or simply don't consider college examinations as their topmost priority. For them, we are making this portal so that they can study \"at the 11th hour\" and hence the name. They will be taught course-specific content so that they can pass the subject with ease. Along with that we often witness students drifting away from studies for petty freelancing jobs, our project also solves the problems of individuals who are willing to freelance by teaching the course/subject to the students for which they would get paid."}, {"idNo": 10, "name": "FarmTract", "desc": "\"Have a Contract, Come to FarmTract\". The Farmtract is a new and innovative approach which is generally based upon the concept of \"Smart-contracting\".", "devfolioLink": "https://devfolio.co/submissions/the-name-of-the-project-is-farmtract-c4b7", "githubLinks": ["https://github.com/RitabrataDas343/Farmtract_1.0"], "special_mention": " ", "stacksUsed": ["Web3data.js", "CSS3", "HTML5"], "longDesc": "The problem FarmTract solves\nFarmTract\nThe Farm Law \n➜ Overview of Contract Farming: Contract farming is the process of agricultural production carried out according to an agreement between unequal parties, companies, government bodies or individual entrepreneurs on one side and economically weaker farmers on the other which establishes conditions for the production and marketing of farm products.\n➜ Why the Farmers Protesting: The history of contract farming has many examples of non-payment by the companies making various excuses like substandard produce. A company is big and powerful and have legal team to make one sided contracts, also they have analysts to pick the price best for them. There’re so many loopholes to make fraud with the farmers.\nSolution is Smart Contract\nWe will create a platform, Farmtract, to solve this problem where the farmers as well as who want to make contract can complete their agreement through smart contracting and cryptocurrency.\nWorkflow\nAll users who wish to participate in the contract are required to create a blockchain account in Portis.\nFarmer will provide information like Name, contact details, cryptocurrency wallet address (to receive or transfer payment), farm size, evidence of land (land registry number) etc.\nSystem will list all the projects based on parameters like region, crops, farm size range, approximate predicted yield etc.\nOnce the two parties agree on specified terms and condition , the buyer can deposit the tokens as escrow money in the contract the project will be deployed on Ethereum network.\nThe contract will run till the specific duration determined by both the parties.\nWhen the farmer successfully harvests the crop, then as per specified terms and conditions, the smart contract will be executed, and the payment would be transferred to farmers account."}, {"idNo": 11, "name": "Feather", "desc": "A simple to use, lightweight video calling service", "devfolioLink": "https://devfolio.co/submissions/feather-daa1", "githubLinks": ["https://feather.cf/", "https://github.com/shivamanand1/Brown-Munde-Feather.git"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JavaScript", "WebRTC", "PeerJS"], "longDesc": "The problem Feather solves\nDuring the lockdown period, the only means of connecting to our dear ones is through a video call. But at times the video becomes laggy or pixilated and it gets frustrating that we can't view the other person clearly. This leaves us with the only other solution, an audio call. But audio calls are just too boring!\nWell, not anymore. Connect to your dear ones using Feather.\nFeather is a simple to use, lightweight video calling service that lets you connect to your dear ones even in the poorest of networks.\nSo how exactly does Feather work?\nFeather converts your video stream into an ASCII stream right before transmission, in order to provide a seamless user experience, simply because transmission of text requires less bandwidth as compared to the transmission of a video stream.\nConventional video calling services transmit video and audio, while Feather transmits text and audio."}, {"idNo": 12, "name": "SheWalksSafe - A Women Safety Application", "desc": "A women safety app that helps women in emergency or dangerous situations or whenever they feel unsafe. Some of the features like Maps, SOS, Voice command, Camera or video, Tips are provided for safety", "devfolioLink": "https://devfolio.co/submissions/shewalkssafe-a-women-safety-application-baa7", "githubLinks": ["https://github.com/rakulvm/ShewalksSafe", "https://drive.google.com/drive/folders/1g1Tk4TXecYmMW7gexJgKMptP_fS3J8b5?usp=sharing"], "special_mention": " ", "stacksUsed": ["Flutter", "Google Maps API", "Crimeometer API"], "longDesc": "The problem SheWalksSafe - A Women Safety Application solves\nAs women safety has became a huge concern nowadays, the insecurity for the women in rural areas increases day by day. Issues like theft, bullying, sexual injustice increases. So, we have planned use the same to give access to women in serious or dangerous situations to address the issue in a fast and easier way to ensure their security and built an app that could atleast control some of these. We have created an app with some special features like SOS, Voice command, Maps, shake for emergency, camera, police stations, taxi, tips for safety to ensure their safety as much as possible from our side.\nFeatures of our app:-\n⭐ SOS - SOS call and SOS messages to user-provided contacts (Which will be stored in shared preferences).\n⭐ Map - To track the current location of the user, guiding for safe routes and crime-prone areas (user would be able to mark the area safe or can view the number of users that have marked the area as safe, currently we are using crimeometer API to check whether the area is safe or not rather than providing information based on other user input).\n⭐ Voice Assistant - executes features on voice commands (this will detect if the sentence consists of few keywords such as 'SOS SMS', to redirect the user on the essential window).\n⭐ Shake - Detects the frequency of shakes and after a certain frequency sends help message with user location to provided contacts.\n⭐ Camera - To capture image (which can be shared from there itself) or and record video (which is automatically stored in gallery).\n⭐ Police stations - Locates all the nearest police stations.\n⭐ Police siren - Plays the police siren just to divert the people who bully.\n⭐ Taxi - One-touch ola cab facility to books cabs for user.\n⭐ News - To guide the users about self-defense techniques which we have planned to extend for providing other useful health emergency guidance."}]