[{"idNo": 0, "name": "Cardfy", "desc": "Digital Cards For Content Creators", "devfolioLink": "https://devfolio.co/submissions/cardfy-02a4", "githubLinks": ["https://cardfy-web.herokuapp.com/", "https://github.com/lucifer0987/Cardfy", "https://cardfy-web.herokuapp.com/static/Cardfy_0.2.apk"], "special_mention": " ", "stacksUsed": ["Firebase", "Django", "Java", "XML", "Python", "MongoDB", "Node js", "Express js"], "longDesc": "The problem Cardfy solves\nIn this digital era with so many platforms to communicate and interact, content creators / freelancers / individuals find it difficult to interact with their fans / potential customers / individuals due to their presence on many different platforms.\nThese platforms also deduct some commission from their hard earned money.\nTo solve this problem we created a cross-platform solution so that anyone can put all their information at a single place and interact with any one with the help of single URL . It prevents anyone from going to different social platform to communicate with a sigle person. It can also be used to accept payments which are transferred from one person to another with the help of UPI , so the commision which they used to give to other platform is saved ."}, {"idNo": 1, "name": "Scienocyde", "desc": "Science Fair Management System", "devfolioLink": "https://devfolio.co/submissions/scienocyde-d61a", "githubLinks": ["https://github.com/Koderz-SI/Scienocyde", "http://scienocyde.pythonanywhere.com/"], "special_mention": " ", "stacksUsed": ["Django", "JavaScript", "CSS3", "HTML5"], "longDesc": "The problem Scienocyde solves\nIn this covid period, school and college-level science fairs are hardly taking place. So, we have built a website where different organizing teams can host their events, and students can participate in a science fair by going through the list and details of different organizations. Also, people who aren't participating can go through the projects and learn.\nBrief:\nHost - One can host a science fair and get a dashboard. In the dashboard, the Host can see the details and submissions of the participants registered to the event that he hosted.\nParticipant - A participant can check out the science fair section, where he can find the list of hosted Science fairs. He/She can check the details of the event and can then apply accordingly.\nDuring the offline Science Exhibitions, all the students were allowed to go through the projects irrespective of they are a participant or not! Thus, keeping this in mind, we have a \"Projects\" section where all the projects submitted by different students for various organizations are lined up. So, one can easily go through the projects and learn."}, {"idNo": 2, "name": "Subswap", "desc": "Swap Coupons with ease", "devfolioLink": "https://devfolio.co/submissions/couponhub-b83f", "githubLinks": ["https://subswap.space/", "https://github.com/subhasis020299/couponhub-frontend", "https://github.com/subhasis020299/couponhub-backend"], "special_mention": " ", "stacksUsed": ["Bootstrap", "React", "CSS", "Nodemailer", "Nodejs"], "longDesc": "The problem Subswap solves\nWith the advent of e-commerce and multiple UPI-based payment apps, there has been a proliferation of Coupons that the brands have been sending out to entice users to their platform. As such, a lot of these coupons generally go to waste as a vast majority of the population do not use them. While this creates friction for the user as they do not get the coupons that they'd want to use, it also panders to the businesses, who find that their coupons are not reaching the intended audience. Additionally, there are multiple coupon codes that can be used multiple times by multiple users. We are trying to build a platform to facilitate trading coupons so that you give away the coupon you have and receive one from the brand that you want.\nThis problem would continue to grow. At some stage, the growth hack associated with sending out coupons to entice a paying user into your fold would drop off due to this massive amount of value going to waste because of wasted targeting efforts and a lack of organized platform to make trades. In the future, this platform has the potential to grow into a formal marketplace for coupons, a peer-to-peer Groupon would be a good analogy, and create a new channel for companies to pump their marketing budgets into. Furthermore, you as a user would be able to make use of this platform and get the coupons you want, and not just the ones that the world has dealt out to you."}, {"idNo": 3, "name": "Healthy You", "desc": "Healthy You aims to make the appointment booking process seamless and create a community to educate users with the help of health tips, first aid advice, fitness tips and much more", "devfolioLink": "https://devfolio.co/submissions/healthhub-311c", "githubLinks": ["https://devfolio.co/"], "special_mention": " ", "stacksUsed": ["HTML", "JavaScript", "Socket.IO", "CSS3"], "longDesc": "The problem Healthy You solves\nInspiration\nCOVID-19 virus has wreaked havoc around the world, infecting millions and raising fears of uncertainty. As a consequence, Governments have imposed stringent social distancing and lockdown measures to control the spread and contain the pandemic. This has left, those with medical priorities for routine check-ups and other chronic diseases in a quandary. Amidst rising fears of disease infectivity from contaminated surfaces, people have turned their dependency on technology. Technology powered virtual consultation has stepped up into the spotlight aiding healthcare provider organizations, doctors, and patients with digital consultations aired at the safe environs of a hospital/clinic straight to a patient’s home.\nHow is this tool helpful?\nAn online consultation with doctors is a major trend that has evolved during the COVID outbreak, after masks, sanitizers and social distancing have caught up with regular routine.\nWhile doctors are not available 24*7, home remedies can be used which the app provides\nAdmist the COVID-19 pandemic it is necessary to build a renewed sense of community which is provided by the application.\nKey Features\nMakes the appointment booking process seamless\nProvides online consultation\nCreating a sense of community\nA bot that helps with basic health and fitness questions"}, {"idNo": 4, "name": "Forged App", "desc": "Unmask Forgery , Unmask Cyber crimes.", "devfolioLink": "https://devfolio.co/submissions/forged-app-e8c6", "githubLinks": ["https://forged-app.netlify.app/", "https://github.com/im-ankitjais/Forged-App"], "special_mention": " ", "stacksUsed": ["React", "TensorFlow", "AWS", "FastAPI", "GraphCMS", "Spline"], "longDesc": "The problem Forged App solves\nNowadays cyber crimes are happening all around the world , reaching to all the corners of the world . Photographs are manipulated and are used in a very improper way with bad intentions . Also, Forensic documents like Aadhar cards , driving license , pan cards etc are manipulated. And many more such forgery happen due to morphing of images.\nCelebrities are nowadays trolled for the manipulated images by the memers or the fraudsters . \nSo, our team XIKEN.TECH has planned to build a platform which can detect forged images and also let people to be aware and this will definitely help to reduce cyber crimes . \nEven on social media platforms, people use manipulated pictures to troll or to destroy someone's reputation, so our team has decided to build a Twitter bot where people can identify whether an image is morphed or not ."}, {"idNo": 5, "name": "Trinetra", "desc": "Attendance , you can trust", "devfolioLink": "https://devfolio.co/submissions/trinetra-797c", "githubLinks": ["https://github.com/ASVKVINAYAK/Trinetra", "http://trinetra-admin-panel.netlify.app/"], "special_mention": " ", "stacksUsed": ["Flask", "Python", "Flutter", "MongoDB", "KML"], "longDesc": "The problem Trinetra solves\nSolves all the loopholes from the current biometric system and solves contact approach (keeping this pandemic in mind)"}, {"idNo": 6, "name": "-", "desc": "-", "devfolioLink": "https://devfolio.co/submissions/courseato-eeec", "githubLinks": ["https://github.com/sid3345"], "special_mention": " ", "stacksUsed": ["PHP"], "longDesc": "The problem - solves\n-"}, {"idNo": 7, "name": "Cool-Lab", "desc": "A cooler version of collab", "devfolioLink": "https://devfolio.co/submissions/coollab-1b87", "githubLinks": ["https://cool-lab.herokuapp.com/", "http://github.com/virajrg108/cool-lab", "https://docs.google.com/presentation/d/1y8y34vh7Q3AqvWG5gYS2FJZgpAQ8n92sGSQyIhaQiWY/edit#slide=id.gcaf932c0dc_0_15"], "special_mention": " ", "stacksUsed": ["Redux", "Figma", "MongoDB", "MERN stack", "Nodejs"], "longDesc": "The problem Cool-Lab solves\nWe are developing a social networking platform focused on collaboration between people with complementary skills.\nOn this platform users can post ideas/requirements, discuss and chat with other users. This posts will be shown to users with relevant skills. Anyone who likes the idea or willing to collaborate can contact each other and proceed further.\nIt will consist of groups/community so that user can choose the targeted audience for their posts.\nThe platform will connect the requirements with required skills."}]