[{"idNo": 0, "name": "Poke-Saga", "desc": "NFT's are the frontrunners in the creator economy, poke-saga enables users to generate random rare pokemon which can be then traded on OpenSea.", "devfolioLink": "https://devfolio.co/submissions/pokesaga-8ad1", "githubLinks": ["https://github.com/AL-S4H3R/poke-saga", "https://poke-saga.netlify.app/"], "special_mention": " ", "stacksUsed": ["React", "Matic", "Portis", "Skynet"], "longDesc": "The problem Poke-Saga solves\nHow people can use poke-saga\nPokemon Cards give a sense of nostalgia and their rarity makes them perfect to use as NFT's.\nTo maintain equality, random pokemon are generated and users generally pay the same fee to mint them. They can either sell these cards or add them to their NFT Portfolio.\nAll cards are 1 of a kind that has different attributes and properties. These properties may become a deciding factor in their sale on NFT Marketplaces."}, {"idNo": 1, "name": "Block Transfer", "desc": "A decentralized stock transfer agent protocol for global financial markets", "devfolioLink": "https://devfolio.co/submissions/block-transfer-f9fd", "githubLinks": ["https://docs.google.com/presentation/d/1XN971Bnp4NYCXp_zf65iTxt6IZGTAo29NTpCngYmBqA/edit?usp=sharing", "https://youtu.be/S75IvkicWD8", "https://www.blocktransfer.io/", "https://d2saw6je89goi1.cloudfront.net/uploads/digital_asset/file/869527/Block_Transfer_Whitepaper-A.14.pdf", "https://github.com/abrahimladha/MIT-bitcoin-expo-2021"], "special_mention": " ", "stacksUsed": ["Solidity", "IPFS", "MetaMask", "npm", "Web3", "Smart Contracts", "Truffle", "Ether", "LaTeX", "solc"], "longDesc": "The problem Block Transfer solves\nEvery public firm on Earth must have a transfer agent by law (see Securities Exchange Act of 1934 Sec 17(a) or equivalent abroad). These firms maintain the official record of all shareholders (see Diagram 1 for place in traditional trading), making them vital for stock splits, dividend distribution, shareholder voting, and more. TAs are the true backend bookkeepers of \"who owns what stock.\"\nHowever, millions of human-processed book-entry stock transfers waste billions of shareholder dollars each year. Furthermore, it oftentimes takes HOURS sitting on the phone to directly transfer book-entry stock, and, for this sub-par shareholder service, firms waste 6+ figures/yr (over 1.44B last year in the US alone) for a trusted central point of failure. The whole process in general is slow, tedious, wasteful, and incredibly lucrative, as the central bookkeeping trust creates one of the highest-margin businesses in all of public finance.\nThe role of transfer agents today represents a gross misallocation of shareholder dollars that must be haulted. Blockchain was created for the sole purpose of maintaining ledgers just like a TA ledger, and smart contracts (and our subsequent dApp) enable intelligent execution of a decentralized finance TA protocol. This means that anyone can access and transfer their assets instantaneously, prove their ownership stake with no central trust, verify other shareholder stakes, vote at shareholder meetings without proxy middlemen, and more with no central point of failure... all while significantly lowering the TA expense for the underlying since cost comes from distributed gas fees (not arbitrary agent profit).\nWe came into the hackathon with a general outline of how we wanted our smart contracts to function, and finished it strong with a seamless Web3 interface for stock transfer agent services. Through equity backed by contractual transfer agent obligations with the underlying, we've laid out the groundwork for global decentralized equities."}, {"idNo": 2, "name": "Cleopatra", "desc": "A Blockchain paradigm, at your service.", "devfolioLink": "https://devfolio.co/submissions/cleopatra-be76", "githubLinks": ["https://github.com/RankJay/Cleopatra", "https://twitter.com/Cleopat51842118"], "special_mention": " ", "stacksUsed": ["Python", "Chainlink", "Web3.py"], "longDesc": "The problem Cleopatra solves\nCleopatra, at its core, is a multi-purpose Twitter bot that can constantly push forward the user engagement of a decentralized ecosystem.\nImagine, you are at a break/or on a weekend spending your leisure time on social media, especially Twitter, looking for some trends and good times, and suddenly you recall, you forgot to check the CoinMarketCap of your crypto and don't want to grab or your laptop or go to the website! Cleopatra to the rescue. All you have to do is mention the bot and ask for the price feed change, it will grab the tweet spontaneously and use a DApp to fetch the latest price feed, in this case, ChainLink API.\nWhat if you want to throw a giveaway or send out an airDrop on Twitter, but don't want to rely on other sources to handle it? Cleopatra is here to automate tasks for you, the really cool thing about this giveaway is that it actually picks \"RANDOM\" users. How? Well using the ChainLink's VRF API, to sustain the oracle problem, this bot, after getting through some dramatic algorithm shifts, which is solely based on randomness provided by the API, get you your giveaway winners, and at the same time, will send out DMs to each one, for the process of how to avail them! Cool isn't it? To put the verifiable randomness of blockchain to use. Apart from these features, the bot is also designed to provide all these details apart from normal chatting exclusively via DMs, just in case you don't want to let the world know you hold XYZ crypto. My goal here is to provide a reliable, interactive, user-friendly space to communicate with a decentralized world. My future plan here is to actually include more features such that be it MATIC or LINK token, it is available and open to almost all the cryptos and even beyond."}, {"idNo": 3, "name": "Crowdly", "desc": "Crowdly is a Crypto-economic platform that acts as an information market that provides accurate news for users to both view and bet on.", "devfolioLink": "https://devfolio.co/submissions/crowdly-cd8c", "githubLinks": ["https://github.com/Abhishec177/crowdly"], "special_mention": " ", "stacksUsed": ["Solidity", "React", "Matic", "Portis", "Nodejs", "Truffle Suite"], "longDesc": "The problem Crowdly solves\nMisinformation is a major problem in a world where there are many sources of information on the internet which may or may not provide the right information. This ultimately results in users losing faith in every internet source altogether.\nWe aim to solve this problem of misinformation by means of crowd verification and independent source (News Organizations) verification of the news shared. We aim to incentivize people to provide the right verdicts on each piece of information by allowing them to bet on what they feel is correct. They receive their fair share of profits once the news is verified by independent sources."}, {"idNo": 4, "name": "Vs code", "desc": "vs", "devfolioLink": "https://devfolio.co/submissions/vs-code-cc18", "githubLinks": ["https://youtu.be/y1SsyY7Qnx8"], "special_mention": " ", "stacksUsed": ["Visual Studio Code is a freeware source-code editor made by Microsoft for Windows", "Linux and macOS. Features include support for debugging", "syntax highlighting", "intelligent code completion", "snippets"], "longDesc": "The problem Vs code solves\nvs code"}, {"idNo": 5, "name": "Stock Price Prediction – Machine Learning Project", "desc": "Learned how to develop a stock cost prediction model and how to build an interactive dashboard for stock analysis.", "devfolioLink": "https://devfolio.co/submissions/stock-price-prediction-machine-learning-project-f1a9", "githubLinks": ["https://github.com/KanakBhardwaj1/Stock-Price-Prediction-Machine-Learning-Project-in-Python"], "special_mention": " ", "stacksUsed": ["Python", "Jupyter Notebook"], "longDesc": "The problem Stock Price Prediction – Machine Learning Project solves\nMachine learning has significant applications in the stock price prediction. In this machine learning project, we will be talking about predicting the returns on stocks. This is a very complex task and has uncertainties. We will develop this project into two parts:\nFirst, we will learn how to predict stock price using the LSTM neural network.\nThen we will build a dashboard using Plotly dash for stock analysis."}, {"idNo": 6, "name": "Last one", "desc": "U want some get some", "devfolioLink": "https://devfolio.co/submissions/last-one-51cc", "githubLinks": ["https://github.com/CJ077/pythonprogram"], "special_mention": " ", "stacksUsed": ["Machine Learning", "AR/VR"], "longDesc": "The problem Last one solves\nThe stuff which remains unsolved"}, {"idNo": 7, "name": "Onion '78 - Mobile Wallet Tor Based PayJoin", "desc": "Increase your privacy and security with Onion '78. A mobile wallet with TOR and Payjoin technology, designed to protect YOU and YOUR funds.", "devfolioLink": "https://devfolio.co/submissions/onion-a-payjoin-implementation-over-tor-906c", "githubLinks": ["https://www.figma.com/file/FM4jE85Aybr6fT00tyNhWc/Untitled?node-id=0%3A1", "https://www.youtube.com/watch?v=UsHOQIykfDo", "https://docs.google.com/presentation/d/1RWXk9A7V519o5C2rNhvrHW63b7Iz_Y7oVtujYxDTicI/edit?usp=sharing", "https://github.com/armins88/Onion78"], "special_mention": " ", "stacksUsed": ["Tor", "Chaincase", "BTCPay", "Segwit", "Wasabi", "CoinJoin", "PayJoin", "PSBT", "BIP78"], "longDesc": "The problem Onion '78 - Mobile Wallet Tor Based PayJoin solves\nMobile bitcoin wallet applications are NOT private enough for both the sender as well as the receiver. A common-input-ownership heuristic exists which states that if a transaction has more than one input then all those inputs are owned by the same entity.\nThis is one of the core heuristics used by chain analysis companies to determine the owner of specific unspent transaction outputs (UTXOs). UTXOs can be attributed ownership based on economic activity patterns, lack of privacy controls, and a false understanding of how UTXOs are processed in a bitcoin transaction.\nFor those that wish to retain a higher level of privacy, solutions such as multisignature, CoinSwap, CoinJoin, and Payjoin exist -- but are not easily accessible to the common user, as most of these solutions require in-depth technical knowledge of the Bitcoin protocol and administration of infrastructure that can sync and store and maintain chain data. An additional knowledge set of how to construct, parse, and sign partially signed bitcoin transaction (PSBT) data is required for enhanced privacy features. Most end users without this level of technical acumen will fail at implementing the specification properly, and will ultimately sacrifice security and privacy of their funds and transactions for the sake of conveinence."}, {"idNo": 8, "name": "Bitcoin Backup Helper", "desc": "Build your own Bitcoin backup sheet", "devfolioLink": "https://devfolio.co/submissions/bitcoin-backup-helper-88c3", "githubLinks": ["https://bit.ly/3cLwk6f"], "special_mention": " ", "stacksUsed": ["Figma", "HTML/CSS"], "longDesc": "The problem Bitcoin Backup Helper solves\nBacking up your bitcoin wallet is critical, but it can be complicated for newer users. The goal of this project is to help make bitcoin more usable by creating a tool that assists people with backing up their Bitcoin wallets.\nThis tool leads the user through a series of questions around their wallet. Based on the answers, it will generate a template which the user can print out and write their wallet information on.\nhttps://sbddesign.github.io/bitcoin-backup-helper/"}, {"idNo": 9, "name": "Verist", "desc": "A frame to bridge your NFTs with the physical world.", "devfolioLink": "https://devfolio.co/submissions/verist-d5a5", "githubLinks": ["https://www.figma.com/proto/GZWzkY8MZaFRbkQQ04XJrv/Verist?node-id=1%3A2&viewport=120%2C332%2C0.30614903569221497&scaling=scale-down-width&page-id=0%3A1"], "special_mention": " ", "stacksUsed": ["Figma"], "longDesc": "The problem Verist solves\nThe rise of NFTs have given empowerment to artists and their ability to create value from their work. However currently there are still problems displaying their work to an audience and still ensuring that the owner of their work is the real owner. With a frame that ensures authentication before it displays the work it will add value to the artwork and increase incentives for people to own the real piece. We believe a frame that showcases work in a exceptional manner will increase adopotion and help artists better showcase their work."}, {"idNo": 10, "name": "Arigale", "desc": "Decentralized CMS", "devfolioLink": "https://devfolio.co/submissions/arigale-75c8", "githubLinks": ["http://arigale.hns.to/"], "special_mention": " ", "stacksUsed": ["React"], "longDesc": "The problem Arigale solves\nAllow user to manage their blog, poadcast etc. data without worring of leak or misuse of their data."}, {"idNo": 11, "name": "Algorand Autonomous", "desc": "A self-updating Financial Decentralized Autonomous Organization (DAO) hosted on Skynet.", "devfolioLink": "https://devfolio.co/submissions/algorand-autonomous-02af", "githubLinks": ["https://github.com/Bhaney44/Cryptots", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3819055", "https://siasky.net/EACutfSK2IQY2o8jgTguX6ahvZQSJ3tr3DoG0bEsZ7VLOQ/"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JavaScript", "TensorFlow", "Keras", "Python", "Smart Contracts", "Skynet", "Algorand", "PyTeal"], "longDesc": "The problem Algorand Autonomous solves\nAcross blockchain networks, governance is a complex task with multiple stakeholders having several financial interests. The process by which decisions are made among these stakeholders is often centralized with certain authorities. For example, investment funds typically are controlled by a central authority. However, this decision-making framework limits openness for global community development and collaboration, as well as the personal autonomy of network participants. It often results in one party controlling the funds for a plethora of members. Furthermore, in a decentralized network, there was no way for investors to safely track financial transaction data and have it stored remotely, enabling global access."}]