[{"idNo": 0, "name": "EK", "desc": "A mental health app to foster organic peer-to-peer interaction.", "devfolioLink": "https://devfolio.co/submissions/ek-d085", "githubLinks": ["https://ek-reactapp.netlify.app/"], "special_mention": "2nd Runner Up", "stacksUsed": ["Node.js", "Firebase", "Socket.IO", "WebRTC", "Netlify", "Firebase Authentication", "React.js"], "longDesc": "The problem EK solves\nWe are in a world where everything has become online from services to products. Human interaction has decreased a lot over the past few years. In fact, it has all the more with the current pandemic. There are a lot of people who are in isolation, are lonely and just need someone to talk to who can help them out of a rut. Hence our platform consists of volunteers who are trained enough to deal with the situation of people with slight mental incapacities, or with people who are dealing with the burden of their existence. \nOur platform also works as an emergency platform for people who are going through an anxiety/ panic attack. They can navigate through our medically researched UI interface and connect with a volunteer with just a click of a button. \nThe platform has volunteers who are from various universities and are young and open to understand and deal with tough cases, they are trained with a curriculum that allows them to be more open and help more efficiently. \nWe are trying to implement, a similar model as to NHS, UK for the Indians since we cannot depend always on foreign services as our social dynamics and problems are very different compared to other societies.\nOur company will also provide professional medical help to those individuals that are identified by our volunteers to exhibit tendencies around the boundaries of self-harm. The volunteer has a special button that allows him to report in case of emergencies. \nIndia's youth has the highest suicides rates, and that shows how dormant our society is with regards to this situation. One conversation with the right person can make us change our perspective and allow one to live healthier, and that's what EK do.\nWe want every student who is losing his breath at an assignment, every adult burdened under the pressure of society, or every worker who just wanted to share his experience to have an outlet where he can be given a reinforcement to be back the next day with more will power and confidence."}, {"idNo": 1, "name": "ExamTantra", "desc": "Gamify your exams", "devfolioLink": "https://devfolio.co/submissions/examtantra-27f5", "githubLinks": ["https://github.com/shero4/Hacko-17-COD3ine", "https://drive.google.com/file/d/1Va-TlFD3ab7K3gHOzlVY4Z-IFSk7lZKx/view?usp=sharing"], "special_mention": "1st Runner Up", "stacksUsed": ["React", "Firebase", "JavaScript", "Android Studio", "Ionic", "Redux", "Firebase Authentication"], "longDesc": "The problem ExamTantra solves\nCompetitive exams are a cornerstone in almost every student’s life. There are two purposes for competitive exams; at school and college, they encourage students to study by rewarding those who demonstrate the will to learn with reputation, prizes, admissions to universities and scholarships. They're also used in the selection of military and civil service officers. This makes success in these exams very lucrative, attracting many students.\nHowever the archaic education system makes the preparation process very tedious, boring and unintuitive. This leads to burnout and a general disinterest towards academics. This system is also inefficient as it doesn’t have room for a dynamic system of preparation. Another issue that presented itself in the current, unprecedented times is that education has to evolve beyond brick and mortar institutions to function and thrive. The sudden rise in solutions implementing technology into education is no coincidence. As we are forced to look for alternatives to conventional learning methods, we have to find efficient and innovative methods so as to keep improving the quality of education.\nWe decided to create an innovative solution to help students prepare for their exams using ExamTantra. ExamTantra’s goal is to “Gamify” the mundane tasks of attempting exams by adding elements such as peer attempts: solving papers with peers resulting in a more productive practice environment, leaderboards to compare progress, a clean minimal UI so as to not distract the user, badges, awards and other reinforcements which have been proven to be psychological motivators. We believe that everyone must have the right to a fair education, thus, ExamTantra aims to make practicing more accessible to students by offering an ad free uninterrupted experience as well as being optimised to run on most devices."}, {"idNo": 2, "name": "Self-Stabilizing Spoon with Remote Monitoring", "desc": "The stabilizing spoon compensates for unintended tremors or shivers and keeps the spoon bowl stable. The application displays sensor data graphically to the doctor for remote monitoring.", "devfolioLink": "https://devfolio.co/submissions/selfstabilizing-spoon-with-remote-monitoring-960a", "githubLinks": ["https://github.com/vishalvhingorani/Hacko-Team-38-Chiral", "https://drive.google.com/drive/folders/1t5cpAuAZX-tAslALSHiiIR56tOAh9pWn?usp=sharing"], "special_mention": "Winner", "stacksUsed": ["Firebase", "Java", "Internet of Things (IoT)", "Kotlin", "Arduino", "Android NDK", "Sensors"], "longDesc": "The problem Self-Stabilizing Spoon with Remote Monitoring solves\nParkinson’s disease is a neurological degenerative disease that results in irrepressible shivers in the limbs. Due to unintended tremors in their arms, patients are unable to perform everyday menial tasks like eating food out of a bowl with a spoon.\nThe stabilizing spoon compensates for unintended tremors or shivers received from the user and calibrates its head against these forces, thus keeping the spoon bowl stable at all times. This spoon can move as quickly as 500°/second, hence effectively steadying the spoon and easing the eating process of patients.\nAnother part of the holistic product is a mobile application for a designated doctor to monitor the patient’s progress.\nDuring this pandemic, people have been terrified of entering hospitals for non-COVID diseases and ailments, and we aim to create and market a product to help people adjust better to this new norm.\nWe have developed an application that analyses data collected from the spoon via sensors and statistically displays it to the designated doctor. By using this application, a doctor can not only monitor your progress but also offer diagnosis and treatment remotely, without the patient needing to leave their home.\nWith this project, the absolute aim is to make a product that can make a patient’s life easier.\nThe product will not only make it easy for the user to eat food out of a plate/bowl but also help their recovery by enabling inexpensive and thorough communication with a designated doctor.\nIn an age where people are petrified of the thought of entering the premises of a hospital, we are trying to use all the technical experience we have to create an experience that avoids as much physical contact as possible.\nIn the case of neuro diseases associated with nerves and muscles, it is imperative for the doctor to check up on the patient’s movements regularly, but we have attempted to find a way for doing that without requiring the patient to ever enter a hospital."}, {"idNo": 3, "name": "Yggdrasil", "desc": "knowledge Tree", "devfolioLink": "https://devfolio.co/submissions/yggdrasil-f937", "githubLinks": ["https://github.com/kushagra1912/Hacko-35-EL-CODEX"], "special_mention": " ", "stacksUsed": ["JavaScript", "CSS3", "HTML5"], "longDesc": "The problem Yggdrasil solves\nstudents can easily find the course of their choice"}, {"idNo": 4, "name": "Vanish Misery", "desc": "Mental Health is preserved Wealth.", "devfolioLink": "https://devfolio.co/submissions/vanish-misery-17ef", "githubLinks": ["https://github.com/aaryan-gupta/Hacko-24-Nano_coders"], "special_mention": " ", "stacksUsed": ["Bootstrap", "CSS", "JS", "MongoDB", "Passport.js", "Nodejs", "ejs"], "longDesc": "The problem Vanish Misery solves\nOur team believes that health, especially mental health, is a popular concern in today's scenario. From children, teenagers to adults and old people . So, we tried to built a platform where depressed , worried and people battling with anxiety can seek help with no hesitation . They can express their innermost feeling and can get to know about state through an analysis . They can also perform various other activities Like daily exercises , quiz etc . Can implement the idea using different technologies ."}, {"idNo": 5, "name": "Axios", "desc": "Your Helping Hand", "devfolioLink": "https://devfolio.co/submissions/axios-bb97", "githubLinks": ["https://github.com/Team-Segmentation-Fault/Hacko-10-SegmentationFault", "http://0df332014bc2.ngrok.io/"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "React", "Node.js", "CSS", "Django", "JavaScript", "Redux", "Flutter", "Express"], "longDesc": "The problem Axios solves\nOur product, Axios. is not just a product but an ecosystem of tools to aid the entire university experience in both the academic and non academic sphere.\nAxios Sphere is an integrated dashboard and issue tracker to automate common issues faced in universities, especially regarding the hostel accomodation.It involves automating room cleaning requests, mess feedback, hostel-related complaint portal, laundry requests, booking medical appointments at the university health center, and much more. Combined with a convenient admin dashboard panel, wherein the administrator can see all requests at one central place and then take action, it indeed is a one-stop solution for hostel management.\nAxios Cube is a social media and blogging tool meant solely for the current students as well as the alumni of the same university. In the times of online education, which has totally changed the dynamic of social and professional interactions as well as networking, it serves as a handy tool to connect, interact and find like-minded batchmates and people with the same interests and skills.\nAxios Cube aims to be a centralised platform to facilitate intra-college and intra-hostel buying, selling and trading of items and products.\nAxios Circle is a mobile app that serves as a convenient way to access the services of the Axios ecosystem from handheld mobile devices."}, {"idNo": 6, "name": "RAKSHAK", "desc": "MY SAFE PLACE - A web app developed for women safety and security", "devfolioLink": "https://devfolio.co/submissions/rakshak-bb59", "githubLinks": ["https://github.com/jessicabanka/Hacko-33-rakshak/tree/main/Rakshak-rakshak", "https://hacko-33-rakshak.netlify.app/", "https://www.canva.com/design/DAEZU5DX-yI/share/preview?token=v_6QiWFcI3xKhsGpew5mNQ&role=EDITOR&utm_content=DAEZU5DX-yI&utm_campaign=designshare&utm_medium=link&utm_source=sharebutton"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "JavaScript", "CSS3"], "longDesc": "The problem RAKSHAK solves\nSafety is a fundamental human right and shouldn't be considered a luxury for women. It is the foundation in achieving gender equality. It will create a safer environment that can encourage women to step out of their homes without any worry which will also increase their productivity and give them the confidence to explore opportunities in various fields.\nWe are building a website to have a solution which will help to curb sexual assault pandemic. Firstly the user will login themselves then the contact information of their five guardians would be asked.Now if the user is feeling unsafe or just wants to check in, a live location can be activated and can be shared with guardians. It is able to discreetly trigger an emergency alert with a double-press, instantly transmitting location information to selected contacts. If you do send an alert, it lets your guardians navigate to your location. This feature is useful to help people reach you quickly. In this way it will be able to keep users safe through these SOS features. One of its applications enables users to enter their start point and destination, in case they feel the route is unsafe. The location of the device can be tracked real time.We have also added the virtual facetime,audio illusion in the application as sometimes it may happen that you feel unsafe in the path you are travelling and you have no one to talk to you can use talk to me feature. If you are at home sometimes you feel like nothing to do you can also learn self defence through get the self defense training option. Of Course our application will also cover basic features like editing your profile,notification bar, chat with guardians,etc. If this part will get implemented successfully then we will add some more features like professional chatbot from which you can talk to professionals/police/1098 facilities,unique trigger speech system that allows you to add a unique word of your choice and trigger the alert by the unique word just like okay google."}, {"idNo": 7, "name": "TU-Troquer", "desc": "TU-Troquer is a one-stop incentivised solution for all academic-related resources and doubts for students.", "devfolioLink": "https://devfolio.co/submissions/tutroquer-190a", "githubLinks": ["https://github.com/tanya1810/hacko-40-team_titans", "https://www.canva.com/design/DAEZVDre2C4/Mg0c019wIticY7nYCDEX7Q/view?utm_campaign=designshare&utm_source=sharebutton"], "special_mention": " ", "stacksUsed": ["jQuery", "Bootstrap", "Django", "JavaScript", "Git", "SQLite", "Python", "GitHub", "Blockchain", "HTML/CSS"], "longDesc": "The problem TU-Troquer solves\nWe have aimed to create a social resource trading application mainly focused on college and university students that incentives peer to peer help, doubt discussion and above all, sharing knowledge."}, {"idNo": 8, "name": "Securex", "desc": "A decentrailsed encrypted credential storing app", "devfolioLink": "https://devfolio.co/submissions/securex-7c09", "githubLinks": ["https://github.com/Ishan-001/Hacko-41-Bareilly-ki-Barfi", "https://www.figma.com/file/IqafSV2RBopK6yJFw5TI6L/SecureX?node-id=0%3A1", "https://parthsharma1410.github.io/#about"], "special_mention": " ", "stacksUsed": ["Solidity", "IPFS", "Infura", "Java", "Android Studio", "Figma", "Kotlin", "Ethereum", "web3j", "HTML5"], "longDesc": "The problem Securex solves\nMost people nowadays use credential storing apps owing to the large number of applications that they use.\nAre the credential storing apps totally foolproof?\nMost used password managing apps on PlayStore using offline encryption to store passwords.\nThat means if you lose you phone, you lose everything\nIf passwords are stored on a database, there is always a chance for data breach."}, {"idNo": 9, "name": "DataVault", "desc": "A secure, legal and complete way to trade Data.", "devfolioLink": "https://devfolio.co/submissions/datavault-7da5", "githubLinks": ["https://github.com/Naman-Monga/Hacko-44-devX"], "special_mention": " ", "stacksUsed": ["Solidity", "Django", "Machine Learning", "Ethereum TestRPC", "Python", "Charts.js", "Nodejs"], "longDesc": "The problem DataVault solves\nTrading data online in the current world is not only very inefficient but also sometime illegal. Our Platform solves both the problems."}, {"idNo": 10, "name": "ARAKourse", "desc": "Your Compass To The Right Career.", "devfolioLink": "https://devfolio.co/submissions/arakourse-1be8", "githubLinks": ["https://github.com/RaghavGupta70/Hacko-1-Hephaestus"], "special_mention": " ", "stacksUsed": ["Firebase", "Visual Studio Code", "Android Studio", "Dart", "REST API", "Flutter", "Firestore"], "longDesc": "The problem ARAKourse solves\nTo fulfill your ever changing needs for professional growth we bring you ARAKourse. Through this app the user can access a wide range of courses and programs of their choice. ARAKourse helps the user to get the latest and top rated courses of his/her choice without taking the pain of searching for courses on the vast internet.\nThe uniqueness of the app lies in that fact that the user gets to see the courses according to the rating they enjoy in their respective field.\nAt the first click:\n1. Get the name of the course.\n2. Get the price of the course.\n3. Get the name of the instructor.\n4. If the user wants to check the course, he/she can select the check the course out which will redirect it to the udemy website providing further details of the course.\nApart from this, user has the option to create the option to create their own favourite’s course list which they can access at any point of time. This enables the application to understand the needs and requirements of the professionals and students. With this information we can update our list of courses to meet the latest trend and needs of the society."}, {"idNo": 11, "name": "COVATT", "desc": "COVATT - FILLS COMMUNICATION AND TRANSACTIONAL GAP BETWEEN VACCINATOR AND CONSUMER", "devfolioLink": "https://devfolio.co/submissions/covatt-7d52", "githubLinks": ["https://github.com/ssbeast/Hacko-19-titans"], "special_mention": " ", "stacksUsed": ["Firebase", "Flutter", "Redis", "MongoDB", "Nodejs", "React.js"], "longDesc": "The problem COVATT solves\nAS we know in india, covid vaccination for general population started just recently \nbut with the enormous population of our country, maintaining records \nand communication betwwen vaccinator and consumer is heft task, thats \nwhere our app COVATT fills the spot, that allows user to fetch their \nvaccinations record, look for nearby vaccination centers as well as pay\nthe vaccination fee, users can also link their family members and \nmonitor their status."}, {"idNo": 12, "name": "Medilab", "desc": "One stop destination for all your medical needs", "devfolioLink": "https://devfolio.co/submissions/medilab-a8bb", "githubLinks": ["https://muskaarora4446.github.io/Hack0-15-error404/"], "special_mention": " ", "stacksUsed": ["PHP", "HTML", "CSS", "JavaScript", "SQL"], "longDesc": "The problem Medilab solves\nWe have created a platform (an interface) between a doctor and a Patient To Digitalize all the Paperwork done by a hospital like our prescriptions written by the doctor , our test reports and medical history.\nAs You know before any major surgical processes our medical history is analyzed by the doctor which involves assessing bundles of reports and history with our platform we have made this process much easier by digitalizing it\nCASE 1: You don’t have to submit all your reports and do the formalities again and again before any medical process you just have to share your username or aadhaar number or biometrics and your medical profile will be accessible accessible to the doctors with the help of our platform\nLets suppose that a person was injured in an accident and in unconscious state taken to the hospital with our interface , the hospital just has to scan his biometrics and all the viable and useful information like his medical insurance, emergency contact , medical history,Blood Group will be accessible in that time of need."}, {"idNo": 13, "name": "CloseBuy", "desc": "An end-to-end hyperlocal platform to connect local entrepreneurs with customers within their location and equipping them with tools to bring their services online and find customers easily", "devfolioLink": "https://devfolio.co/submissions/closebuy-c51e", "githubLinks": ["https://github.com/Ansh-Sarkar/Hacko-31-kugelblitz"], "special_mention": " ", "stacksUsed": ["Firebase (Backend)", "Firestore (NoSQL Database)", "FCM (Notifications", "Cloud Functions and Auth", "Flutter (Dart) - Cross Platform device compatibility", "Google Maps (SDK) - Geolocation", "google_maps", "Places API - Place search functions and autocomplete", "Geocoding API (Geocoding and Reverse Geocoding) – Precise location data"], "longDesc": "The problem CloseBuy solves\nLocal entreprenuers lack exposure of their small businesses due to societal constraints.\nThese local entreprenuers find difficulty in acquiring initial customers and scaling their business.\nNormal consumers have to spend a lot of time looking for a good tailor for tight deadlines for an event or house helps , baby sitters or any other work , nearby.\nApart from the already mentioned points above , we see our project as a feasible method to generate employment and facilitate the empowering of Women Entrepreneurs by providing no fee transactions while using our app. We hereby firmly believe that our app also solves 2 of the major UN 17 Sustainable Development Goals namely : Women Empowerment (Tackling Gender Disparity) and Employment Generation."}, {"idNo": 14, "name": "Upcare", "desc": "The all in one healthcare solution for healthcare professionals, patients & pharmacists", "devfolioLink": "https://devfolio.co/submissions/upcare-127a", "githubLinks": ["https://github.com/projectX-india/Hacko-11-Macintosh"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JS", "Django", "Machine Learning", "Python", "JSON", "BeautifulSoup", "decision tree"], "longDesc": "The problem Upcare solves\nWorking & usage\nThis application addresses the complete record keeping of patients wherein the doctors can monitor their progress and past records of prescription and test results on the other side patients will feel confident via Artificial Intelligence wherein they get a comparison of their treatment with worldwide practice.\nthis application also minimize the hassles of the patients in terms of minimizing their movement and providing them nearest best solution in terms of laboratories and pharmacy shops\nThis application has the option for the patients to buy the medicines at the patient’s page as and when he will click on the link pin and buy the portal will show the medicine shops where all the medicines prescribed by the doctors are available. After choosing the pharmacy shop u can add to cart your medicines.\nOn the other side at pharmacy shop page complete buy and payment option are available.\nThe Upcare also providing end to end solution with pathology labs wherein all the test suggested by doctors will be displayed at patient ends and path labs options will be available as pharmacy shops and similar kind of feature are available to book your appointment with labs.\nAnd the best part of this Upcare application is that it will update all {prescription, test results, medicine bill etc...} thus maintaining coherency.\nInspiration for project\nIt has been observed that patients are confused while searching for the best doctors for their treatment. This application will show a list of best doctors in your vicinity where in patients can book their appointments with doctors and simultaneously as the patient will book the appointment, a patient queue will be displayed at the doctor’s end.\nthe patient’s portal, he/she can enter the symptoms and will able to know their possible diseases. This application is based on a ML model {decision tree} which works on a huge database collected by our team in order to predict this possible disease.\nAt the same instance thes"}, {"idNo": 15, "name": "Connect to Heal", "desc": "Share To Heal is an initiative to help people cope up with the increasing mental health deterioration due to the effects of keeping oneself in a confined space.", "devfolioLink": "https://devfolio.co/submissions/connect-to-heal-7d07", "githubLinks": ["https://github.com/parzival272000/Hacko-28-Zenith"], "special_mention": " ", "stacksUsed": ["Bootstrap", "Node.js", "Firebase", "Embedded Javascript (EJS)", "Passport.js", "MongoDB Atlas", "Tailwind CSS", "HTML/CSS", "React.js"], "longDesc": "The problem Connect to Heal solves\nNowadays we all know that mental health is a big issue in today's society and there are a very few solutions for the people suffering through it.\nWHO also estimates that about 7.5 per cent Indians suffer from some mental disorder and predicts that by end of this year roughly 20 per cent of India will suffer from mental illnesses. According to the numbers, 56 million Indians suffer from depression and another 38 million Indians suffer from anxiety disorders.\nOne solution for these people is to form help groups where they meet once a week or month and share their experiences and problems so that everyone can relate it starts the healing process, we have taken the same solution approach online where we provide a community for people going through mental health issues where one can connect and talk to the persons with similiar problems without compromising his identity so that he doesnt feel vulnerable and can be completely open about the issue.\nThe other feature of the project is that you can also contact and chat with relevant professionals through our sub app chat to heal which will in turn help them with professional solution of the problem.\nFrom professionals standpoint they would be willing to sign up on our portal because this will help them get patients to their clinic. In future we can monetise this by charging a percent commision from professionals for their client but thats way into the future."}, {"idNo": 16, "name": "TopEducation", "desc": "To help educational institutions make their transition from offline to online easier . We bring to them a learning management system Topeducatiions.Everyone's privacy has been given utmost priority", "devfolioLink": "https://devfolio.co/submissions/topeducation-41f1", "githubLinks": ["https://github.com/moukhikgupta5/Hacko-5-kasukabe-defence-force"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JS", "Django", "SQL", "Python", "Adobe Illustrator"], "longDesc": "The problem TopEducation solves\nThe biggest problem faced by educational institutions in the pandemic which hasn't been fully tackled yet is the transition to online learning. Our project helps in preventing the chaos that occurs during the transition from offline to online"}, {"idNo": 17, "name": "Feel Cart", "desc": "Vibe your shopping experience", "devfolioLink": "https://devfolio.co/submissions/feel-cart-f92e", "githubLinks": ["https://github.com/Anirudh-sk/hacko-18-unknown"], "special_mention": " ", "stacksUsed": ["Firebase", "echoAR", "Nodejs", "React.js", "reactVR", "commerce.js"], "longDesc": "The problem Feel Cart solves\nThis pandemic situation has rapidly increased home shopping around the globe. Though home shopping is a better alternative yet it cannot be compared with the live experience experienced by the shopaholics during the pre-covid period. We have come up with a technology enhanced solution for this problem."}, {"idNo": 18, "name": "Educational Development ( Online Exam App Developm", "desc": "Online Proctored Exam , Ultimate login access to students , Fast Test Delivery , Calculator access Teacher's Portal to create exam for students in our application.", "devfolioLink": "https://devfolio.co/submissions/educational-development-online-exam-app-developm-f794", "githubLinks": ["https://github.com/THINKandroid01/Hacko-43-tech_genius"], "special_mention": " ", "stacksUsed": ["HTML", "JavaScript", "Java", "Android Studio", "Language - Java", "core Java"], "longDesc": "The problem Educational Development ( Online Exam App Developm solves\nEducational Development ( Online Exam App Development )\nAuthentication system for making student login using google sign in integration by taking the following permissions from the user.\nAfter accepting the terms and conditions user will not be able to use any application other than this app He/She may not be able to close, minimize or change the size of window screen Only WiFi and mobile data can be turned on, no other options such as Bluetooth etc can be turned on. Calls and Notifications will be blocked.\nAfter login the user will be directed to the main page where exam can be conductes. Only the the services provided by exam brach will appear on the screen of device such as question papers, calcualtors, log tables, etc A portal for teacher for uploading question papers and to provide other tools required for exam such as calculator."}, {"idNo": 19, "name": "College Management Portal", "desc": "A one-stop portal to make students' campus life more efficient, interactive and productive.", "devfolioLink": "https://devfolio.co/submissions/college-management-portal-cb76", "githubLinks": ["https://github.com/kartikeya-123/Hacko-4-code4bbs", "https://cmp-code4bbs.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["Node.js", "JavaScript", "Express.js", "MongoDB", "React.js", "MaterialUI"], "longDesc": "The problem College Management Portal solves\nEver felt it would be handier to have all the activities of the institute in one place? Well, this website portal has got your back! From lodging complaints about mess food, civil and hygiene in the hostel which will directly be addressed by the hostel office, to obtain materials for your courses, mess menu, dates of every fest and event happening in the institute, you can find everything pertaining to your campus life. We have focussed on three major issues which are student-related, college-related, and hostel-related.\nStudent-related: Getting the right people to collaborate at the right time is often tough, more so when the semester goes on virtually. This is our attempt to provide a directory of our students which supports search based on skills, positions of responsibilities, student activities, and, of course, branch and year. The portal supports workflow for endorsed profiles, robust reporting for spam-prevention, sign-up control, and has a pretty UI.\nCollege-related: Students will be provided with a timetable based on their course and batch. The portal also provides the opportunities to share resources like previous year question papers, reference guides, etc which will be a great help for the upcoming batches. Also, a daily calendar is present which lists all the important events happening on that particular day.\nHostel-related: Students face a lot of issue with hostel facilities and they lack a proper platform to raise their issues so to solve that issue we have a created a platform to raise issues which will be visible to all the students and hostel warden. Students who face similar problems can upvote the issue to increase its impact. Another cool feature is due to very limited sports equipment in the hostel, we created a platform where students can issue particular equipment and also return it."}]