[{"idNo": 0, "name": "Alute", "desc": "Learn and Contribute!", "devfolioLink": "https://devfolio.co/submissions/alute-9cd6", "githubLinks": ["https://github.com/Akriti2701/SheHack.git", "https://docs.google.com/presentation/d/1xSFm_PiOrU18wvKRg2u-HGo00OeQ22lsVPzfY7SO2RI/edit#slide=id.gcf5462001d_0_374"], "special_mention": " ", "stacksUsed": ["Bootstrap", "MongoDB", "mongoose", "HTML/CSS", "Nodejs"], "longDesc": "The problem Alute solves\nProblem Statement\nDuring the pandemic era, everyone is at courtesy of social help and this requires a large number of contributions from people. But doing this physically is not feasible. Working in CS requires being able to work efficiently in teams. But many students just slack off as they are unable to form/find a team. There’s also lack of social awareness towards nature and how important contributions are, may those be for social good or personal development for a student. With Alute, we aim at tackling both of these problems with a single solution.\nOur solution\nAlute - Learn and Contribute where users will easily be able to find projects and teams, or create a new one too. Creating and joining will be totally customized and easy. Using the credits they earn on our platform, they can be a part of social contributions as well get personal benefits. With a structured way to work and incentives provided to users to complete their projects, it is a win-win situation for all."}, {"idNo": 1, "name": "RAKSHAK", "desc": "My Safe Place-for the women,by the women", "devfolioLink": "https://devfolio.co/submissions/rakshak-8d5c", "githubLinks": ["https://github.com/Charu2518/RAKSHAK-Rakshak-SheHacksDTU", "https://www.canva.com/design/DAEbLmQF0bo/7MQVkuaKfBke7cZ8lXX3dw/view?utm_content=DAEbLmQF0bo&utm_campaign=designshare&utm_medium=link&utm_source=sharebutton", "https://rakshak-2021.netlify.app/"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JS", "Nodejs"], "longDesc": "The problem RAKSHAK solves\nSafety is a fundamental human right and shouldn't be considered a luxury for women. It is the foundation in achieving gender equality. It will create a safer environment that can encourage women to step out of their homes without any worry which will also increase their productivity and give them the confidence to explore opportunities in various fields.\nWe are building a website to have a solution which will help to curb sexual assault pandemic. Firstly the user will login themselves then the contact information of their five guardians would be asked.Now if the user is feeling unsafe or just wants to check in, a live location can be activated and can be shared with guardians. It is able to discreetly trigger an emergency alert with a double-press, instantly transmitting location information to selected contacts. If you do send an alert, it lets your guardians navigate to your location. This feature is useful to help people reach you quickly. In this way it will be able to keep users safe through these SOS features. One of its applications enables users to enter their start point and destination, in case they feel the route is unsafe. The location of the device can be tracked real time.We have also added the virtual facetime,audio illusion in the application as sometimes it may happen that you feel unsafe in the path you are travelling and you have no one to talk to you can use talk to me feature. If you are at home sometimes you feel like nothing to do you can also learn self defence through get the self defense training option. Of Course our application will also cover basic features like editing your profile,notification bar, chat with guardians,etc. If this part will get implemented successfully then we will add some more features like professional chatbot from which you can talk to professionals/police/1098 facilities,unique trigger speech system that allows you to add a unique word of your choice and trigger the alert by the unique word just like okay google."}, {"idNo": 2, "name": "OPEN UP!", "desc": "It is an emotional support platform providing a group of qualified Psycologists.If feeling sad or depressed you can Chat & share with us completely anonymously and recieve advice from therapist (free)", "devfolioLink": "https://devfolio.co/submissions/open-up-248b", "githubLinks": ["https://github.com/nandika2709/OpenUp-Sis-Code-Clan-SheHacksDTU/tree/master"], "special_mention": " ", "stacksUsed": ["Bootstrap", "CSS", "JavaScript", "Socket.IO", "Express.js", "Nodejs", "HTML5"], "longDesc": "The problem OPEN UP! solves\nAccording to study, 43% Indians suffer from depression. Depression is still a social stigma in the Indian society. Many a times, we are not able to share our problems, fears with our parents , friends or anyone, And we keep several things inside our mind and thinks a lot about it which affects our Mental Health! To break the stigma, we all need to be fully aware of mental health and well-being .So to overcome or avoid this, we just need someone to listen to us and give us valuable advice! So in our website we are providing you the qualified psychologists in which firstly you will have to fill the depression quiz which results whether you have mild depression, severe depression or sadness. When you click on \"CHAT WITH US\" , you will tell your result to us and according to result we will take you to the assigned psychologist. And then you can open up and share your feelings with them.The key feature of it would be that an individual would not be asked to disclose his/her identity, making it a more agreeable and convenient solution. Apart from this we also provide the list of event sessions which will show the upcoming events by great psycologists related to mental health so that you can register and attend! With this, we have Blog/ Researched Content which will show the solution of various Mental Health Related Problems ."}, {"idNo": 3, "name": "ICU Requirement Prediction for Covid Patients", "desc": "The model predicts whether an already admitted covid patient requires ICU treatment and also shows the correlation between patient's attributes like gender, age, and predicted ICU requirement.", "devfolioLink": "https://devfolio.co/submissions/icu-requirement-prediction-for-covid-patients-5114", "githubLinks": ["https://github.com/Ayushi-2110/ICURequirementPredictionforCovid-Patients-TheTechToddlers-SheHacksDTU"], "special_mention": " ", "stacksUsed": ["NumPy", "Logistic Regression", "Sklearn scikit panda bootstrap"], "longDesc": "The problem ICU Requirement Prediction for Covid Patients solves\nThe COVID-19 pandemic impacted the whole world, overwhelming healthcare systems which are unprepared for such intense and lengthy request for ICU beds, professionals, PPE and healthcare resources. There is urgency in obtaining accurate data to better prepare healthcare systems and avoid collapse.\nOur model does this by enabling hospitals to manage their resources efficiently, since huge demand and short supply of resources like ICU beds has led to a resource crunch. Based on the individual clinical data, our model predicts (at early stages of hospital admission) which patients will need ICU support. This helps in the following ways:\nHospitals allocate ICU resources efficiently and make sure there is no shortage. This enables more targeted patient care to avoid high-risk patients’ deterioration and consequent need for ICU admission.\nHospitals can discharge stable patients confidently if the model predicts low risk for ICU admission, thus freeing up resources for those who need them.\nSmaller hospitals will be able to gauge the no. of ICUs required, based on the hospital’s patient database. This lead to an efficient allocation of ICUs throughout healthcare system."}, {"idNo": 4, "name": "GRACIOUS GIVERS", "desc": "Giving is just not about making a donation, it is about making a difference.", "devfolioLink": "https://devfolio.co/submissions/gracious-givers-4ee3", "githubLinks": ["https://119kanika.github.io/Gracious-Givers/"], "special_mention": " ", "stacksUsed": ["jQuery", "Bootstrap", "CSS", "JavaScript", "HTML5"], "longDesc": "The problem GRACIOUS GIVERS solves\nHere is how it goes - Most people underestimate their ability to make a positive change in the world. They’re overwhelmed by the sheer number of things that need to be done, all the people that need help, and all the worthy causes that exist. However, lots of individuals making small efforts can change the world.\nHere is an opportunity for everyone to give and receive blessings.\nFirstly, We are working on an initiative of \"Street Food Box\". In this, You can drop your left-out food at our installed boxes at respective stations. This collected food will be passed on to poor and homeless people. We have seen many people craving food and dying on the streets. So we felt like we should help them with our technology and devices because why not.\nIn our personal lives, many of the times we're stuck in a situation where we have leftover food items and you have to throw them unnecessarily.\nSo we tried to take a step to solve this.\nBasically, our idea is that we want to install a system over some possible public places.\nA system in which there's a refrigerator fitted to store the food. You can navigate the nearest systems/boxes present through this site and can put your leftover food into it. Our members will take out that food from the respective systems and give the edible checked food to the people who're dying of hunger.\nSecondly, We are working on Donating school supplies that will help poor students in their education without worrying about their financial conditions. This will surely motivate them to learn new skills and enhance their knowledge.\nFinally, we have a separate page for You to share your experiences and stories with us where you helped someone in need."}, {"idNo": 5, "name": "EmpowHer", "desc": "A one-stop-shop for all the opportunities and community for women.", "devfolioLink": "https://devfolio.co/submissions/empowher-db1f", "githubLinks": ["https://github.com/Anima108/EmpowHer-AllStringsAttached-SheHacksDTU"], "special_mention": " ", "stacksUsed": ["HTML", "Flask", "Gensim", "Regex", "pickle", "Word2Vec", "sklearn.metrics.pairwise"], "longDesc": "The problem EmpowHer solves\nProblem: Even after a lot of efforts made by big tech giants and communities to reduce the gender gap in industries, women are not able to take full advantage of such initiatives because either they are not able to find them in the sea of posts or are too late for applying to them. Companies like Google even after taking initiatives like STEP intern, still have a very poor female employee percentage as the right opportunities are not able to reach the right people at the right time. This leads to a continued under-representation of women in the workforce.\nKey Focus Points:\nFigured out ways to make a one-stop place for all the opportunities and community for women and provide them with tools to grow together by connecting with a relevant group of people and mentors.\nDisplay opportunities in an organized manner to avoid spam.\nCreate a safe space for women to discuss issues."}, {"idNo": 6, "name": "DONTRACK", "desc": "donate and track", "devfolioLink": "https://devfolio.co/submissions/dontrack-b540", "githubLinks": ["https://github.com/ishaagarwal01/Dontrack-Shecodes-ShehacksDTU", "https://www.canva.com/design/DAEbLmQF0bo/7MQVkuaKfBke7cZ8lXX3dw/view?utm_content=DAEbLmQF0bo&utm_campaign=designshare&utm_medium=link&utm_source=sharebutton"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JS", "ConceilJS Tezos"], "longDesc": "The problem DONTRACK solves\nThere are thousands of nonprofit organizations in the nonprofit sector, and each serves a particular purpose. Many people tend to fund those NGO’s but keep doubts that if there donation goes in the safe hands? \nThere’s no single formula for nonprofit application development, but there are a few common elements that help these apps succeed. To solve this randomness we come up with “DONTRACK” – which is a one stop platform for donation and tracking of several NGO’s."}, {"idNo": 7, "name": "Ahaar", "desc": "Food for poor", "devfolioLink": "https://devfolio.co/submissions/ahaar-0033", "githubLinks": ["https://github.com/DipraChaudhry/Ahaar_FoodForPoor-Digislayers-SheHacksDTU"], "special_mention": " ", "stacksUsed": ["HTML", "JavaScript", "Express.js", "Nodejs"], "longDesc": "The problem Ahaar solves\nFood Wastage is a major problem in India .A significant amount of food is thrown by restaurants and eateries every single day. It is estimated that 40% of the food produced in India is wasted every year. It is all the more shocking as a lot of people in our country do not even get two square meals a day."}, {"idNo": 8, "name": "Health'N'Help", "desc": "A win-win solution to exercise procrastination", "devfolioLink": "https://devfolio.co/submissions/healthnhelp-f2cc", "githubLinks": ["https://github.com/Mighty-Geek/Health-N-Help-TechGeeks-SheHacksDTU"], "special_mention": " ", "stacksUsed": ["JavaScript", "HTML/CSS", "Nodejs", "Ml5.js"], "longDesc": "The problem Health'N'Help solves\nOur project intents to solve following problems :\n1. Healthcare\n2. Socialize\n3. Not only exercising but doing it correctly\n4. Simultaneously working towards good cause"}, {"idNo": 9, "name": "Park.ai", "desc": "Park anywhere and everywhere, legally!", "devfolioLink": "https://devfolio.co/submissions/parkai-9630", "githubLinks": ["https://github.com/MANASA-ERROR404/park.ai", "https://bit.ly/3dB22Tg"], "special_mention": " ", "stacksUsed": ["Java", "Python"], "longDesc": "The problem Park.ai solves\nWe make it easy to Park & Go!\n• On any given working day approximately 40% of the roads in urban India are taken up for just parking the cars.\n• Tremendous pressure on parking spaces have led to serious concerns like traffic congestion, accidents, disproportionate demand and supply ratio, environmental hazards etc.\n• Pollutants like oil and grease are washed off from the parking lots into the water bodies during the rains. The pollutants contaminate the water table and are also responsible for urban heat island effect. The pollutants it emits causes health\nhazards and may cause respiratory and cardiovascular damages.\nGuess what? It removes all the above and many more!"}, {"idNo": 10, "name": "AnonyMate", "desc": "Anonymate is a Counselling platform specially built for school students that helps students excel in their life by dealing with day to day life stresses.", "devfolioLink": "https://devfolio.co/submissions/anonymate-57fb", "githubLinks": ["https://github.com/aarushi353/AnonyMate-SheHacksDTU"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "Django", "JavaScript", "SQLite", "CSS3"], "longDesc": "The problem AnonyMate solves\nThey can freely communicate with the counsellor without worrying about their confidentiality"}, {"idNo": 11, "name": "COVID-FREE", "desc": "Is this vaccine safe? Analyse, Visualise, Decide, Repeat!", "devfolioLink": "https://devfolio.co/submissions/covidfree-f049", "githubLinks": ["https://github.com/sanjana-302/SHEhacksDTU"], "special_mention": " ", "stacksUsed": ["Bootstrap", "Node.js", "Embedded Javascript (EJS)", "Twitter API", "Express.js", "MongoDB", "CanvasJS", "newsapi", "Coronavirus (COVID-19) Outbreak API"], "longDesc": "The problem COVID-FREE solves\n👾‍A project builds to provide a realistic data set for the after-effects of vaccination and its visualization for the users.\n👾‍Provide a holistic dashboard to keep a track of events happening around the globe regarding covid.\n👾‍Generates a real-time image of data granted by authenticated users.\n👾‍Motivates the general public to count on exclusive data and not merely on some buzz flying around."}, {"idNo": 12, "name": "Pneumonia Diagonasis", "desc": "AN APPLICATION FOR DETECTION OF PNEUMONIA DISEASE FOR RURAL CONTEXT", "devfolioLink": "https://devfolio.co/submissions/pneumonia-diagonasis-8e16", "githubLinks": ["https://github.com/sejalllkhanna/Pneumonia-Diagnosis-Aprotech-SheHacksDTU", "https://github.com/Vrushti24/Pneumonia_Diagonasis-Aprotech-SheHacksDTU"], "special_mention": " ", "stacksUsed": ["Swift", "Flutter", "Kaggle", "Core ML", "InceptionV3", "Google Teachable Machine", "tensorflow lite"], "longDesc": "The problem Pneumonia Diagonasis solves\nPneumonia causes the death of around 700,000 children every year and affects 7% of the global population.Chest X-rays causes a lot of money and after that consulting doctor also causes a lot of money . So by using our application one can scan their X-ray and Check whether the person has Pneumonia or not . If the person has pneumonia then user can enter the name age and their location and can get to know the nearest doctor to them and can consult them and can talk with them via chat bot in our application. This application is desgined keeping in mind about rural context so It has a language feature through which user can switch to their preferred language. The accuracy of our app is 94.2% and its safe to use."}, {"idNo": 13, "name": "GirlsIgnite", "desc": "GirlsIgnite is a website that aims at empowering young girls and educates them about the importance of STEM careers.", "devfolioLink": "https://devfolio.co/submissions/girlsignite-3438", "githubLinks": ["https://github.com/kashika0112/GIRLSIGNITE--SheHacks-DTU"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "JavaScript", "Flask", "CSS3"], "longDesc": "The problem GirlsIgnite solves\nWomen have a place at the table when it comes to science and no one can tell otherwise!\nEven now, the present percentage of women in STEM is pretty low. Young girls still hesitate in pursuing careers in Science, Technology, Engineering and Mathematics. \nTherefore, GirlsIgnite is a project that aims at empowering young minds and help them know the significance of STEM and how it leads to financial independence and decision-making."}]