[{"idNo": 0, "name": "Self-Stabilizing Spoon with Remote Monitoring", "desc": "The stabilizing spoon compensates for unintended tremors or shivers and keeps the spoon bowl stable. The application displays sensor data graphically to the doctor for remote monitoring.", "devfolioLink": "https://devfolio.co/submissions/selfstabilizing-spoon-with-remote-monitoring-85a5", "githubLinks": ["https://github.com/DopeyEnvelope/Team-Chiral-Hack-The-Solution", "https://drive.google.com/drive/folders/1aa6J5rXdhGPsR8deDlAx3UbFXaRG-qGz?usp=sharing"], "special_mention": "Second runner up Prize", "stacksUsed": ["Firebase", "Java", "Internet of Things (IoT)", "NodeMCU", "Kotlin", "Arduino", "Android NDK", "Sensors"], "longDesc": "The problem Self-Stabilizing Spoon with Remote Monitoring solves\nParkinson’s disease is a neurological degenerative disease that results in irrepressible shivers in the limbs. Due to unintended tremors in their arms, patients are unable to perform everyday menial tasks like eating food out of a bowl with a spoon.\nThe stabilizing spoon compensates for unintended tremors or shivers received from the user and calibrates its head against these forces, thus keeping the spoon bowl stable at all times. This spoon can move as quickly as 500°/second, hence effectively steadying the spoon and easing the eating process of patients.\nAnother part of the holistic product is a mobile application for a designated doctor to monitor the patient’s progress.\nDuring this pandemic, people have been terrified of entering hospitals for non-COVID diseases and ailments, and we aim to create and market a product to help people adjust better to this new norm.\nWe have developed an application that analyses data collected from the spoon via sensors and statistically displays it to the designated doctor. By using this application, a doctor can not only monitor your progress but also offer diagnosis and treatment remotely, without the patient needing to leave their home.\nWith this project, the absolute aim is to make a product that can make a patient’s life easier.\nThe product will not only make it easy for the user to eat food out of a plate/bowl but also help their recovery by enabling inexpensive and thorough communication with a designated doctor.\nIn an age where people are petrified of the thought of entering the premises of a hospital, we are trying to use all the technical experience we have to create an experience that avoids as much physical contact as possible.\nIn the case of neuro diseases associated with nerves and muscles, it is imperative for the doctor to check up on the patient’s movements regularly, but we have attempted to find a way for doing that without requiring the patient to ever enter a hospital."}, {"idNo": 1, "name": "CloseBuy", "desc": "An end-to-end hyperlocal platform to connect local entrepreneurs with customers within their location and equipping them with tools to bring their services online and find customers quickly and easily", "devfolioLink": "https://devfolio.co/submissions/closebuy-3b39", "githubLinks": ["https://github.com/anubhab-code/Team-Phasors"], "special_mention": "Runner Up Prize", "stacksUsed": ["Firebase", "Flask", "Flutter", "Google Maps API", "Matic", "Geocoding", "Blockchain", "Firestore", "Moibit", "Tezos"], "longDesc": "The problem CloseBuy solves\nLocal entreprenuers lack exposure of their small businesses due to societal constraints.\nThese local entreprenuers find difficulty in acquiring initial customers and scaling their business.\nNormal consumers have to spend a lot of time looking for a good tailor for tight deadlines for an event or house helps , baby sitters or any other work , nearby."}, {"idNo": 2, "name": "ANUVAAD", "desc": "Translating Education For Future", "devfolioLink": "https://devfolio.co/submissions/anuvaad-bb16", "githubLinks": ["https://github.com/gauranshkumar/ANUVAAD", "https://github.com/thisisamank/anuvaad-flutter"], "special_mention": "Winning Prize", "stacksUsed": ["Machine Learning", "Docker", "Flutter", "API"], "longDesc": "The problem ANUVAAD solves\nProblem\nWe have enormous high quality educational content already available on the Internet, but there is a major issue which leads to limited utilisation of it. \nThe issue we have is language.\nMany of the people have problem in understanding english or foreign language which degrades the quality of the content that is present there and hence, language becomes a barrier in learning.\nSolution\nOur solution to the given problem is that we are going to build “ANUVAAD” a tool to translate any video lecture or any technical stuff into the regional language of the user.\nOur Major goal is to utilise the already available high quality content by translating them to the native language of the user, Imparting \"Quality Education\"."}, {"idNo": 3, "name": "Healthy Me", "desc": "Buliding future healthy", "devfolioLink": "https://devfolio.co/submissions/healthy-me-1d4b", "githubLinks": ["https://vaibhavgupta05.github.io/Healthy-Me/", "https://github.com/Vaibhavgupta05/Healthy-Me"], "special_mention": " ", "stacksUsed": ["jQuery", "HTML", "CSS", "JavaScript"], "longDesc": "The problem Healthy Me solves\nProvides an all in one solution for all your medical needs"}, {"idNo": 4, "name": "Wanda", "desc": "Wanda intends to be a single, unified platform for people to find curated, high-quality resources for their topics of interest from fellow software developers. 👨‍💻", "devfolioLink": "https://devfolio.co/submissions/healthhub-36c8", "githubLinks": ["https://github.com/vrushti-mody/WandaVision"], "special_mention": " ", "stacksUsed": ["JavaScript", "CSS3", "HTML5"], "longDesc": "The problem Wanda solves\nWhat is Wanda?\nWanda intends to be a single, unified platform for people new to the technology and software development to find curated, high-quality resources for their topics of interest from fellow software developers. 👨‍💻\nOur Online Study Room is freely available to help with your motivation and make progress with your work. Some describe the experience as akin to being in a library; a silent place to work alongside others ✨\nThe Vision bot provides information about almost anything Computer Science\nGenerate pretty printed resumes by just filling a form!\nInspiration\nRemember the first time you started off with tech? The vast internet at your fingertips but it's the first step that's always the hardest. 😓\nWith Wanda, anyone (even you!) can easily find free resources curated in a single place from industry experts instead of crawling the internet. What's better? You can contact real users, software developers and engineers, and contact them to seek guidance. Sounds good? Of course, it is. 🌟\nWe all become really busy with what can feel like the relentless demands of academic study and life. Many of us recognise the privilege we have to access education, but that is little comfort when we feel isolated and despondent. Wanda is built on the idea to decrease isolation and motivate us all not only to progress our work but know we can do so while our simple presence supports others. We are not alone. 🌠\nVision bot solves any queries related to computer science and guides you with topics like open source, Masters programs, etc\nFeatures\nThe Scarlett Witch\nEffective study groups can help students learn course material in a deeper, more concrete way. Groups that are effective generate positive energy, encourage active participation, instill discipline, and require commitments from members. These skills are certainly important for learning. Just like connecting the Marvel Universe, Scarlett Witch will help you connect with the right people and make your study eff"}, {"idNo": 5, "name": "UNIFORMITY", "desc": "Your mental health our concern", "devfolioLink": "https://devfolio.co/submissions/uniformity-7492", "githubLinks": ["https://github.com/manekasingh05/uniformity.git"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "CSS3", "HTML5"], "longDesc": "The problem UNIFORMITY solves\nIt basically resolves all your mental health issues by asking question and showing the solutions in the form of graphics."}, {"idNo": 6, "name": "MedZee", "desc": "For healthy lives", "devfolioLink": "https://devfolio.co/submissions/medzee-91c8", "githubLinks": ["https://github.com/Piyush20001/Hack-the-Solutionn"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "MySQL", "HTML/CSS"], "longDesc": "The problem MedZee solves\nWe collect unwanted medicines from households, segregate them and deliver the reusable ones to the under privileged and safely dispose the rest with the help of the concerned authorities."}, {"idNo": 7, "name": "Collabza", "desc": "Collabza is platform through which the NGOs can undoubtedly manage the product creators about the significance of maintainability, and the need to make the products feasible and sustainable.", "devfolioLink": "https://devfolio.co/submissions/collabza-302d", "githubLinks": ["https://github.com/weebo-ary/Collabza", "https://www.figma.com/file/BJ2WFJdUNTyv4Y8e6zaZLO/Collabza?node-id=129%3A2075", "https://drive.google.com/drive/folders/1UKkSNjIbWyEORFsk1T1uqbE_DH21fVLv?usp=sharing"], "special_mention": " ", "stacksUsed": ["jQuery", "Bootstrap", "JavaScript", "Adobe XD", "Figma", "JSON", "HTML/CSS", "Framer"], "longDesc": "The problem Collabza solves\nA dashboard which enables the budding startups and companies to get in touch with the NGOs, get their products reviewed in order to check their sustainability practices and future goals towards building a sustainable product for the consumers. NGOs will be able to conduct various campaigns with a reach many thousands of people via targeted communications, advertisements, and community outreach events and activities using social media platform like Twitter, Instagram, etc in order to educate the consumers for buying sustainable products.\nInnovative ideas and prime movers can simply contact the respective NGOs of their domain and talk about economic benefits while protecting public health and environment, etc. over their whole life cycle.\nEstablish standards and promote regulations that ensure company projects and initiatives are sustainably managed"}, {"idNo": 8, "name": "Geo-Dump", "desc": "An application that the health and sanitary department could use to keep city clean", "devfolioLink": "https://devfolio.co/submissions/geodump-45ba", "githubLinks": ["https://github.com/ArvinthKumar2502/HackTheSolution"], "special_mention": " ", "stacksUsed": ["Mask R-CNN", "Android SDK", "Google Maps API", "React js"], "longDesc": "The problem Geo-Dump solves\nWe do have waste lying in cities which makes it hard for cleaning staff to\nknow which area requires attention and urgent garbage and waste\npickup. Hence it is important for the Sanitation department to be notified about\nthose areas periodically to take immediate action ."}, {"idNo": 9, "name": "Recommendation by tracking user’s scroll behaviour", "desc": "Track user's scroll activity using frontend techniques, and use it to place ads or recomendations at the point frequently used or seen by users.", "devfolioLink": "https://devfolio.co/submissions/recommendation-by-tracking-users-scroll-behaviour-1701", "githubLinks": ["https://prod-recommend.herokuapp.com/", "https://github.com/adithyaharish/product-recommendation"], "special_mention": " ", "stacksUsed": ["React", "Django", "JavaScript", "AJAX", "Machine Learning", "Heroku", "Python", "Kaggle"], "longDesc": "The problem Recommendation by tracking user’s scroll behaviour solves\nPeople’s behaviors are rarely stable and their usability gestures change over time. But one user behavior that did change is the tendency to scroll. Most of the time we spend in an app goes in scrolling, and the remaining few in actual viewing of the content. So, what if we can track the scrolling behaviour, understand where they stop and recommend based on that.\nMost of the user's time goes wasted in scrolling content that he/she isn’t interested in. To understand their interest, their scrolling behaviour can be tracked. Point where they stop scrolling and spend some time viewing the content shows that they are interested in that content. So, our idea is to retrieve the products when scrolling stops, get similar products to that using ML techniques and display that at their point of scroll. We can aslo display ads instead of recommendations.\nTo track the user’s scroll behavior, we use Javascript. The JavaScript detects the scrolling activity. It also creates a div with an id which is used to display the data present on the screen. Once, the user stops scrolling, we extract the product present in that div tag and send it to the recommendation system. After finding the user’s interesting products we intend to find similar products using cosine similarity. For this, we implement ML techniques based on content recommendation."}, {"idNo": 10, "name": "WantECO", "desc": "Live more sustainably", "devfolioLink": "https://devfolio.co/submissions/wanteco-1ab4", "githubLinks": ["https://github.com/web-advisor/wantECO.git"], "special_mention": " ", "stacksUsed": ["jQuery", "PHP", "HTML", "JavaScript", "AJAX", "SQL", "SCSS"], "longDesc": "The problem WantECO solves\nIt can be used to explore as well as contribute for new and innovative sustainable living."}, {"idNo": 11, "name": "Graphle", "desc": "A visual learning tool", "devfolioLink": "https://devfolio.co/submissions/graphle-0f24", "githubLinks": ["https://graphle.ml/", "https://github.com/IshaanOhri/Graphle"], "special_mention": " ", "stacksUsed": ["HTML", "Node.js", "CSS", "JavaScript", "Android", "Docker", "Cloud Run", "Pusher", "BingAPI", "Google Storage"], "longDesc": "The problem Graphle solves\nGraphle is a service build to make learning easy for autistic students. It takes in real time input from the teacher, and arranges it in a visual manner.\nAutistic kids often receive education in a special way where concepts are delivered in a graphical way.\nInspired by graphical learning we created Graphle, a very effective visual learning tool for strengthening visual memory of our students.\nGraphle will be a set of a mobile application and a web service."}, {"idNo": 12, "name": "<Write Project Name Here>", "desc": "<mention tagline here>", "devfolioLink": "https://devfolio.co/submissions/lesswrite-project-name-heregreater-df95", "githubLinks": ["https://github.com/icoder18"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "Data Science", "Ml"], "longDesc": "The problem <Write Project Name Here> solves\n<write the problem statement in detail>"}, {"idNo": 13, "name": "RAHAT", "desc": "Remote Application for Health Assistance And Tracking: \" COVID mein dooriyan nahi\"", "devfolioLink": "https://devfolio.co/submissions/rahat-a980", "githubLinks": ["https://github.com/mrcodefrost/hackthesolution_220_volts", "https://drive.google.com/drive/folders/1n7m83BC7HIsAB22Z02U7yCpzIJEsBkI1?usp=sharing"], "special_mention": " ", "stacksUsed": ["Internet of Things (IoT)", "Flutter", "Arduino", "ThingSpeak", "Sensors", "ESP8266 Wifi MCU", "Cloud"], "longDesc": "The problem RAHAT solves\nRAHAT is a software-hardware integrated project developed by 220 Volts.\nRAHAT ( A Hindi word which means 'relief' in English ) is short for Remote Application for Health Assistance And Tracking.\nRAHAT implements sensor technology and internet to assist and track health of remote patients, such as ones in home isolation in COVID-19 Pandemic. It tracks live temperature and heartbeat data of user with timestamps over the Internetwork. Using the cloud nearby hospitals or loved ones can access the data, monitor the health status and help the patient if in case of an emergency. The mobile app based on Flutter framework has been developed as a smart portal for end-users and the monitoring group.\nIt's simply not possible to allocate every sick person a bed in hospital as:\nIt's expensive\nIncreases load on healthcare system\nMany people are alone and don't have relatives to look after them\nHealthcare infrastructure is hardly available in rural areas\nExtremely difficult to keep track of patients details 24 X 7\nTarget Audience\nAnyone who is in home isolation/away from healthcare services/not financially good/ living alone.\nBudget\nHealth Over Money. Hardware will be available in healthcare centers/hospitals/clinics/covid camps from where patients can rent it. There will be a provision for buying the product in case user wish to.\n!! VIDEO DEMO IS IN GOOGLE DRIVE LINK !!"}]