[{"idNo": 0, "name": "PriJour", "desc": "Where your emotion meets our devotion", "devfolioLink": "https://devfolio.co/submissions/prijour-9fa0", "githubLinks": ["https://pri-jour.herokuapp.com/", "https://github.com/dhruvinfo28/private-journal/tree/main"], "special_mention": "Grand Prize Pool", "stacksUsed": ["Node.js", "CSS", "JavaScript", "MongoDB", "IBM Watson Assistant", "HTML5", "vader-sentiment(For sentiment analysis)"], "longDesc": "The problem PriJour solves\nIt addresses the issue of Mental Health. Here, emphasis is more on early evidence-based non-pharmacological intervention. We believe that most relief for any mental health patient comes when they express themselves.\nOur web app is like an emotional spa or a free talk therapist where the users can spill all of their feelings, without anyone judging them, in the form of a private journal. Although journaling has its own merits but to top it all, our web app gives users a personalised emotional spa experience - where the massage is positivity, the scrub to remove dead cells is powerful words and in the end we shower them with positive affirmation!\nOur web app allows users to express their day by typing their feelings over a digital canvas which in turn attempts to analyse their sentiments using an ML model to give them what they really need. The data collected over a certain period is rendered in the form of a graph and helps in determining if the person needs psychiatric help, and the analysis can be shared with a doctor. A special Questionnaire is also designed in such a way that it analyses the user's psychological state and determines his/her happiness index.\nNot only this, our website also includes a trained bot - “Mamta” to help users to feel positive and happy just how everyone feels on the lap of their mother. This bot keeps a user engaged through interactive questions.\nThe insights from the user’s journal and his response to those simple set of questions generates a personalised feed of quotes, book suggestions, blog articles, videos and song therapy which works wonders as instead of scrolling those endless twitter, facebook or instagram feeds generally do more bad than good, our web app, Prijour, provides highly selected and limited feeds which gives the user some time for self-introspection. These feeds are conceptualised on the strong scientific Cognitive Behavioural Therapy(CBT) principles. This positive, undebatable content lushes them with life."}, {"idNo": 1, "name": "Ethereum Hack: Karbonize", "desc": "Decentralized Personal Carbon Trading. This is an improved ideation of the model implemented by Lahti, Finland. It gives the users incentives to reduce their carbon footprint while earning money.", "devfolioLink": "https://devfolio.co/submissions/karbonize-d863", "githubLinks": ["https://github.com/AL-S4H3R/karbonize-pwa"], "special_mention": "Grand Prize Pool", "stacksUsed": ["React", "Ionic", "Matic", "Tailwind CSS", "Truffle Suite", "Polygon", "Portis by Shapeshift"], "longDesc": "The problem Ethereum Hack: Karbonize solves\nMain Issue: High Carbon Footprint per individual\nSecondary Issue: Side Income generation\nThe POC for Karbonize includes a mobile application where the users can register their accounts and based on some initial questions, they'll will be given a weekly carbon emission allowance for travel. This is based on the same model as implemented by Lahti, Finland\nWhen the app is given location permissions, it runs a ML model to determine the mode of transport for users and deduct the Karbon Kredits(weekly carbon emission quota). This credit management is done on the blockchain for verified user accounts.\nThe users can also trade their Karbon Kredits and all the trade transactions execute on the blockchain."}, {"idNo": 2, "name": "Vision", "desc": "Trying to make this world a little safer for those who make this world.", "devfolioLink": "https://devfolio.co/submissions/vision-0b35", "githubLinks": ["https://github.com/AvishrantsSh/Xplore21", "http://ec2-18-206-46-76.compute-1.amazonaws.com:8000/", "https://drive.google.com/drive/folders/1q1uWZE6jpiqJuxP4OEQc3-w_kzcB9Xkd"], "special_mention": "Grand Prize Pool", "stacksUsed": ["Django", "JavaScript", "TensorFlow", "Electron", "Keras", "Python", "AWS", "HTML/CSS", "Nodejs"], "longDesc": "The problem Vision solves\nSurveillance means safety. \nDespite so much surveillance, the crime rates are increasing exponentially. India is toppping the charts for wrong reasons. The main reason for this is the inefficient way of surveillance and monitoring being used in our country. Several hundreds and thousands of CCTV cameras are being installed every day but only a select few have the monitoring access to them. The problem lies in the fact that inspecting several hundreds and thousands of videos is very laborous and time-intensive task.\nOnly after a crime is committed, hundreds and thousands of footages are inspected to find the crime scenes evidence.\nIs there a way to minimise this? What if the crime/violence is reported in realtime using technology.\nIn this project we try to explore this possibility. Introducing to you our project VISION.\nWe have devised a complete software solution for safety and surveillance where we convert the conventional CCTVs from an evidence collection to a crime prevention and detection tool to ensure safety and security. This real-time crime detection technology is integrated with security systems and Desktop Application to get push-in notifications in case any suspicious activity is discovered.\nOur solution captures and pre-processes the video feed and stores the frames of the video using OpenCV. The frames are then processed and classified using deep learning architectures implemented on Tensorflow to detect any suspicious activity. This result is then conveyed to the user/authority using either a Desktop Application (Electron) or a Web Platform using push-notifications."}, {"idNo": 3, "name": "Companion", "desc": "Companion for you.", "devfolioLink": "https://devfolio.co/submissions/companion-7fdf", "githubLinks": ["https://compan-ion.netlify.app/", "https://github.com/devblin/companion"], "special_mention": " ", "stacksUsed": ["Material-UI", "reactjs"], "longDesc": "The problem Companion solves\nThis app detects the users's emotion by asking various questions and helps them learn about their emotions and understand them through articles, videos and biblical phrases, which may help the user to gain peace, and have control over their emotions."}, {"idNo": 4, "name": "PsycheCheck", "desc": "The objective of this website is to help people become aware about their mental health through a short quiz and then help them improvise their quality of life based upon the results.", "devfolioLink": "https://devfolio.co/submissions/psychecheck-3bf4", "githubLinks": ["https://manavdoda7.github.io/PsycheCheck/", "https://github.com/manavdoda7/PsycheCheck"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "CSS3", "HTML5"], "longDesc": "The problem PsycheCheck solves\nIn India, consultation about the mental health issues is still considered a social stigma due to which they generally remain undetected. Over 10 percent of its 1.3 billion-strong population having suffered from one or more mental health problems. Mental health issues are not given equal importance as physical health problems and sometimes they are not recognised for an individual’s lifetime. In this fast-moving world, people are being trained to work like machines where they forget to take out time for their own selves, resulting in an increasing probability of them being in depression or suffering from some other issue related to mental health.\n“Phyche Check” is a small initiative by team Hackbit. We have designed a website that will help the user to take up a small quiz in which he/she will have to answer question related to their daily life routines and activities. There are three categories based upon the age- teenager (below 20), adult (between 20-50) and elderly (above 50). On the basis of the results of the quiz they can find out whether they are mentally fit or not.\nIf detected severely unfit the user will be informed to consult a doctor as soon as possible by giving him\\her some recommendations. If detected moderately unfit the user will be informed that he/she should stay calm and try to give more time to think about their thoughts and feelings. If detected mentally fit the user will be informed to just relax and that he’s good to go. Music is the language that connects to our soul and therefore website also offers the link to a small playlist of songs to which they can hear and it can help them relax and feel good. \nThe website also provides basic information about various mental health issues like depression, post-traumatic stress disorder, psychosis and a few more. It also tells the user the importance of regular mental health check-ups. It will help people to understand better about their own self and improvise their quality of living. \nStay positive!"}, {"idNo": 5, "name": "Rakshak Drone", "desc": "Autonomous!!!The Need of The Hour", "devfolioLink": "https://devfolio.co/submissions/rakshak-drone-040b", "githubLinks": ["https://github.com/Paras-One/rakshakdrone-xplore.git", "https://drive.google.com/file/d/1JFZX7faeuQnYod3W6FfBYm1_m_Uep_yv/view?usp=sharing"], "special_mention": " ", "stacksUsed": ["OpenCV", "ROS", "Gazebo", "Ml"], "longDesc": "The problem Rakshak Drone solves\nPrimarily this drone will help in maintaining the guidelines of Covid 19 by ensuring proper sanitization in public places. Outdoor drones will be deployed to disinfect hospital buildings, benches, car parking areas, and public community spaces, while smaller indoor drones installed with portable UVC lights, can disinfect indoor surfaces of hospitals and other public buildings.\nDepending on the disinfection requirement, each drone will carry a different payload required to achieve maximum efficiency.\nReal-time monitoring from the control center is enabled by a video camera and streaming system installed on the drones. Colour zone-mapping from the cameras builds the timeline view of disinfected areas."}, {"idNo": 6, "name": "SEEK", "desc": "Mental Peace and Calm", "devfolioLink": "https://devfolio.co/submissions/seek-891a", "githubLinks": ["https://github.com/adityathakurxd/bigbrain"], "special_mention": " ", "stacksUsed": ["ML Kit", "Machine Learning", "Flutter", "Agora.io"], "longDesc": "The problem SEEK solves\nMental health issues are generally undetected or are not recognized for an individual's entire lifetime.\nThey accept their situations and don't even realize that there might be a better way of living life and feeling things. In India, with 10 percent of its 1.3 billion-strong population having suffered from one or more mental health problems.\nAccording to WHO, India accounted for nearly 15 percent of the global mental, neurological, and substance abuse disorder burden. A meta-analysis of community surveys estimates that the prevalence of depression and anxiety could be up to 33 per 1,000 persons.\nSEEK lets people reach out to their closed ones. It monitors their video for sentiments that might down the line be used to perform analysis. As a mental health app, it also motivates and empowers users with daily check-ins."}, {"idNo": 7, "name": "econet", "desc": "A social networking site for promoting sustainable development by doing and encouraging the masses. One task completed on econet is a step toward sustainable development.", "devfolioLink": "https://devfolio.co/submissions/econet-2b48", "githubLinks": ["https://github.com/Anshit01/econet", "https://econet-web.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["jQuery", "HTML", "Bootstrap", "CSS", "Django", "JavaScript", "PostgreSQL", "Tezos", "SmartPy", "Pytezos"], "longDesc": "The problem econet solves\nPrecisely sustainable development means, using the resources effectively in present keeping in mind the needs of future generation. This is known to all but the question is how many of us adhere to this? No one. Maybe very few.\nIt is necessary to understand that the problems that affect sustainability are not restricted to large companies, in one way or another we all contribute to our grain of sand. Although they seem insignificant, our individual actions can contribute significantly and positively to sustainability, our commitment and awareness is needed to achieve truly sustainable development.\nSo we created econet - a social networking site aimed to promote sustainable development at individual level.\nHere, people post what they are doing at their level to achieve sustainability. Other people appreciate them by liking the posts. This way the people who post their work are encouraged to do more and others are also motivated to do something.\nThere are also some simple tasks to complete which make the site more interactive.\nAnd to make it more lively we have provided a points system. A user gets some points for completing tasks and also gets points for likes on his post. Then there's a ranking system to which ranks the users according to their points earned. This makes econet competitive and fun.\nThe points are stored on Tezos blockchain to make the points and ranking system decentralized."}, {"idNo": 8, "name": "CONTAMINATED VIRUS PROTECTIVE SMART HAT", "desc": "Protective conscious hat alarm system for eyes, nose and mouth from contaminated hand.", "devfolioLink": "https://devfolio.co/submissions/contaminated-virus-protective-smart-hat-76ae", "githubLinks": ["https://devpost.com/software/corona-protective-smart-hat?ref_content=user-portfolio&ref_feature=in_progress"], "special_mention": " ", "stacksUsed": ["liPo battery", "diode", "electro magnetic field technology", "Hall sensor", "Neodymium disc magnet set ring", "Transistor", "Switch", "Other electronics component"], "longDesc": "The problem CONTAMINATED VIRUS PROTECTIVE SMART HAT solves\nThis hat reduce the chances of unconsciously touches of eyes, nose and mouth by our contaminated hand. In everyday 's life we touches our face many times. So a high chance is created for contaminated virus to enter human body. This hat protect and reduce our face touching probability by our contaminated hand. Whenever user hand come close to his/her face the hat alert the user by a buzzer sound."}, {"idNo": 9, "name": "Not known", "desc": "nope", "devfolioLink": "https://devfolio.co/submissions/not-known-33a1", "githubLinks": ["https://github.com/"], "special_mention": " ", "stacksUsed": ["AR/VR"], "longDesc": "The problem Not known solves\neverything , just one click away"}, {"idNo": 10, "name": "B-WELL", "desc": "CARE THAT NEVER QUITS", "devfolioLink": "https://devfolio.co/submissions/bwell-062d", "githubLinks": ["https://deepak91168.github.io/hugs_for_bugs/index.html"], "special_mention": " ", "stacksUsed": ["JavaScript", "Git", "GitHub", "Adobe Photoshop", "Adobe Illustrator", "CSS3", "HTML5"], "longDesc": "The problem B-WELL solves\nAt the times when the entire world is grappling with the COVID-19 pandemic, the mental health of millions of people has impacted. The levels of anxiety, fear, isolations the world struggles to bring COVID-19 unde control. However, the scenario surrounding mental health has of psychiatrists and counsellors in the country remain at an abysmal number.\nIt will spread awareness and to keep you about mental health.\nIt will provide the platform for people to check their mental health.\nIt will provide proper recommendations according to your peformance in mental health test.\nIt will provide the best care near you."}, {"idNo": 11, "name": "Euphoria", "desc": "An initiative to reduce depression, stress and anxiety among peoples through meditation and yoga.", "devfolioLink": "https://devfolio.co/submissions/euphoria-8a2a", "githubLinks": ["https://github.com/Sudhanshumishra221220/Euphoria", "https://github.com/swet-s/Euphoria", "https://github.com/2211shubham/euphoria"], "special_mention": " ", "stacksUsed": ["jQuery", "Bootstrap", "JavaScript", "Adobe Illustrator", "Audacity", "Nodejs", "CSS3", "HTML5"], "longDesc": "The problem Euphoria solves\nWe have tried to lower the anxiety and depression level of a person through exclusively unique way . We have thought of an feasible solution in which we would be asking fewer questions to the suffering person and based on their answer we would be giving them scores. And each score has its upper limit. Based on that score we will be giving the feedback about the level of anxiety.And finally , if the score surpasses the maximum limit of our criteria, we will make direct contact of that person to our team's recruited ( professional) psychiatrist. \nIn this way we have designed a simple and feasible website to cope up with the most undermine way of handling depression. Since during lockdown it is one of the most serious issue to deal with."}, {"idNo": 12, "name": "AR Real Time Consultant", "desc": "Real Time Guide at your place:)", "devfolioLink": "https://devfolio.co/submissions/ar-real-time-consultant-2d17", "githubLinks": ["https://docs.google.com/presentation/d/1VWKitcw9J5SpFSCUqtmMnfQJGVDkCgqLpzWqnGv8KuQ/edit?ts=602826c8#slide=id.gba612bb36c_0_673"], "special_mention": " ", "stacksUsed": ["Firebase", "Google AR Core", "unity engine", "Photon Engine"], "longDesc": "The problem AR Real Time Consultant solves\nThis project can be used for the purpose of bridging the distance between rural and urban companies in order to promote sustainable development. Industries in India require expertise knowledge in order to grow and our aim is to provide them this required guidance remotely with the help of Augmented Reality. Guides remotely can look after the work the workers are doing in their workplace and make required corrections or improvements. This requires just the application and none of our natural resouces are exploited. In this way, technology can be incorporated with development in the best possible way."}, {"idNo": 13, "name": "Bhavna", "desc": "A website that can detect mental illness and help people overcome them", "devfolioLink": "https://devfolio.co/submissions/bhavna-8a5b", "githubLinks": ["https://github.com/akshsharma1218/bot-hard"], "special_mention": " ", "stacksUsed": ["Django", "Machine Learning", "SQLite"], "longDesc": "The problem Bhavna solves\nAs mental health issues are generally undetected or are not recognised for an individual's entire lifetime we plan to detect it at an early stage and help the user overcome it. We have developed a website that will interact with the user and ask him genral purpose quesions(the website also has a diary section where the user can write his or her random thoughts). Based on the answers given by the user our machine learning model will determine the sentiment of the user. Till now we can classify 5 sentiments that are Joy, Fear, Anger, Sadness, Neutral. The judgement of the mental state will be a continuous process as we cant detect users mental state just by a single survey, thus we will take it for about 3 to 4 time and ask different questions. These questions are questions about genral life like for ex How was your day?, Tell me something about yourself etc. Based on the ans we will get a particular sentiment on every ans. Then we are storing it on a database. If at any point we find that for about 2 3 days the user's sad sentiment is always higher than joy or neutral we will try to show the user some of his good dairy memories. If we find the case is extreme and like the user is in a sad mood for about a week or more we will notify his relative whose contact will be provided by the user while registering on our site."}, {"idNo": 14, "name": "Anytime Med", "desc": "Anytime med one stop solution for all we help everyone.", "devfolioLink": "https://devfolio.co/submissions/anytime-med-140f", "githubLinks": ["https://drive.google.com/drive/folders/1zOdl8uZw7ecfwZzZLNtuyUyGijlfWGay?usp=sharing"], "special_mention": " ", "stacksUsed": ["Django", "Flutter"], "longDesc": "The problem Anytime Med solves\nA mobile application which will be an online platform for common people of India that will give them access to the medicine stock present in the Government hospitals and dispensaries all over India and give them the option to book medicines online and later go and buy them. Users can also maintain his/her complete medical history in the app like medicines, diseases, appointments, prescriptions and many more.\nFeatures\n1. Easy to use.\n2. Proper recommendations and filtering based on user location and medicines taken\nby user (if specified).\n3. Searching.\n4. Book medicines online.\n5. Online history.\n6. Real time stock details of various Hospitals.\n7. User Verification via OTP (using phone number).\n8. User will receive notifications if marked medicines will come in stock.\nPros\n1. Will save the travelling time and cost of the person.\n2. Reduce Corruption as the Stock will be visible to all."}, {"idNo": 15, "name": "AR-BIM-Modeling", "desc": "Augmented BIM", "devfolioLink": "https://devfolio.co/submissions/arbimmodeling-4206", "githubLinks": ["https://github.com/Amit173/AR-BIM-Modeling", "https://docs.google.com/presentation/d/1pKMifhYJgIwHV8461F0CpJ6lwsEy6Mya3Tc4V9L-0zQ/edit?usp=sharing"], "special_mention": " ", "stacksUsed": ["C++", "Augmented Reality", "Blender", "C#", "Unity 3D"], "longDesc": "The problem AR-BIM-Modeling solves\nThe number one problem with this is that the information located in the BIM project isn’t available to workers when they need it. For example, imagine we are at a construction site where the ground floor reinforcement is being laid. Today all that information that the steel fixer needs is (generally) stored in a set of A1 drawings in the site office. These drawings have been pulled from a BIM model and then edited to adhere to a set of drawing standards that are understandable to the human eye. I know from my drafting days that this means that much of the information in the model is lost when it is transferred to a 2D drawing. It makes no sense to develop a digital model, filled with useful information that can improve safety, scheduling, project management processes and quality; and then we strip all that information out, simple because we have no better way. But it has to be done, because what’s the alternative?\nAt this time there is no practical way to make this model and all its information available to those who need it.\nResearch shows, that by giving a worker task-specific information he is better informed, and less distracted by other information, improving the quality of his work and reducing the chance of errors. In addition to this, many specialised workers only attend the site for a short period of time and then leave, meaning they have no understanding of the overall project context. By providing them with on-demand, context-aware information, they are empowered to make better decisions and improve efficiency.\nIt has also been proven that AR has the ability to implement BIM in such a way that information is more easily retrieved, reducing errors during assembly, communication improvements and problem solving improvements."}, {"idNo": 16, "name": "Recommendation System to understand users better", "desc": "Based on users past and present interest, products or related content is delivered to make them more involved to the company.", "devfolioLink": "https://devfolio.co/submissions/recommendation-system-to-understand-users-better-7f47", "githubLinks": ["https://github.com/adithyaharish/product-recommendation", "https://prod-recommend.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["Flask", "NumPy", "Machine Learning", "pandas", "Heroku", "Git", "Google Colab", "Python", "Kaggle", "ML Classifier"], "longDesc": "The problem Recommendation System to understand users better solves\nCompanies are having hard time understanding their customers and if they master it, their revenue starts growing. So, I am trying to solve it by using ML and understanding user's preferences. The project can be directly used for E-commerce or related applications, and can be slightly modified for other purposes. Based on user's input or history, their taste or interest is determined and ads or recommendations are done. This inreases their attachment to the company. The ML code runs over the dataset and builds a model file. So the next time, it does'nt need to train model all over again. This saves a lot of time and resources. The code needs to be run again only when new datasets are added."}, {"idNo": 17, "name": "AgroBits", "desc": "Bid for Better Future", "devfolioLink": "https://devfolio.co/submissions/agrobits-2fdb", "githubLinks": ["https://github.com/SushantChandla/repo", "http://agrobits.herokuapp.com/homeapp/home/", "https://docs.google.com/presentation/d/1QNSJrsym6D4QN_GvRCkVAZ2E8FPz4clNvUPYH71-q7E/edit?usp=sharing", "https://bit.ly/2P0L5JH"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JS", "Django", "Tezos", "SmartPy", "Pytezos"], "longDesc": "The problem AgroBits solves\nIt is a well known problem, how small scale farmers suffer for credits, and thus lack of credits result in lack of production and downfall of their economic conditions.\nWe created a website where people can buy and sell stocks. We have stocks of various crops. Currently seven different stocks i.e., wheat, paddy, soyabean, rajma, sugarcane, bajra and maize are available.\nAn year is divided in two seasons, one form January to June and other from July to December. Fresh stocks are available at the beginning of every season. Stocks quantity is fixed but the price varies with time and other factors affecting that particular crop production. Time tends to increase the price of the stocks and other factors may increase or decrease the price.\nThe money thus collected by the stocks are given as credit to the farmers at reasonavble rates for agricultural use.\nAt the end of season, farmers are to repay back their loans and users' stocks are reduced to zero and they are paid the price of the current value of their stocks. ( during the season, customer can sell their stocks at the current price).\nThus new season begins and the cycles continues again.\nwe have used Tezos to provide security to all the transactions. Since blockchains are highly secure so our system gives a very high level of security to the customers.\nAs the number of people investing in stocks are substantially high, it can be assumed that the financial stability will be present in he system.\nIt will be totally new for the Indian agriculture to get investments this huge in size and it can substantially increase the production and thus solve the issue of POVERTY, HUNGER and ECONOMIC GROWTH."}, {"idNo": 18, "name": "Multi-modal Depression Screening System", "desc": "Making your mental health better", "devfolioLink": "https://devfolio.co/submissions/multimodal-depression-screening-system-f3a6", "githubLinks": ["https://github.com/cmsharma/depressionpredictor", "https://depressionpredictor.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["jQuery", "Bootstrap", "Flask", "TensorFlow", "Machine Learning", "Python", "Computer Vision", "CSS3"], "longDesc": "The problem Multi-modal Depression Screening System solves\nIn today’s scenario stress related problems are not uncommon among the working professionals. There are several studies available on it. Industry association, Assocham, published in its study that forty two percent of working professionals in the Indian private sector suffer from depression, general anxiety. There could be many reasons for depression and mental health disorders.There is a high chance of depression in the employees due to change in lifestyle and work cultures. It definitely affects the performance of an individual employee. So many companies took the various initiatives to ease the workplace atmosphere.\nMany people are stressed due to rapid change in daily life routine, and work culture.Stress and mental health problems can be identified by a person’s behavior like how he/she feels, eats, thinks, works, walks etc over a period of observation. Work pressure, working environment, people we interact with, daily routine work, food habits, time spent on social media, daily exercise time, monthly income and expenses, consuming alcohol and tobacco, etc. are some of the major reasons behind building stress among the people. Stress can be detected through some conventional medical symptoms such as headache, rapid heartbeats, feeling low energy, chest pain, frequent colds, infections, etc. The stress also may reflect in normal behavior while carrying out day-to-day activities\nIn our project we consider eighteen parameters as inputs about the lifestyle and work culture of an individual. And using machine learning techniques we are predicting about the possibility of depression. Various machine learning techniques are applied for data cleaning, data balancing and to train the model. Accuracy of the various models are compared and studied.The Decision Tree model achieved the highest accuracy of 86%. This model is used for prediction. By using the Decision Tree model, we found the parameters which are influencing the depression most."}, {"idNo": 19, "name": "Health Coach", "desc": "Recovery is possible", "devfolioLink": "https://devfolio.co/submissions/health-coach-5c81", "githubLinks": ["https://github.com/hrscoders25/Health-Coach"], "special_mention": " ", "stacksUsed": ["jQuery", "HTML", "Bootstrap", "CSS", "JavaScript", "Machine Learning"], "longDesc": "The problem Health Coach solves\nNow a days, from student to employees suffer from one or more mental health problems due to increasing workload and stress. So, our main aim of our website is to spread awareness about these mental health problems and help them to cure it."}]