[{"idNo": 0, "name": "Offline Payment", "desc": "The next Big Push For Digital Transactions", "devfolioLink": "https://devfolio.co/submissions/offline-payment-4b88", "githubLinks": ["https://github.com/kusoz5/Payment-App", "https://docs.google.com/presentation/d/1FxXBjH-Uvj1AuthmYL5T4lx8rIb5qJh2fwznLrrvU4Q/edit?usp=sharing"], "special_mention": "2nd Runner Up", "stacksUsed": ["Android", "Java"], "longDesc": "The problem Offline Payment solves\nThe absence of, or erratic, internet connectivity, especially in remote areas, is a major impediment to the adoption of digital payments. Availability of options to make offline payments using a phone could boost the adoption of digital payments.\nDespite nearly 1.15 billion telecom subscribers and over 650 million mobile broadband users in India as of April 2020 & out of which today we have 100-150 million active base of digital subscribers because many of the users from rural as well as from urban areas are not able to use the services due to in-stable Internet connectivity."}, {"idNo": 1, "name": "Mirai Secured with Automation", "desc": "We are building one of the most Secure and smart home automation system.", "devfolioLink": "https://devfolio.co/submissions/mirai-secured-with-automation-a035", "githubLinks": ["https://github.com/shaurya0406/Team-Mirai-VIHAAN-2021"], "special_mention": "Runner Up", "stacksUsed": ["ESP32", "Embedded C", "Convolutional neural network (CNN)", "Google Cloud API", "TensorFlow Lite for MCU", "Apple HomeKIT", "PlatformIO", "ESP-IDF"], "longDesc": "The problem Mirai Secured with Automation solves\nToday there are millions of IoT devices but only a few address the most important issue of security and data-privacy. \nAnyone who has the server access be it a hacker, or the manufacturer or the service provider itself, can control your devices.\nHow our implementation is better than the existing market players:\nSECURITY\nWe have implemented encryption not only at software level but also in our hardware(ESP32) by customising the partition scheme.To implement a Server-Less model, we have Peer-to-Peer(P2P) communication between the nodes of the mesh as well as with the smartphone.To enable global access of our devices, the smartphone uploads the device status to iCloud with encryption enabled. At no time the devices are directly connected to the cloud server. .So no one can control our devices until they have gone through the initial setup process wihich only involves scanning of QR-code from smart-phone and all the wifi and cloud credential are automatically configured. \nAt the Hardware level, it is important to enable on device secure encryption boot and flash of the firmware.This removes the possibility of hacking into the system manually by reading the Flash memory registers of the device(ESP32).For this we have\nmade a custom NVSpartition scheme to enable code operation modularity:\n2 OTA update partitions for secure boot after over-the-air update of firmware.\nHomeKit and MESH running on 1 core and Wake word detection on the other.(ESP32 is a dual core SoC)\nDynamic Addition of various types of devices with just 1 product using MESH which communicates on our custom encrypted networking protocol rather than HTTPS or MQTT.\nOur device does'nt require the users to download any extra app.Our device works and syncs with both Apple-HomeKit, Google Home apps which come Pre-Installed on all iOS and Android devices.\nOn Device Offline Speech Recognition\nFor detailed info, please check our Github Repo!"}, {"idNo": 2, "name": "VIT Chennai - Therapy with Virtual Reality", "desc": "Harshitha 18MIS1007, Vaishnavi S 18MIS1029, Daiyaan 18MIS1081.", "devfolioLink": "https://devfolio.co/submissions/therapy-with-virtual-reality-d399", "githubLinks": ["https://ufile.io/fpzuhmrg", "https://github.com/Vaishnavi0123/Vihaan-Crewmates", "https://docs.google.com/presentation/d/1mZsAdUNc5xQ-F2m73zh6zdjF1ZXTNQl-Ym675VaQEbo/edit?usp=sharing"], "special_mention": "Winner", "stacksUsed": ["Unity", "Dart", "Arduino Uno", "Arduino IDE", "Flutter", "VR", "C#", "Sensors", "Back4apps", "StreamVR"], "longDesc": "The problem VIT Chennai - Therapy with Virtual Reality solves\nThe wide prevalence of panic disorders, social anxiety, phobias, and PTSD needs to be addressed in mental healthcare immediately. Primitive forms of exposure therapy used in the treatment of these disorders are incapable of reproducing controlled environments. We use Virtual Reality to ensure that the exposure therapy is done in an easier and safer environment. VR therapy app makes the job of the therapist a lot easier. Thus our app is a more viable solution for therapy than the existing methodologies"}, {"idNo": 3, "name": "BeatCOVID", "desc": "Application of Machine Learning prevent COVID", "devfolioLink": "https://devfolio.co/submissions/beatcovid-1829", "githubLinks": ["https://github.com/Anshnrag02/Vihaan-Covid-Project", "https://github.com/Anshnrag02/Vihaan-Covid-Project/blob/main/Presentation%20for%20hackathon.pdf"], "special_mention": "Best All Freshers Team", "stacksUsed": ["React", "JavaScript", "OpenCV", "Machine Learning", "Python", "YOLOv3 Algorithm", "Keras CNN", "HTML/CSS", "Trensorflow", "Speechly API"], "longDesc": "The problem BeatCOVID solves\nDetection of People and estimation of distances in order to ensure Social Distancing\nDetection of Face Mask in the live video stream to prevent the spread of COVID19\nUsing Speechly to have a zero-touch human-computer interaction"}, {"idNo": 4, "name": "Early Warning system -Prevent Human Animal Conflit", "desc": "Mails officials and warns people when any elephant or wild animal is detected and employs a unique technique to drive away these animals.", "devfolioLink": "https://devfolio.co/submissions/early-warning-system-prevent-human-animal-conflit-68bf", "githubLinks": ["https://github.com/scrodenbug/TeamSlon_Vihaan2021/tree/main"], "special_mention": "Best All Women Team", "stacksUsed": ["Deep Learning", "MATLAB", "Image Processing"], "longDesc": "The problem Early Warning system -Prevent Human Animal Conflit solves\nPrevent human animal conflicts in remote areas and fringes of forest regions. Very helpful for the forest department as well for tracking the movement and sightings of animals. Employs non invasive technique to drive away these animals without harming both the humans as well as animals"}, {"idNo": 5, "name": "Agro App", "desc": "A One Stop Place for Famers", "devfolioLink": "https://devfolio.co/submissions/agro-app-0c7d", "githubLinks": ["https://github.com/helewrer3/vihaan_app", "https://drive.google.com/file/d/14bctwn52A7QDIh5Isg9RMvaDPCzjZw6_/view?usp=sharing"], "special_mention": "Best IEEE Team", "stacksUsed": ["Firebase", "Django", "Flask", "TensorFlow", "Heroku", "Flutter", "Adobe XD", "Express.js", "Nodejs"], "longDesc": "The problem Agro App solves\nTraditionally farmers have used their perceptual sensorial systems to diagnose and monitor their crops health and needs. However, humans possess five basic perceptual systems with accuracy levels that can change from human to human which are largely dependent on the stress, experience, health and age. To overcome this problem, in the last decade, with the help of the emergence of smartphone technology, new agronomic applications were developed to reach better, cost-effective, more accurate and portable diagnosis systems. With apps and websites being used virtually everywhere, we decided to create an all-purpose Flutter application for farmers as our submission for Vihaan 4.0 hackathon."}, {"idNo": 6, "name": "Good Trip", "desc": "Tinder of Tourism", "devfolioLink": "https://devfolio.co/submissions/good-trip-ccac", "githubLinks": ["https://github.com/Arnold2381/VIHAAN_GARLIC-BREAD"], "special_mention": "Top 12", "stacksUsed": ["Firebase", "CSS", "JavaScript", "Flask", "Beautiful Soup", "Python", "Google Maps API", "Spotify API", "Google Places API"], "longDesc": "The problem Good Trip solves\nTo provide a smooth and easy travel experience for road trips and also provide an option to interact with strangers having the same zeal to explore and travel. The product we made is basically an interactive dashboard that acts as a travel assistant with many interesting and useful features."}, {"idNo": 7, "name": "Shutterbug", "desc": "AI Powered App to help pose for modelling", "devfolioLink": "https://devfolio.co/submissions/shutterbug-0853", "githubLinks": ["https://github.com/Shambhavi-Singh/Shutterbug"], "special_mention": "Top 12", "stacksUsed": ["TensorFlow", "Flutter", "Node"], "longDesc": "The problem Shutterbug solves\nSaw an Instagram photo and wondered how you would look in that pose? Wanted to take a professional looking photo but never found a proper guide? Need tips to form a particular pose? Need inspiration forr styles and captions? Our app can help you with all these and give you a platform to train your poses and take those insta-worthy pictures from your own phone or laptop using AI! So get ready for a lightweight fun app!"}, {"idNo": 8, "name": "Lab Plus", "desc": "Helping you analyze your lab reports", "devfolioLink": "https://devfolio.co/submissions/lab-plus-c893", "githubLinks": ["https://drive.google.com/drive/folders/1yZZ0pZf7Z1ZYZoYJh1xkMXStrhDx7U-F", "https://github.com/ShivamGupta0/hackathon/tree/main/Downloads/doctorappointment-master/doctorappointment-master"], "special_mention": "Top 12", "stacksUsed": ["Machine Learning", "Flutter"], "longDesc": "The problem Lab Plus solves\nLimited availability of doctors can mean it can take us over a week to get an appointment scheduled. These long waiting periods can lead to health issues amoung patients. We at Lab Plus have tried to address this problem to a certain extent by helping you analyze your laboratory reports on our application. By analyzing their report using our application patients can seek immediate help in case of abnormal results."}, {"idNo": 9, "name": "Agri-Pal", "desc": "Agri-Pal is the simplest solution to aid a farmer in Agriculture - Crop and Poultry Farming. Agri-Pal is a simple Plug n Play device ensuring Disease Detection and Animal Breach Detection.", "devfolioLink": "https://devfolio.co/submissions/agripal-db7e", "githubLinks": ["https://drive.google.com/drive/folders/1VruW6-7GaIAegjrveUsDtecXK8r16q-T?usp=sharing"], "special_mention": "Top 12", "stacksUsed": ["Raspberry Pi", "Computer Vision", "Iot"], "longDesc": "The problem Agri-Pal solves\nIndia's farm yield is 30-50% lower than that of developed nations. Diseases on crops have played a significant role in losses in productivity ranging from 5 to 15 % as per Agro Economic Research Centre of University of Madras. Identification of the diseases in the early stages in Poultry and Crops and taking necessary steps will make sure increment in yield drastically. Our Device detects diseases in the early stages and provides the user with proper instructions to avoid drastic losses.\nWildlife Attacks on crops and Poultry have considerably affected the farmers throughout India. Major wildlife agents responsible for these critical damages have been Elephants, Wild Boars and Monkeys and snakes and cats in Poultry. Security personal to watch over the crops is both tedious, and expensive. The need to monitor and proper reaction mechanisms in Animal and burglary detections are very essential. Our Device prevents any Animal Breach by first detecting the animal through Computer Vision and then providing necessary measure to prevent it from entering. Eg. Use of Bee Buzzing Sounds to chase Elephants away\nParticipation and Involvement of Youth are not considerably high. Providing an interactive Aid to guide will ensure more involvement of Youth. The easy to use device with a simple guide allows the Gardners and Children in Cities to nurture their Agriculture with out any hasstle"}, {"idNo": 10, "name": "EmpowHer", "desc": "Some of us women are becoming the men we wanted to marry", "devfolioLink": "https://devfolio.co/submissions/empowher-aa30", "githubLinks": ["https://github.com/vidhi-mody/Vihaan"], "special_mention": "Top 12", "stacksUsed": ["jQuery", "Bootstrap", "Node.js", "Socket.IO", "MongoDB Atlas", "ejs", "Tensorflowjs", "Google OAuth2", "Google DialogFlow", "IBM Watson Cloud"], "longDesc": "The problem EmpowHer solves\nThere is a need to redefine the status of women in the society. For time immemorial women in general have been forced to occupy a secondary place in relation to men. Women have been relegated to the margins in spite of the fact that they are numerically half of the world's population. \nAccording to the World Bank:\nWomen account for 66% of the world’s working hours but only 10% of the world income.\nOf the 900 million adults worldwide who cannot read or write, about two thirds are women.\nMany women leave their jobs to tend to their familial needs. They are currently under-represented in STEM-related professions.\nIt is also believed that women will be disproportionately affected by digital transformation.\nWomen 11 times more likely to not work after Covid job loss\nA change can be brought through the constitution and supportive legislations. The Constitution of India gives a women status equal to men. Women empowerment has to begin with women's active participation. Unless women throw off the shackles that ignore their talent, skill and spirit women through education and economic self-reliance, women cannot be empowered.\nAccording to READ GLOBAL one of the key enablers for women empowerment is the need for a “safe space” for women to gather and learn. However, as of now there is no such virtual platform available. The next enabler for women empowerment is to teach women job skills and seed businesses. There is also a need to build their self-esteem and confidence. With EMPOWER we propose a platform for women to build, grow and learn together. We aim to create communities of women that support each other along with the skill enhancement and upliftment provided to them by NGOs on the platform. We aim to curate a platform where women can connect, share their thoughts, promote their businesses, connect with potential recruiters and get quick replies to common questions through conversational AI."}, {"idNo": 11, "name": "निVESH", "desc": "निVESH is a stock market simulator with all the features one needs to ace his journey of stock trading. It has a Roadmap, a simulator, a visualization dashboard, a news section, calculators etc..", "devfolioLink": "https://devfolio.co/submissions/vesh-05d7", "githubLinks": ["https://github.com/rushabhkela/Nivesh"], "special_mention": "Top 12", "stacksUsed": ["CSS", "JavaScript", "Express.js", "MongoDB", "Nodejs", "HTML5", "highcharts"], "longDesc": "The problem निVESH solves\n-> People often consider stock market as gambling. They think that the investors of stock market are just spectators and lucky if they earn profit and unlucky if they lose money. \n-> Newcomers find the whole process complex and never start investing as they don’t know the prerequisites.\n-> People are not used to the whole experience of actual stock trading and often tend to depend too much on stock predictors available on the internet."}, {"idNo": 12, "name": "DotKeeper", "desc": "Modern, smart, and extensible cloud locker", "devfolioLink": "https://devfolio.co/submissions/dotkeeper-afea", "githubLinks": ["https://dotkeeper.ml/", "https://github.com/Akshit8/dotkeeper"], "special_mention": "Top 12", "stacksUsed": ["HTML", "Node.js", "CSS", "JavaScript", "TypeScript", "MongoDB", "Handlebars.js", "GCP"], "longDesc": "The problem DotKeeper solves\nAs a developer, we all have faced the issue of managing and storing environment/configuration variables used in our applications. Since the nature of this data is too sensitive it is not advised to check in this data into Git. This often creates problems like\nunnecessary sharing of these files b/w developers.\ndifficult to recover, in case these files are accidentally deleted.\nloose sharing of such sensitive data often results in mishandling which can be the cause of a major attack on the system.\nDotKeeper, a simple and powerful cloud service, saves you from the inconvenience of managing these config files yourself. It's a Modern, smart, and extensible cloud locker for managing secrets and protecting sensitive application data."}, {"idNo": 13, "name": "Safe Space", "desc": "An interactive self-transformation journey", "devfolioLink": "https://devfolio.co/submissions/safe-space-7028", "githubLinks": ["https://github.com/ishita1805/Safe-Space-Backend", "https://github.com/ishita1805/safe-space-frontend", "https://drive.google.com/drive/folders/1A6n74PnrVyx5sLbJHnL_9t3FspPMo1pE?usp=sharing"], "special_mention": "Top 12", "stacksUsed": ["MySQL", "AR.js", "Figma", "Dialogflow", "AWS", "Express.js", "Nodejs", "reactjs"], "longDesc": "The problem Safe Space solves\nGiven the pandemic, the need for acknowledging mental health problems is more than ever. People need a platform to provide them with ways to deal with issues related to mental health like anxiety, insomnia, restlessness, or maybe just a place where they can relieve the stress of their hectic lives. \nSafe space is a mental health platform that is free and open to all, It is an initiative to promote better mental health and more awareness around the topic.\nAlong with a fresh and interactive UI, Safe space offers, many features which can help users to track, analyze and improve their mental health.\nFeatures: \n1. AR Chat Buddy\n2. Online Journal\n3. Sleep buddy - Provides sleep-inducing activities depending on the issue faced\n4. Activities for mood analysis and a monthly mood chart\n5. Mood analysis based books and music recommendations\n6. Explore dailys - A segment where the users can view posts filtered for them based upon their mood\n7. Affiliate a doctor - This feature is for people to connect with doctors and interact virtually\n8. Interactive UI with inspirational quotes and “This is a sign” messages"}, {"idNo": 14, "name": "Edu V", "desc": "E- learning for the future", "devfolioLink": "https://devfolio.co/submissions/edu-v-e8b0", "githubLinks": ["https://github.com/AdityaDeodeshmukh/EDUV-ARFiles", "https://github.com/sahas-01/Flutter-files"], "special_mention": "Top 12", "stacksUsed": ["Unity", "Vuforia", "Blender", "Autodesk Maya"], "longDesc": "The problem Edu V solves\nEDU-V is an online platform for learners to connect with trainers from various fields. It is a platform to learn and perform experiments and to learn new skills or honing already existing ones. It helps people living in remote areas to connect with educators and fellow peers from all around the world. There is also a feature of Virtual Labs on offer which would enable students to perform experiments like they would do physically in a lab at the comfort of their homes(using Augmented Reality). Since we are living in an unprecedented situation, this platform would not only make learning easier, but would also give students a classroom like experience.\nFor example,if a student wants to perform a physics experiment, he/she would choose the subject, followed by the experiment that he/she would like to perform, following which the user will be redirected to a tab wherein he would be asked to choose to perform the experiment individually, or whether he would like to collaborate with a friend and perform the same.\nThis way it does not become monotonous for a student who is at home all alone staring at a laptop screen."}, {"idNo": 15, "name": "Error", "desc": "Error", "devfolioLink": "https://devfolio.co/submissions/l-scale-f155", "githubLinks": ["https://www.github.com/"], "special_mention": " ", "stacksUsed": ["Java"], "longDesc": "The problem Error solves\nError"}, {"idNo": 16, "name": "Project Athena", "desc": "Simulation of a level 3 autonomous vehicle", "devfolioLink": "https://devfolio.co/submissions/project-athena-0ecc", "githubLinks": ["https://github.com/Boolean-Bandits/Project_Athena"], "special_mention": " ", "stacksUsed": ["rviz", "ROS (Robot Operating System)", "roscpp", "rospy"], "longDesc": "The problem Project Athena solves\nThe multiple problems which this project solves are:\nREDUCED ACCIDENTS\nAccording to the USDOT website: \"With 94 percent of fatal vehicle crashes attributable to human error, the potential of autonomous vehicle technologies to reduce deaths and injuries on our roads urges us to action.\"\nSelf-driving cars are projected to reduce traffic deaths by 90 percent, saving 30,000 lives a year\nREDUCED CO2 EMISSIONS\nThe reduction in congestion will most likely result in a reduction of CO2 emissions as well.\nSince the software will drive the car, the modern vehicle can now be programmed to reduce emissions to the maximum extent possible. The transition to new-age cars is expected to contribute to a 60% fall in emissions.\nREDUCED TRAFFIC CONGESTION\nAmericans currently spend more than 6.9 billion hours a year sitting in traffic, according to the American Society of Civil Engineers. Even decreasing the number of accidents could reduce congestion, because up to 25% of congestion is caused by traffic incidents,\nUnder normal circumstances, human drivers naturally create stop-and-go traffic, even in the absence of bottlenecks, lane changes, merges, or other disruptions. This phenomenon is called the \"phantom traffic jam.\" U of Illinois researchers found that by controlling the pace of the autonomous car in the study, they were able to smooth out the traffic flow for all the cars.\nINCREASED LANE CAPACITY\nResearch from the State Smart Transportation Initiative (SSTI) shows potential for autonomous vehicles could increase highway capacity by 100 percent and increase expressway travel speeds by more than 20 percent.\nLOWER FUEL CONSUMPTION\nAV technology can improve fuel economy, improving it by 4–10 percent by accelerating and decelerating more smoothly than a human driver. Further improvements could be had by reducing the distance between vehicles and increasing roadway capacity."}, {"idNo": 17, "name": "Infographs", "desc": "We offer modern insights and solutions for growing your business.", "devfolioLink": "https://devfolio.co/submissions/infographs-59b6", "githubLinks": ["https://github.com/rgdevelopings/Infographs", "https://infographs.herokuapp.com/", "https://demotype.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["CSS", "JavaScript", "Machine Learning", "Nodejs", "HTML5", "Streamlit"], "longDesc": "The problem Infographs solves\nIn today’s global marketplace, the ability to communicate effectively and multi-culturally should not be underestimated. To communicate in such an environment, it’s important for professionals to act culturally intelligent which can be done when the professional develop cross-cultural communication skills. We at Infographs work with individuals from a wide range of diverse backgrounds and cultures.\nCompanies across most sectors and industries aspire towards facilitating decision-making, driving innovation, reducing costs and improving quality. Today companies can achieve these objectives by harnessing the power of analytics, which has greatly evolved due to the explosive growth of business data and technological advancements. We pledge to deliver the impossible. Having responsibility and commitment to the preservation of corporate data is of utmost importance to the people at Infographs. Infographs as an organization understands that when a customer undergoes leakage of information, the consequences can be very serious. Infographs make sure that while providing services to our customers we respect their data integrity."}, {"idNo": 18, "name": "Feel Cart", "desc": "The closest thing to real shopping", "devfolioLink": "https://devfolio.co/submissions/feel-cart-c3f4", "githubLinks": ["https://github.com/Anirudh-sk/vihaan.git"], "special_mention": " ", "stacksUsed": ["Firebase", "Flask", "Material-UI", "React.js", "Aframe", "Commerce Js"], "longDesc": "The problem Feel Cart solves\nAn integrated platform enhanced with Virtual Reality technology providing a 360-degree view of the store. This software can be implemented on the base application directly as a compatible add-on to enhance the customer experience. The user can toggle between the regular online platform and the virtual platform to experience the lively shopping vibes sitting right under their roof.\nThis pandemic situation has rapidly increased home shopping around the globe. Though home shopping is a better alternative yet it cannot be compared with the live experience experienced by the shopaholics during the pre-covid period. We have come up with a technology enhanced solution for this problem."}, {"idNo": 19, "name": "Help Me Learn", "desc": "By devs for devs", "devfolioLink": "https://devfolio.co/submissions/help-me-learn-f946", "githubLinks": ["https://github.com/rayan1810/Help-Me-Learn"], "special_mention": " ", "stacksUsed": ["React", "MySQL", "Socket.IO", "Tailwind CSS", "Nodejs"], "longDesc": "The problem Help Me Learn solves\nGood mentorship is hard to find in the times of Whitehat jr. We wish to solve that issue. Almost 90% of the students that pass out from colleges are clueless about what to do after their graduation and are looking for guidance. While on the other hand there are people, working professionals who want to give back to the society and community. We want to bring them together on a platform where they can meet and share there ideas on the basis of there knowledge and skills."}]