[{"idNo": 0, "name": "New perspective to making notes in online lectures", "desc": "An application that allows users to generate e-notes with added functionalities of embedding video clips , generating notes based on what is being said in the video and pdf preview generation of note.", "devfolioLink": "https://devfolio.co/submissions/new-perspective-to-making-notes-in-online-lectures-d486", "githubLinks": ["https://github.com/nikita01gwl/Hack36"], "special_mention": "Consolation Prize", "stacksUsed": ["jQuery", "HTML", "Bootstrap", "CSS", "Django", "JavaScript", "Ace editor"], "longDesc": "The problem New perspective to making notes in online lectures solves\nWith Education system turning online and students being more and more involved in watching online lectures rather than attending classes physically, it has become very important to make improvements in the field of education so that it not only saves the student's time but also makes it easier for faculties who spend their precious time making notes available for students. \nWe spend our majority time making notes on our notebooks, writing them out which takes much of our time. But what if we also wanted a small clip of the lecture or we also wanted to crop a particular portion of lecture. And simultaneously wanted to note down whatever was said during the lecture.\nTo make things hassle free, we have created an interface where users can add videos of their choice. After adding videos, they can select a particular video and start watching it.It maybe a youtube video or an offline video.\nWhenever, they wish to get a small portion cut out and saved in the notes section, they can click on the timestamps and automatically a video cut out will be generated in the notes. \nSimultaneously, they can write their own notes in any font/format, insert links/images.\nAlso, they can generate text notes of whatever was said by just a click. After the notes are made, a preview of the entire notes can be obtained and downloaded into a pdf making it all pocket friendly."}, {"idNo": 1, "name": "Trinetra", "desc": "Smart E-Biometric Attendance System", "devfolioLink": "https://devfolio.co/submissions/trinetra-b52c", "githubLinks": ["https://github.com/adarsh1405/Trinetra", "https://www.iwd326.com/", "https://docs.google.com/presentation/d/1ymKfFeqjGNHqtzixWw0BrP_W1vr03ZP4cD3xsWuo2fY/view"], "special_mention": "MLH: Best Domain Name Registered", "stacksUsed": ["Flask", "Python", "Flutter", "MongoDB", "GeoJSON"], "longDesc": "The problem Trinetra solves\nWe will create an app which will be installed in every employee's mobile phone and with it they can give the attendance from their mobile phones which also covers all the loopholes from the current attendance system and keeps pandemic rules in mind."}, {"idNo": 2, "name": "web app name- CBS", "desc": "“Contactless” is the new comfort: How touchless technology keeps restaurant brands connected to customers. CBS provides this technology for the safety of both Customers and Staff.", "devfolioLink": "https://devfolio.co/submissions/web-app-name-cbs-c714", "githubLinks": ["https://github.com/gauravk268/Hack36_CodeBrigade", "https://code-brigade.co/", "https://bit.ly/h36cbs"], "special_mention": "MLH: Best Domain Name Registered", "stacksUsed": ["HTML", "Bootstrap", "Firebase", "CSS", "JavaScript", "MongoDB", "Nodejs", "React js", ""], "longDesc": "The problem web app name- CBS solves\nIt provides Contactless food services at the restaurant.User scans the Qr code on his Table ,through table number and order details is passed to the staff. The food is delivered to the user by convoybelt / AI robots(future scoop),within agiven period of time,int the meantime user can play the games provided by the app."}, {"idNo": 3, "name": "Smart Garage System", "desc": "A garage door system that is equally smart, protective and intelligent at the same time.", "devfolioLink": "https://devfolio.co/submissions/smart-garage-system-5409", "githubLinks": ["https://github.com/Ayanghosh-agno/Smart_GarageSystem"], "special_mention": "MLH: Best Hardware Hack", "stacksUsed": ["Flask", "Internet of Things (IoT)", "Node-RED", "NVIDIA Jetson Nano", "Tesseract OCR", "MIT App Inventor", "IBM Cloud", "AI/ML", "Face Recognition"], "longDesc": "The problem Smart Garage System solves\nNowadays, Garage security is very vulnerable given the amount of theft activity that has gotten an increment over the last couple of years. Through this Smart IOT Garage Door System, we will mitigate a lot of risks and effort that a person has to go through while trying to get his/her car in or out. The Smart Garage system can automatically open the Garage door by facial recognition and number plate reading. Our system consists of an app which has been made with MIT App Inventory and through which manually, the Garage door can be opened and closed and also, we can control the lighting system of the Garage. Another feature is also included in this app with which we can see the last image of the person whose was face was registered during the opening of the app. Also, when the smart garage system is activated, a unique link is generated every time with which we can see the live feed of the garage front through the camera and also through any CCTV cameras if connected."}, {"idNo": 4, "name": "IoT Enabled Low-Cost SPO2 and Heart Rate Monitor", "desc": "AR-powered, IoT Enabled Low-Cost SPO2 and Heart Rate Monitoring System For Quarantine Covid19 Patients", "devfolioLink": "https://devfolio.co/submissions/iot-enabled-lowcost-spo-and-heart-rate-monitor-96f2", "githubLinks": ["https://github.com/shaurya0406/Team-Aiders-Hack36", "https://docs.google.com/presentation/d/1tdAvPK-dhDEVtQhLQQsuP0pV33FhE2qE35_r8JYEVwc/edit?usp=sharing"], "special_mention": "MLH: Best Hardware Hack", "stacksUsed": ["ARCore", "Android Studio", "Internet of Things (IoT)", "NodeMCU", "Arduino IDE", "Kotlin", "SceneForm", "MAX30100 Oximeter"], "longDesc": "The problem IoT Enabled Low-Cost SPO2 and Heart Rate Monitor solves\nIntroduction:\nHome/Institutional quarantine Covid19 patients face many problems regarding their critical health parameter monitoring due to the very contagious nature of the virus and miss timely assistance in case of emergency.\nDue to the Highly infectious nature of the Covid19 virus, visiting patients is restricted, and doctors/ family members are not aware of the present condition of patients.\nThe virus mainly infects the Lungs and the patient becomes breathless.\nOur product not only monitors the SPO2 and heart rate of the patient; real-time data can be viewed by doctors and family members using IoT cloud/ Mobile app.\nSolution:\nThe Device will continuously monitor the heart rate and SPO2 of the patient. It will measure and display the heart rate of the patient regularly.\nIoT Enabled features of the device will help in remote monitoring of the patient.\nReal-time data and previous values can be viewed/ monitored through IoT cloud or Mobile App. Our mobile app has features like connecting the patient to the nearest available doctors with Its SOS calling and messaging features, further its AR and entertainment features are added keeping in mind that the quarantined patients don't feel bored and isolated. \nMonitoring patient’s health remotely by collecting patient’s data continuously can help preventive care and doctors can also diagnose acute complications earlier with the Internet of things this can be done by employing sensors to collect patients physiological information send them to the cloud to analyze and store the information and forward the analysis to caregivers.\nThe best part is that the product's cost is less than ₹ 1k and the cost could be reduced down even further with mass production."}, {"idNo": 5, "name": "OmniBliss", "desc": "A step towards Bliss", "devfolioLink": "https://devfolio.co/submissions/omnibliss-147d", "githubLinks": ["https://github.com/pirateksh/OmniBliss"], "special_mention": "MLH: Best Hardware Hack", "stacksUsed": ["Django", "Machine Learning", "Internet of Things (IoT)", "Dart", "Git", "Flutter", "GitHub", "Bluetooth Module", "Django rest framework"], "longDesc": "The problem OmniBliss solves\nSurvey (By kff.org)\nDuring the pandemic, about 4 in 10 adults in the U.S. have reported symptoms of anxiety or depressive disorder.\nThis number increased from one in ten adults who reported these symptoms from January to June 2019.\nSimilar is the case with citizens of other countries as well.\nDevising a way to tackle these increasing levels of stress and anxiety among the general population and create an environment of Bliss."}, {"idNo": 6, "name": "Healthzone", "desc": "Stay fit mentally and physically with us !", "devfolioLink": "https://devfolio.co/submissions/healthzone-d5a9", "githubLinks": ["https://health-zone.herokuapp.com/", "https://github.com/Ashu-strange/Healthzone", "https://drive.google.com/file/d/1ArtZddqa8gsG6oK9CQqPJB4tLLPdEjgK/view?usp=sharing"], "special_mention": "EchoAR: Best AR-VR Hacks", "stacksUsed": ["PHP", "JavaScript", "MySQL", "Spotify API", "Twilio", "HTML/CSS", "echoAR", "Face Recognition"], "longDesc": "The problem Healthzone solves\nIn a digital world affected by COVID-19, digital diagnosis and fitness both mental and physical is more necessary than ever. The pandemic has caused an influx in hospital cases, and the limitations on hospital beds have people wondering whether their symptoms are severe enough to warrant a doctor's appointment. Meanwhile, others experience ailments but are unable to afford a visit to the doctor due to a lack of or poor health care. We are in alarming need of free and practical digital healthcare for keeping in touch with our medical needs. More than 2 in 5 people globally reported symptoms of depression and anxiety during the pandemic. As students, we have realized that a lot of our time is spent in front of a laptop and first-hand watched our mental health deteriorate during the pandemic. Even that’s why having an application like Healthzone is so important!\nHealthzone is a webapp that allows users to regularly check up on their physical and mental well-being without needing to visit a doctor unless needed and enjoy AR/VR fitness demos."}, {"idNo": 7, "name": "Track-Iconic Mr Fever Tracker By The Unacceptable", "desc": "A Virtual World of Live Track.", "devfolioLink": "https://devfolio.co/submissions/trackiconic-mr-fever-tracker-by-the-unacceptable-4c8a", "githubLinks": ["https://github.com/abhinavmaharana/Hack36-The-Unacceptable", "https://trackiconic.netlify.app/", "https://trackiconic.xyz/", "https://docs.google.com/presentation/d/1wfJ0a5UD7E1jujWZ0pBeUzWIbmW6LD4Sr9qumC2qpN8/edit#slide=id.p1"], "special_mention": "1st Runner Up", "stacksUsed": ["Bootstrap", "Firebase", "JavaScript", "Internet of Things (IoT)", "Arduino IDE", "IFTTT", "ThingSpeak", "echoAR", "CSS3", "HTML5"], "longDesc": "The problem Track-Iconic Mr Fever Tracker By The Unacceptable solves\nAs we know that number of cases in this Coronavirus Pandemic is around 135 million patient in record till now, but the amazing fact is that according to the data of 2020 by WHO it says there are around 10 million professional medical physicians in world which shows the ratio of 13.5:1\nSo to address this problem our team came up with Mr Fever Tracker. The Hope of the doctors and patient, as it gives body temperature and humidity on a time basis and if any emergency happens the doctors get to know about it with the help of the cloud.\nAs we know in covid regular check of temperature and humidity is necessary As it is very inconvenient for doctors or nurse to keep check of it in very 2 hrs and it even increases the chances of getting infected so we made a device which monitors real-time temperature and humidity of the patient so that doctor can access that from anywhere. We have also set a limit if the temperature goes beyond that limit then the doctor will receive mail, phone call and message as an alert."}, {"idNo": 8, "name": "Behave", "desc": "Bridging the gap between students and teachers", "devfolioLink": "https://devfolio.co/submissions/behave-e63c", "githubLinks": ["https://github.com/shank03/Behave"], "special_mention": "Best Freshers Team", "stacksUsed": ["TensorFlow", "OpenCV", "Machine Learning", "Nodejs"], "longDesc": "The problem Behave solves\nTeachers can now get honest feedback of their class and see whether the students enjoyed the lecture. This will help teachers to identify the not very active students of the class."}, {"idNo": 9, "name": "S.H.I.E.L.D", "desc": "Live life on your terms while protecting yourself from threats by staying connected at all times.", "devfolioLink": "https://devfolio.co/submissions/shield-c4c6", "githubLinks": ["https://github.com/Shamoyeeta/Hack36_21", "https://docs.google.com/presentation/d/1UMdZ6SxrQ0tRU7JlBziCLjXB3vojTn4VcGTq-JBiZ7M/edit?usp=sharing"], "special_mention": "Best All Girls Team: Cisco thingQbator", "stacksUsed": ["Firebase", "Android Studio", "Dart", "Flutter", "Firestore", "GeoJSON", "Firebase Authentication", "Agora API"], "longDesc": "The problem S.H.I.E.L.D solves\nSHIELD is a Flutter app to help people, especially women, feel less uneasy and ensure their safety in any situation where they may feel threatened. \nOur app provides features such as live location sharing, pre-recorded one-sided video calls, chats with our closest ones and emergency contacts, and video-conferencing channels with people from around the world. \nThe video features serve the purpose of not only bringing the user comfort but also letting others around you know that you are not alone and there are people who are aware of your whereabouts/location.\nVideo Conferencing Rooms\nFor the video-conferencing rooms, we used Agora API to create 6 different channels, any one of which can be joined by the user in times of need. There is also a feature to mute their microphones and switch their camera, as and when required. These rooms can provide comfort and protection in case someone is traveling alone (for example, at night) and are unable to reach their emergency contacts at that time.\nPre-recorded videos\nWe have added pre-recorded videos of one-sided video call conversations. This was implemented by uploading the videos onto firebase storage and then accessing them through a download URL. The pre-recorded videos serve as an extra precautionary measure for the user, in case no one is available to contact them at the time.\nLive location tracking and group chat\nLive location can be shared with multiple users using the group chat feature. \nWe believe that this app will provide protection and comfort to all those who might feel threatened or unsafe in any scenario."}, {"idNo": 10, "name": "NOQue-X", "desc": "An effective solution for better digital classrooms!", "devfolioLink": "https://devfolio.co/submissions/noquex-871e", "githubLinks": ["https://github.com/C2OO13/NOQue-X", "https://docs.google.com/presentation/d/1H7r74Y8QK3lOkbIKFTp_GUN-KyRN8xbEFrCgHMoxCew/edit?usp=sharing"], "special_mention": "2nd Runner Up", "stacksUsed": ["jQuery", "Ant Design", "Node.js", "Socket.IO", "Express.js", "MongoDB", "React.js", "Chrome Extension"], "longDesc": "The problem NOQue-X solves\nOnline classes call for a greater amount motivation and self-discipline than a classroom-based course. Students can easily shift away from ongoing classes and waste their time. An offline classroom has one or more instructors and peers, who can hold a student accountable for their course-work, however in online classes teachers don't get a proper feedback and can't keep a check on student's learning and understanding. Online classes have just become a boring non-interactive class for teachers Generally students open the class meeting and do something else like watching youtube, facebook, etc or they keep the class meet open or go away somewhere else.\nSo how do we make online classes better and effective? That's where our NOQUE-X comes in."}, {"idNo": 11, "name": "Byakugan", "desc": "Byakugan app is mainly concerned with women's safety. It has quick alerts to concerned on listening to \"HELP\" and if the phone goes out of radar it also helps in finding out the safest path (network).", "devfolioLink": "https://devfolio.co/submissions/byakugan-6844", "githubLinks": ["https://github.com/rdx-rockstar/Byakugan"], "special_mention": "2nd Runner Up", "stacksUsed": ["Firebase", "Android", "Flutter", "google maps", "Nodejs", "mongo db"], "longDesc": "The problem Byakugan solves\nWith the growing cases of molestation and rapes, it’s high time for us to come with a solution that empowers them. We surely have many apps that help women through their ides providing the most of the required information on an emergency on the tips of the fingers. But the victim is unable to react or to use them due to sudden attacks and what if the attacker's first step was to break down the mobile. So here we are to come up with the solution for all such cases trying to cover up almost all of them. Go through the readme of Github for all the features we implemented."}, {"idNo": 12, "name": "Centauras", "desc": "Centauras is a google meet bot to make online classroom learning more effective for students.", "devfolioLink": "https://devfolio.co/submissions/centauras-4110", "githubLinks": ["https://github.com/The-Mavericks/Centauras-Bot", "https://drive.google.com/file/d/1RlJFHIWD_XAqYaEz2VY35-n_kUELCF7M/view?usp=sharing"], "special_mention": "Winner", "stacksUsed": ["Machine Learning", "Selenium", "Python", "Jupyter Notebook", "Speechly API", "Google Speech Api", "IBM Watson Speech to Text"], "longDesc": "The problem Centauras solves\nAllowing students to focus in class rather than taking notes by providing generated smart notes based on the lecture which includes the lecture summary as well as pictures of the slides which contain information.\nNotifying when your name is called in class so you don’t miss out on anything important.\nAlerting if abusive language was used during the meeting.\nAiding to make searching up information from the summary easier using speech to search."}, {"idNo": 13, "name": "Privily", "desc": "Your handy anti-snooping, pro privacy, browser extension to save you from everyone peeping into your screen during important meetings.", "devfolioLink": "https://devfolio.co/submissions/privily-6c6c", "githubLinks": ["https://github.com/YashashwiniDixit/privily"], "special_mention": " ", "stacksUsed": ["HTML", "JavaScript", "Chrome Extension", "CSS3"], "longDesc": "The problem Privily solves\nThe Problem\nUpon the advent of Covid19 and a rise in Work From Home culture, and even during the pre-pandemic times where the video calls are very frequent and sensitive organisation data is shared among the folks, its risky in situations where people keep looking into your screen when you are attending the meeting / chat in let's say, a metro / hostel / crowded cafe etc. Not only risky, the peeping tom behaviour is a major cause of irritation among working class who like to travel and work / work in a cafe / someone who simply doesn't have the priviledge of privacy yet. So what to do for these?\nExisting solutions\nThis calls for a easy but viable solution to counter all these peeping toms. Some are already in the market like a 2500 INR Filter Screen, or locking your screen everytime someone looks at your laptop, or asking them to shoo away and handling awkward questions like \"What is it that you are doing that you have to hide it?\"\nOur Solution\nThese solutions are not really the best ones, so why not identify certain points of senstivity in the webapps (like gmeet, zoom and slack, which we have handled specifically in this project) and simply blur them! To reveal / unblur them, all you need to do is hover over it. To keep the solution as accessible and compact, we chose a browser extension - Privily ( which is of size < 1 MB )\nTo make the accessibility even quicker, all you need to do is use \"Alt + X\" as the hotkey to toggle this extension On / Off to keep your privacy secure quickly.\nHow it works?\nWe blur the sensitive areas on toggle using custom CSS and DOM manipulation, which is initiated on onCheck listeners attached to the popup.\nFinal Aim\nOur aim is to make this solution more accessible to everyone, for that we can't really make a custom tab for each webapp in our extension.\nSo, our final aim is to allow the user to mark the specifc areas of the web page as sensitive areas and toggle blurring / unblurring them as required."}, {"idNo": 14, "name": "EduAR", "desc": "Learn the concepts with Augmented Reality", "devfolioLink": "https://devfolio.co/submissions/eduar-50a1", "githubLinks": ["https://github.com/hiranmayee1123/EduAR"], "special_mention": " ", "stacksUsed": ["PHP", "HTML", "Bootstrap", "CSS", "JavaScript", "echoAR"], "longDesc": "The problem EduAR solves\nEnabling students to visualize concepts through real-time models"}, {"idNo": 15, "name": "Quinfo", "desc": "It is an application to test knowledge and spread awareness about covid 19 pandemic.", "devfolioLink": "https://devfolio.co/submissions/quinfo-a662", "githubLinks": ["https://github.com/utkrisht5/Quinfo"], "special_mention": " ", "stacksUsed": ["Android st"], "longDesc": "The problem Quinfo solves\nIt is a quiz app in which questions are based upon the information about the covid 19 pandemic. People can use it to check how much they are aware of the present situation and how they can protect themselves in this pandemic condition."}, {"idNo": 16, "name": "Hypertext Assassins", "desc": "Imagine as boundless as space. Our goal isn’t to build a website. Our main goal is to create awareness and make your mundane life an exuberant one.", "devfolioLink": "https://devfolio.co/submissions/hypertext-assassins-3ac9", "githubLinks": ["https://github.com/silkie261001/Pradhanmantri-Manoranjan-Yojna"], "special_mention": " ", "stacksUsed": ["JavaScript", "HTML5", "CSS3"], "longDesc": "The problem Hypertext Assassins solves\nTeam Hypertext Assassins' main motto is to present a platform to the audience to enjoy and get knowledge regarding COVID-19. So, we made a website that focuses on every aspect like entertainment, vaccine registration form, awareness through SOP's, COVID-19 cases tracker across the world.\nThe main problem that people face nowadays is a lack of awareness. To make people aware, we have added a dedicated column containing Dos and Don'ts in this pandemic.\nA dilemma faced by school or college students is a lack of physical interaction that leads to boredom. We have added the Entertainment column that includes novels, movies, web series, and songs to overcome this. One can easily listen to their favourite songs and stream movies to avoid boredom.\nAs the government has started vaccinating ordinary people, we have also added a COVID-19 vaccine registration form. We can schedule our vaccination by providing a date and time. This form is simple but creative. So, register for the immunisation and get yourself vaccinated as soon as possible.\nWe have added a COVID-19 cases tracker, which keeps you updated about the surge in the number of cases across the globe. This tracker tells us the total number of cases, deaths and recovered patients.\nOverall this website solves a variety of problems that we are facing in this pandemic."}, {"idNo": 17, "name": "AskHere App", "desc": "Ask, Answer and Gain Knowledge", "devfolioLink": "https://devfolio.co/submissions/askhere-app-984d", "githubLinks": ["https://github.com/Shivakumar137/AskHere"], "special_mention": " ", "stacksUsed": ["Firebase", "Android Studio", "Dart", "Flutter", "GitHub", "Firestore", "Firebase Authentication"], "longDesc": "The problem AskHere App solves\nMany of us get many doubts and come across various problems while learning new technologies, while making projects, and we get many small and silly doubts in our day-to-day life. There are many platforms across the interent for asking questions and seeking answers but we are not guarented that we get answer soon. It might take days and sometimes weeks to get an answer you are looking for. We came up with a better solution for that. In our app AskHere, its almost the same like the resources existing now, but with an enhancement. In AskHere, you get some 'coins' initially which can be treated like virtual currency for the app. To ask a question in AskHere, you need to use some of your coins and these coins will be rewarded to the one with best and quick answer. The more coins you assign to the question, the more likely everyone will be interested in answering your question which makes it easier to get an answer quickly. One can earn coins from answering the questions, from weekly rewards for active participation and completion of some challenges. And one more important feature is anonymity. Your identity wont be revealed unless you want it to be."}, {"idNo": 18, "name": "WeScribe", "desc": "Collaborative notes writing and sharing while attending live lectures.", "devfolioLink": "https://devfolio.co/submissions/wescribe-96cb", "githubLinks": ["https://the-thunderbirds.github.io/WeScribe_Frontend/", "https://iiitborg-my.sharepoint.com/:p:/g/personal/divyam_agrawal_iiitb_org/Eck72DJQ6NFHrs9Z308TweQBiQZ23e08cm3-1SjuMpv0Yg?e=mJFYDU", "https://github.com/The-Thunderbirds/WeScribe"], "special_mention": " ", "stacksUsed": ["Firebase", "Django", "reactjs", "Django rest framework", "discord.py"], "longDesc": "The problem WeScribe solves\nOnline learning has seen a major boom and we have tons of platforms for online teaching but there aren’t many online platforms that allow us to collaborate whilst attending a lecture or watching an educational video.\nSo we came up with a solution ...\nWeScribe allows students to make notes with their friends while attending a live lecture or watching a youtube video without having to open multiple apps. It also saves respective notes of each student for their reference. Sharing the collaborative board link is as simple as clicking a button and sending the link to your peers.\nAlso the WeScribe discord bot incentivizes students to share their learnings and keeps engaged with other students using XP and levels when each student contributes or likes or dislikes the content shared by others. It also enhances the togetherness by sending scheduled lecture notifications, content shared by others, allowing to assign suitable tags to the shared content for easy reference, sharing the WeScribe notes, notifying people about some friendly scheduled live lectures by other other peers and many more. This helps them to keep motivated."}, {"idNo": 19, "name": "Asistan", "desc": "A web app to minimize the spread of COVID – 19 around us .", "devfolioLink": "https://devfolio.co/submissions/asistan-7d09", "githubLinks": ["https://github.com/Delta-Force-36/asistan-hack36"], "special_mention": " ", "stacksUsed": ["Django", "Python"], "longDesc": "The problem Asistan solves\nKeeping in mind the safety of citizens against covid – 19 . we are here with our version of covid Assist web application which is customized to notify all the users about the spread of covid – 19 ."}]