[{"idNo": 0, "name": "CoVax", "desc": "One stop destination for all your COVID problems :)", "devfolioLink": "https://devfolio.co/submissions/covax-0920", "githubLinks": ["https://github.com/gauravraj0510/CoVax-JAAR", "https://youtu.be/vs5sfYPL5Dc"], "special_mention": " ", "stacksUsed": ["Django", "JavaScript", "Python", "Django rest framework", "CSS3", "HTML5"], "longDesc": "The problem CoVax solves\nDue to the COVID situation there was a shortage of beds in many parts of the country.\nWe tried to build a web application that keeps the live track of the number of beds available in the particular hospital so that the patients do not face issues in locating the free beds in the hospital and there is less crowd gathering at the hospitals.\nAlso we tried to show all the centres where COVID vaccine is available in the particular state.\nWe tried to create live news feed which scrapes websites for up to date news about COVID."}, {"idNo": 1, "name": "Pictionary.ai", "desc": "AI that can identify what picture you're drawing", "devfolioLink": "https://devfolio.co/submissions/pictionaryai-ffe7", "githubLinks": ["https://github.com/SockAndSandal/KJSCEHack", "https://team73kjscehack.herokuapp.com/", "https://github.com/SockAndSandal/Pictionary-ai-backend"], "special_mention": " ", "stacksUsed": ["Flask", "TensorFlow", "Keras", "Heroku", "p5.js", "Python", "React.js"], "longDesc": "The problem Pictionary.ai solves\nPictionary.ai can be used for identifying hand-drawn objects and displaying them to the user"}, {"idNo": 2, "name": "Psycare", "desc": "Mental Health Matters..", "devfolioLink": "https://devfolio.co/submissions/psycare-38ed", "githubLinks": ["https://docs.google.com/presentation/d/1cI55f5yF3ANYrR4VXHJq3iQxK29uOHuYcVQgePktO7Y/edit?usp=sharing", "https://github.com/hyp9820/Bot_Army"], "special_mention": " ", "stacksUsed": ["Firebase", "Flutter"], "longDesc": "The problem Psycare solves\nPsycare is an application system that is focused on mental health treatment. The system houses two applications which are for the doctor and patient end."}, {"idNo": 3, "name": "Edumate- Student Mangaer", "desc": "Managing and accessing the student data.", "devfolioLink": "https://devfolio.co/submissions/edumate-student-mangaer-ecda", "githubLinks": ["https://github.com/AmanKhakharia"], "special_mention": " ", "stacksUsed": ["MySQL", "Python", "phpMyAdmin"], "longDesc": "The problem Edumate- Student Mangaer solves\nStudent data Manager using python, Php and MySQL"}, {"idNo": 4, "name": "Focus Buddy", "desc": "The perfect friend to help you focus on your work!", "devfolioLink": "https://devfolio.co/submissions/focus-buddy-bc6d", "githubLinks": ["https://github.com/Shreyans-01/FocusBuddy"], "special_mention": " ", "stacksUsed": ["HTML", "JavaScript"], "longDesc": "The problem Focus Buddy solves\nSpending hours and hours working on a computer is bound to stress out anyone. Taking a break is essential for maximizing efficiency and having a fresh perspective of the task at hand. Even though this not uncommon knowledge, people often neglect the importance of taking a break and thus, need a gentle reminder to do so and relieve their stress. And what better way there is"}, {"idNo": 5, "name": "Helping Minds", "desc": "No matter what's troubling you, get the support you need, right here, right now.", "devfolioLink": "https://devfolio.co/submissions/helping-minds-b553", "githubLinks": ["https://github.com/Vedant13-ux/KJSCE-Hack"], "special_mention": " ", "stacksUsed": ["MERN stack"], "longDesc": "The problem Helping Minds solves\nWe would have noticed that in our respective colleges, Learning Institutes, or at a similar type of place, some people get bullied, but many of them are not that strong enough to handle those situations, it may be due to their introverted nature, lack of confidence, etc. It affects the healthy life cycle of that person. So, here's where Helping Minds steps in. Helping Minds focuses on providing a one-to-one basis counseling service, where people can talk to our Experts regarding any mental health-related issues like stress, Bullying, anxiety, etc. while maintaining the complete privacy of the user. And they can book appointments with our Experts, whenever they feel convenient. And this is how Helping Minds helps people to improve their Quality of Life and focus on their goals."}, {"idNo": 6, "name": "Pratibha HealthCare Web Application", "desc": "Pratibha is a solution concept revolving around the women who fight one on one with various problems, one of these is Polycystic ovary syndrome (PCOS), that needs our utmost attention to raise voices.", "devfolioLink": "https://devfolio.co/submissions/pratibha-healthcare-web-application-1d9a", "githubLinks": ["https://github.com/vaibhavpathak999/Pratibha-PCOS-Application"], "special_mention": " ", "stacksUsed": ["HTML", "Bootstrap", "CSS", "JavaScript", "Embedded Javascript (EJS)", "Machine Learning", "Python", "Dialogflow", "MongoDB", "Nodejs"], "longDesc": "The problem Pratibha HealthCare Web Application solves\nPolycystic Ovarian Syndrome (PCOS) is very common, but it remains undiagnosed and unmanaged among most people. WHO estimates that PCOS has affected 116 million women worldwide in past years. These numbers are alarming & increasing day by day. Pratibha is a Healthcare Web Application to spread awareness about PCOS among women & provide a Community platform to interact with other women having PCOS.\n1 This Web Application will provide a Self Test Analyser based on Machine Learning which takes the information and other steps are mentioned for PCOS Confirmation. \n2 It also contains a ChatBot integrated using DialogFlow Google APl. The women can resolve their general queries regarding PCOS.\n3 Every woman & doctor will have to register through Google Account. Patients will be directed to a personalized dashboard where the records of prescribed medicines, problems she is facing, lab reports & details of the last meeting with the doctors. The women can book the appointments online & can have meetings with the doctor via Video Calling from the dashboard. The doctors can enter his qualification details, hospital, working hours. \n4 The doctors also have to register through Google Account. The doctors can enter his qualification details, hospital, working hours. The doctor’s dashboard contains the list of all the patients where they can prescribe them the medicines timely.\n5 The app also contains a Community Building forum for connecting to other women and doctors in different parts of the World so that they can share their problems and help each other with the best exercises and eating habits.\n6 A separate Food & Yoga is present to follow the healthy habits for curing PCOS. Since there is no complete cure and medicine for PCOS, so Food and Yoga are something that will help PCOS women.\nSo the App spreads awareness, improves health standards, promotes diversity & increases the self-esteem of the women who can feel much happier and independent with such an interactive portal."}, {"idNo": 7, "name": "Ajnabee", "desc": "Meet people in a revolutionary way.", "devfolioLink": "https://devfolio.co/submissions/ajnabee-c37e", "githubLinks": ["https://github.com/Hungry-Hippoos/Ajnabee", "https://github.com/Hungry-Hippoos/Ajnabee-mobile"], "special_mention": " ", "stacksUsed": ["PyTorch", "Machine Learning", "SQL", "Python", "Flutter", "Natural language processing (NLP)", "Firestore", "Firebase Authentication", "RestAPIs", "Django rest framework"], "longDesc": "The problem Ajnabee solves\nSince meeting people virtuallly is the new trend, which limits the socializing of the \"social animal\". There are various apps that help people socialize, but most of them tend to connect people on the basis of material/physical information given by the user, thus making people uncomfortable with themselevs as they are being judged on their basis of looks. Our product recommends users to like minded people on the basis of a pysch evaluation test.\nSince everything becomes online, they cant tell how the conversation is going, especially for the introverted people. Thus we have added a feature that will check the chats keeping the ideantity anonymous and will evaluate them and will let the user know how the conversation is going."}, {"idNo": 8, "name": "EaseMyBill", "desc": "Ease your bills without spending a cent.", "devfolioLink": "https://devfolio.co/submissions/easemybill-60f8", "githubLinks": ["https://github.com/Sparsh1101/EaseMyBill.git"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "MongoDB", "mongoose", "Nodejs", "ejs", ""], "longDesc": "The problem EaseMyBill solves\nAt present, small scale service providers and local vendors face difficulties in maintaining an invoice history, generating bills and keeping track of the inventory.\nHiring employees for the above mentioned tasks leads to additional costs which is not affordable by most of the small-scale services.\nIn today’s age of digitalization, where E-commerce is gaining popularity exponentially, a shift to an online platform will prove to be extremely beneficial for local vendors as it would help them compete with the existing market.\nWe have attempted to make a website that performs the following tasks:\nAdd/deletes/edits products and keeps a track of stocks in the inventory-This will help the shopkeeper to keep a track of the inventory easily and cut on labour cost.\nGenerates bills,sends pdfs and mail notifications of the bills to the customer.-This will help dematerialise the system and ensure hassle-free bills.\nMaintains a log of bills-This will help the user monitor his business activities, increase profit margins and keep a track of payments."}, {"idNo": 9, "name": "Graphle", "desc": "A visual learning tool to make learning easy for autistic students", "devfolioLink": "https://devfolio.co/submissions/graphle-e17a", "githubLinks": ["https://graphle.ml/", "https://github.com/shivamanand1/Graphle"], "special_mention": " ", "stacksUsed": ["HTML", "Node.js", "CSS", "JavaScript", "Android Studio", "WebSockets", "Docker", "MongoDB", "Google Cloud Platform (GCP)", "Pusher"], "longDesc": "The problem Graphle solves\nGraphle is a service build to make learning easy for autistic students. It takes in real-time input from the teacher and arranges it in a visual manner\nAutistic kids often receive education in a special way where concepts are delivered in a graphical way. Research says that visual memory is 60,000x faster than text/auditory memory. Inspired by graphical learning we created Graphle, a very effective visual learning tool for strengthening the visual memory of our students.\nWith the use of cutting-edge technology, Graphle can be of great use in remote education, where teachers can take their classroom boards to their students and allow Graphle to simplify concepts for them."}, {"idNo": 10, "name": "GOATmemes", "desc": "Your Daily Dose of memes", "devfolioLink": "https://devfolio.co/submissions/goatmemes-067c", "githubLinks": ["https://github.com/apurbadh/GOATmemes"], "special_mention": " ", "stacksUsed": ["Django", "JavaScript", "HTML5", "Python", "CSS3", "SQLite."], "longDesc": "The problem GOATmemes solves\nGOATmemes is the platform to connect people through memes. Due to their obvious popularity, and seeming permanence, memes are now a subject studied at a social level. The way they influence thought, are influenced by current events and popular culture, shape speech, and entertain mass audiences has proved that memes have a significant societal impact, especially among the lives and culture of the young.These memes also create a new place for advertisers to generate interest in their products, giving memes yet another reason to stick around in the future."}, {"idNo": 11, "name": "FoodZone", "desc": "An application for Ordering Food Online", "devfolioLink": "https://devfolio.co/submissions/foodzone-9202", "githubLinks": ["https://github.com/Niha-21/The_Food_App.git"], "special_mention": " ", "stacksUsed": ["Firebase", "Flutter", "Dart Programming Language"], "longDesc": "The problem FoodZone solves\nPeople can use the prototype for ordering food from any place and it supports a decent feasible UI"}, {"idNo": 12, "name": "Disease Detection and hospital suggestion", "desc": "Detect speciality of the doctor who can treat that disease", "devfolioLink": "https://devfolio.co/submissions/disease-detection-and-hospital-suggestion-54ae", "githubLinks": ["https://github.com/yrd123/Companion.git"], "special_mention": " ", "stacksUsed": ["Django", "Python", "ML Classifier"], "longDesc": "The problem Disease Detection and hospital suggestion solves\nIt solves the problem that most of the time we don't understand which speciality to go for"}, {"idNo": 13, "name": "Pollify", "desc": "Get an Honest Opinion.", "devfolioLink": "https://devfolio.co/submissions/pollify-41e9", "githubLinks": ["https://github.com/kashish1211/Pollify"], "special_mention": " ", "stacksUsed": ["Bootstrap", "Django", "HTML/CSS"], "longDesc": "The problem Pollify solves\nwhenever in confusion, poll give you an honest opinion with majority."}, {"idNo": 14, "name": "RAKSHA (Panic Button Android App)", "desc": "Symbol Of Safety", "devfolioLink": "https://devfolio.co/submissions/raksha-panic-button-android-app-9994", "githubLinks": ["https://github.com/ArerehRaj/Panic-Button-App"], "special_mention": " ", "stacksUsed": ["Java", "Android Studio", "Google Location services", "google maps", "Parse Server"], "longDesc": "The problem RAKSHA (Panic Button Android App) solves\nNowadays, crime rates have been increasing on a daily basis. Many times, number 100 does not work as the lines are busy. A robust system which can help in locating a victim and sending immediate help is the need of the hour. Our team has made an attempt at solving this problem.\nThe panic button app mainly consists of a feature which sends a signal to the contacts from your family and friends. It also sends a signal to volunteers who have registered through the app who are located in close vicinity of the victim. In addition to this, if the red button is invoked, a distress signal will directly be sent to the nearest police station by using Maps API. \nEven if its not an emergency, but a person feels alone or unsafe in a particular area, he/she can press the yellow button which basically warns the contacts that the person is not feeling safe and the location will also be shared with them. \nFinally, a green button is implemented which will tell them that the person is currently safe and sound in his location."}, {"idNo": 15, "name": "FixYourSelf", "desc": "Never bend your head. Always hold it high. Look the world straight in the eye.", "devfolioLink": "https://devfolio.co/submissions/fixyourself-cb83", "githubLinks": ["https://github.com/VedantJolly2808/KJSCE"], "special_mention": " ", "stacksUsed": ["Flask", "SQLite", "Three.JS", "HTML/CSS"], "longDesc": "The problem FixYourSelf solves\nThe web-based application helps users by detecting them, correcting their posture by alerting them with a sound when they are slouching, leaning, or tilting their head down, as well as a printed message for correcting their posture. A dashboard tracking the user activity helps give insight into the irregular postures adapted by the user in that particular session. Features that enable user security have been implemented like login from google via OAuth2 along with an SMTP server that helps the user reset their account details and give suggestions for improving the model."}, {"idNo": 16, "name": "Solace", "desc": "Solace is a platform where covid patients can overcome social anxiety and isolation that happens during covid, people can connect chat, and vibe to songs together.", "devfolioLink": "https://devfolio.co/submissions/solace-fd16", "githubLinks": ["https://github.com/eshavats/solace", "https://github.com/absolute-nil/Solace-Backend"], "special_mention": " ", "stacksUsed": ["React", "Ant Design", "Redux", "Socket.IO", "Express.js", "MongoDB", "Nodejs"], "longDesc": "The problem Solace solves\nSolace - Covid relief website. During Covid, patients have to be in isolation and have social anxiety and distress. In that time of need, it is necessary that you maintain connection and feel at ease. This website is a place where users who are suffering/ suffered or just curious about covid can get in and publish anonymized blogs about how they are feeling and their day as a covid patient. This is a platform where people can find solace and mental peace. This platform also allows users to listen to and stream songs."}, {"idNo": 17, "name": "Ki-Shaan", "desc": "Farming looks very easy when one’s plow is a pen and are hundreds of kms away from the fields. Be respectful to “Ki-shaan”, the pride of our nation.", "devfolioLink": "https://devfolio.co/submissions/kishaan-4699", "githubLinks": ["https://github.com/Tech-Elites/Ki-Shaan"], "special_mention": " ", "stacksUsed": ["Java", "Android Studio", "XML", "Adobe XD", "Google Firebase"], "longDesc": "The problem Ki-Shaan solves\nAgriculture is one of the most important sectors necessary for the sustenance and growth of the Indian Economy. Majority of Indian Population is dependent on agriculture as the source of their livelihood. However, there are several problems faced by the farmers which are as follows:-\n● Farmers are hardly benefited from the prices they receive for their crops.Agriculture marketing is in a very bad shape in rural India. Due to absence of proper marketplaces,farmers are not able to sell their crops at a reasonable price. \n● These farmers have to depend upon local traders and middlemen who take unfair advantage over farmers due to lack of storage facilities.They buy crops at a very cheap rate from farmers and sell at a high price to the consumers.\n● Lack of good quality seeds,irrigation facilities and high production costs, leads to the farmers taking large loans and often falling into debt.\nTo eliminate the above stated problems and provide relief to the farmers, we have come up with an idea to create an app that will possibly eradicate the involvement of middlemen and local traders. \nAlthough certain apps and technologies are already present to solve these problems, our app differs from them and can be a great upgrade on them. The various unique functionalities provided by our app are as follows:-\n#Interface for the farmers:-\n● All the farmers registered in the app can put up their crops for sale with their prices and quantity available. All the crops put up by different farmers will be visible to every customer for buying the same. Through this, the individual farmers can get a reasonable price for their crops by directly selling to the customers. \n● Separate accounts for each farmer which shows the total sales for their crops.\n● A farmer can form a group or cooperative that will work collectively to sell their crops and remove any involvement of these middlemen and local traders."}, {"idNo": 18, "name": "WorkatEase", "desc": "A mini project regarding a small college management website that allows the students to register their lost and found complaints and make orders from the college canteen. It sends emails to users", "devfolioLink": "https://devfolio.co/submissions/workatease-260d", "githubLinks": ["https://github.com/alwaysaditi/University-Website-hackathon"], "special_mention": " ", "stacksUsed": ["PHP", "HTML", "Bootstrap", "Visual Studio Code", "GitHub", "CSS3"], "longDesc": "The problem WorkatEase solves\nCurrently there is no sophisticated system that allows students and teachers to avoid unneccessary queues and college canteens. So this system allows us to inform the students and tecahers when their orders are ready. Also , students have to wait for a long time if their lost thing is found so in order to avoid that we have created a system which can alert the users when their lost and found item is found by sending them a personal email. This automates the process and converts it into a web based application which is not present in many colleges currently."}, {"idNo": 19, "name": "Meep", "desc": "Meet and play", "devfolioLink": "https://devfolio.co/submissions/meep-cfea", "githubLinks": ["https://github.com/tanmayb104/hack", "https://github.com/manavnanwani/Meep-Vue", "https://www.figma.com/proto/HImtU3n6IcAwD9pE0ZbLz6/meep%3A-meet-and-play?node-id=25%3A3&scaling=contain&page-id=25%3A2", "https://youtu.be/Jfkg8nOY2dg"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JS", "Django", "Git", "Postman", "Figma", "GitHub", "Django rest framework"], "longDesc": "The problem Meep solves\nProblem:\nIt is very difficult to find players for people for online as well as offline games.\nThere are some platforms to find playmates but most are NOT FUN and NOT SAFE.\nOur solution:\nMeep is a platform to find and meet those who are interested in playing online or offline games with you.\nMEEP makes meeting and playing games easy, fun, and safe for all. You can create public GAMES where anyone can join can and private games in your LEAGUES where only your friends can join"}]