[{"idNo": 0, "name": "Tech-Care Solution", "desc": "Replace the traditional hospital doctor visiting system with a modern, digital, touch free and sophisticated application based system.", "devfolioLink": "https://devfolio.co/submissions/techcare-solution-66a9", "githubLinks": ["https://github.com/anuragporel2002/HackNU3.0"], "special_mention": " ", "stacksUsed": ["Firebase", "Tkinter", "Python"], "longDesc": "The problem Tech-Care Solution solves\nOur product will help in transforming the entire healthcare system in India from as we know it, to a much more sophisticated digital system. It is in line with the Government Of India’s efforts of digitizing the Indian economy. Our product provides various services, the most notable being the unique Health ID system, that will help in storing all the medical history of a patient and make it easily available, anytime, and anywhere. \n1. Complete medical history at a place.\n2. Touch free, paperless system.\n3. Single database.\n4. Unique patient id for every cetizen.\n5. Lesser risk of allergic reaction.\n6. Easy to keep track of medicine expenses."}, {"idNo": 1, "name": "Signlanguage Motion Transfer", "desc": "A CLI tool that lets the user map/transfer the motion of a human being communicating in sign-language in a video onto a 3d mesh and designed to be used to program motion without any manual work.", "devfolioLink": "https://devfolio.co/submissions/signlanguage-motion-transfer-2069", "githubLinks": ["https://github.com/ayankashyap/signlanguage-motion-transfer", "https://ayank.hashnode.dev/language-invariant-sign-language-framework-for-interactive-robots"], "special_mention": " ", "stacksUsed": ["PyTorch", "OpenCV", "Python", "Blender", "OpenPose", "argparse", "Pytorch3d", "SMPL-X", "OpenDR", "PyOpenGL"], "longDesc": "The problem Signlanguage Motion Transfer solves\nA highly sought after feature in cutting edge humanoid robots is ofcourse human interactivity and accessibility. Although a few robots have been designed to transmit sign language, it is a very cumbersome task since the robot movements have to be specifically programmed for each individual element in the sign language vocabulary. This tool will be used by robotics developers who work on highly interactive humanoid robots to incorporate sign language into their range of vocabulary. The generated 3d mesh along with the pose coordinates can be used to infer and program motion into their robots without having to manually program the sequence of motions. Moreover, this tool can work with any kind of video, so as long as there is video data of the sign language, the tool can work with it. Furthermore, since the tool processes any kind of video, it can also be used for other motion analysis projects."}, {"idNo": 2, "name": "HoverFLY Tech", "desc": "We develop intelligent autonomous drones that use computer vision and carry sensor payloads to execute a various functions. We are focused on inspecting/safeguarding/stopping leaks in gas pipelines", "devfolioLink": "https://devfolio.co/submissions/hoverfly-tech-2089", "githubLinks": ["https://github.com/joel-jaison/HoverFLY/", "https://www.instagram.com/hoverfly_tech/", "https://sites.google.com/st.niituniversity.in/hoverfly/home"], "special_mention": " ", "stacksUsed": ["TensorFlow", "Raspberry Pi", "OpenCV", "Python", "GitHub", "Arduino", "Sensors", "Camera", "toy drone"], "longDesc": "The problem HoverFLY Tech solves\nThe current infrastructure is extremely polluting, dangerous to the people involved, expensive and difficult to maintain. Our drone flies over the pipeline inspects the pipeline for any visual signs of degradation and leakages of gas with minimal human intervention. It also maintains perimeter security.\nApart from accessing hard-to-reach areas, navigating on its own, and regularly inspecting the infrastructure it can shut off valves or moderate them in real-time to avert any disastrous situations it is extremely cost-effective and easy to scale,"}, {"idNo": 3, "name": "SysTech", "desc": "Twoards a better future", "devfolioLink": "https://devfolio.co/submissions/systech-6dc0", "githubLinks": ["https://app.animaker.com/animo/IRfgJzdmfMvWl5d1/", "https://github.com/kvkspravallesh/SysTech"], "special_mention": " ", "stacksUsed": ["Arduino Uno", "Arduino"], "longDesc": "The problem SysTech solves\nIt ensures that a customer can save a lot time while shoppignin retail stores and shopping malls. It can greatly reduce labour cost and gurantees a smooth customer service."}, {"idNo": 4, "name": "PotWhole", "desc": "Potholes are a big problem to everyone as they not only make our drive troublesome but can lead to accidents and other issues. Our app will make it easier to track the condition of potholes.", "devfolioLink": "https://devfolio.co/submissions/potwhole-aaa1", "githubLinks": ["https://github.com/abhishek7997/PotholeProblem"], "special_mention": " ", "stacksUsed": ["Firebase", "Flutter", "GitHub"], "longDesc": "The problem PotWhole solves\nIn urban areas, potholes create problems for the public, as driving becomes dangerous due to uneven roads. The main problem is that the concerned departments are not able to coordinate to resolve the issue as there is disconnection between civil agencies, people and elected representatives.\nThe solution is an app which will act as an report or alert system which will work in a bidirectional way where the workers who are in the Municipal corporation of the city or any normal stakeholder can report of any potholes in their area.\nThis information will be stored in a database giving the people living in the area a feed of the pothole situation in their respective areas and notifications when the situation is handled and the potholes are removed by the authorities."}, {"idNo": 5, "name": "ADTech Alcohol Sensing and Engine Blocking System", "desc": "Life Matters", "devfolioLink": "https://devfolio.co/submissions/adtech-alcohol-sensing-and-engine-blocking-system-16d4", "githubLinks": ["https://github.com/RohithRao0507/AD-Tech-alcohol-detector.git", "https://antidrunkcaralertsystem.hashnode.dev/anti-drunk-car-alert-system"], "special_mention": " ", "stacksUsed": ["Arduino Uno", "Arduino IDE", "Relay Module", "battery", "We have used:", "Button", "MQ-3 Sensor", "DC Motor"], "longDesc": "The problem ADTech Alcohol Sensing and Engine Blocking System solves\nThe proposed system here is designed to minimise the occurrence of countless mishaps due to the drunken driver. Nowadays, drunk driving causes road accidents every now and then across the world. So, these activities should be required to automatically handle an implementation of smart alert system or vigilance in a vehicle which is an objective of this system. So the system we came up with is Anti Drunk Car Alert System.\nA high-sensitivity alcohol sensor is built near the steering, used in non contact mode the sensor is fixed at certain distance from the driver.Which is able to detect the presence of alcohol as he or she attempts to start driving. When the alcohol-level detected is above the pre-determined threshold, the system automatically locks the transmission, immobilizing the car.\nThereby minimizing the chances of any mishaps that can happen, this project presents a way to avoid drunk and drive accidents.\nWe made our product more efficient which means better than existing one and while components ,there are around 2-3 different featured components so selecting them and checking which one is better and which combination gives our product best is the biggest complication. Even though this solution gave us some setbacks and complications we made a product i useful needed for the car safety which is lacking throughout these years."}, {"idNo": 6, "name": "ClubHub", "desc": "The One-Stop-Shop for College Clubs", "devfolioLink": "https://devfolio.co/submissions/clubhub-9d23", "githubLinks": ["https://github.com/pranavmital/hackNU", "https://github.com/pranavmital/hackNU/blob/main/app-release.apk"], "special_mention": " ", "stacksUsed": ["Firebase", "Swift", "Dart", "Flutter"], "longDesc": "The problem ClubHub solves\nThere are a large number of clubs in universities and colleges, and students find it difficult to get to know all the clubs that can unleash their potential. This growing problem has inconvenienced a large group of students which makes them unable to access one of the most important elements contributing to the student body's holistic development. We found a solution that is viable, feasible, and user-friendly. Presenting to you, 'ClubHub' – the app for all your college club needs."}, {"idNo": 7, "name": "POCKETDOC", "desc": "Medicine Reminder Appplication", "devfolioLink": "https://devfolio.co/submissions/pocketdoc-b606", "githubLinks": ["https://github.com/Gourav-agrawal-NU/POCKETDOC", "https://pocketdoc.hashnode.dev/", "https://25102000sm.wixsite.com/website-5"], "special_mention": " ", "stacksUsed": ["JavaScript", "Android Studio", "We used Java"], "longDesc": "The problem POCKETDOC solves\nOur app will send a daily text message reminder to take the right medication at the right time and also helps in performing there various routine tasks. Our app is designed to prevent errors in hospitals and retirement homes where many pills have to be given daily to each one of the patients, each patient owning a device will not only drastically reduce the chances of errors occurring but also well optimize and speed up work for the caretakers/nurses by allowing the device to take care of pill management for them and freeing the time slot usually dedicated to that."}, {"idNo": 8, "name": "Niramay", "desc": "The current pandemic has brought upon us a situation where the act of physical touch can do more harm than some help", "devfolioLink": "https://devfolio.co/submissions/niramay-f4d7", "githubLinks": ["https://github.com/vaasu202/NIRAMAYhacknu.git", "https://niramay.hashnode.dev/niramay"], "special_mention": " ", "stacksUsed": ["Firebase", "Android Studio"], "longDesc": "The problem Niramay solves\nThe problem of buying our medicines and daily supplies without being in contact with anyone has tremendous significance in today’s time when all of us are struggling to prevent ourselves from getting affected by COVID–19. This problem stretches further for a time without any pandemic where if a student gets ill in the university and has no availability of the required medicines, then that student must rely on other people to get their needs. This on an individual level may not seem that big a problem , but on the large scale of things , it could lead to entire universities and industries shutting down and entering a state of complete lockdown."}, {"idNo": 9, "name": "Shelliry Soul", "desc": "A realistic way of vison! An advancement in e-shopping using AR", "devfolioLink": "https://devfolio.co/submissions/shelliry-soul-b471", "githubLinks": ["https://krupaladdu.wixsite.com/my-site", "https://shellirysoul.hashnode.dev/", "https://docs.google.com/presentation/d/1eEv3L5vLMCZYupdAOxSqVK5p6LVJymfQTMF1sVLCcLg/edit?usp=sharing", "https://github.com/yashwanth2546/HackNU-3.0.git"], "special_mention": " ", "stacksUsed": ["Java", "Android Studio", "SceneForm", "Google Slide", "Poly google", "Blunder"], "longDesc": "The problem Shelliry Soul solves\nHave you ever thought of the difference in buying the items online and offline? And what about the items that are too expensive / too massive which cannot be brought home for every trial but still you wanted to experience it in reality ? for example let's say: u wanted to buy some clothes on online but u dont have any feature like try that cloth on you instantly in all the app / there are some situations more recently no shopping malls/stores are allowed to trial physically due to covid and not only in this scenario, but what if u are not free to go to offline stores and buy something u want or what if that store is not really that near to you. \nAnd this is not only the problem here! In the indian retail market, currently not all shopping apps have the feature of reality experience especially in clothing, massive items like furniture , electrical appliances, jewelry, accessories and many more of type. So how can this problem be solved?\nlife isn't at the same pace as usual during the pandemic... What may the situation be...How can we take e-shopping to the next level currently in indian retail market?"}, {"idNo": 10, "name": "BeingHealthy", "desc": "An all-in-one health based mobile application for better tracking and maintenance of your health and body.", "devfolioLink": "https://devfolio.co/submissions/beinghealthy-b08d", "githubLinks": ["https://github.com/bajajvatsal/fitness-nutrition-app"], "special_mention": " ", "stacksUsed": ["Java", "Android SDK", "Flutter", "Dart Programming Language", "Gradle"], "longDesc": "The problem BeingHealthy solves\nWhat we propose is a diet and nutrition app that will take into account the daily routine, calorie consumption, workout details of the user and then provide the most efficient personalized service which will fit in all the dimensions. We built a mobile application based professional diet and workout routines generally targeting confused health & diet conscious audiences. We are planning to launch the app which can be integrated with phones of all users.\nThere are similar apps which are already there in the market solving more or less the same problem we are targetting at, they all provide personalized diets and workout plans, but the catch being that you have to pay for the services, we solved this problem by providing absolutely free plans for all the users, as of now.\nThere is a huge gap between suggested diets and implementation of these suggested diets keeping the balanced calorie calculation. And there is no option available for ordering the supplements and the ingredients of the diet being suggested from the very own app which provides authenticate products and doorstep delivery. Many times users face this issue that they have to switch the apps and services if you don't have integrated ordering service, payments and calorie management systems. Our app is designed to have an all-in-one experience, thus integrating everything ranging from the diet suggestor to the ingredients ordering of the same diet.\nLastly, since we all are living in an open world of the internet, many content creators many a times post information, photos and videos on the workouts and nutrition which is unreliable and causes serious issues if not given with proper instruction."}, {"idNo": 11, "name": "SHIELD", "desc": "protects the blind", "devfolioLink": "https://devfolio.co/submissions/shield-fb13", "githubLinks": ["https://github.com/himasai9711/VU-Project.git", "https://nikhith.hashnode.dev/shield"], "special_mention": " ", "stacksUsed": ["IFTTT", "Ultrasonic", "Sensor", "Blynk", "arduino and wifi module", "esp8266", "jumper wires", "battary", "wire", "jumper"], "longDesc": "The problem SHIELD solves\nGlobally there are almost 285 million people who are visually impaired. And in that 285million people, there are almost 39 million people who are visually impaired. Not only that, there are 82% of people who are blind, who are in the age group above 50 years.\nPeople who are blind face many problems in this world. Where ever they go, due to their disability, they face problems in movement. Even normal people refuse to help blind people as they too will be in hurry. Their disability creates problems in moving even in their own house. They may even hurt themselves while moving around. There is a white cane to identify the objects around them. But it is not much reliable as there are chances that a person can forget to take the white cane in hurry or even it sometimes causes disturbance for the person using a white cane.\nSignificance of problem: \nHead level accidents and fall accidents are non-negligible accidents. If they are associated with walking without sight they are more dangerous. In research conducted by the University of California, it is mentioned that 13% of the respondents experienced head-level accidents at least once a month; 7% experienced falls while walking at least once a month. These accidents often require medical attention. A substantial portion of respondents stated that these types of accidents changed their walking habits and reduced their confidence as independent travelers.\nSometimes it also causes problems in the surroundings of a blind person if they are not being able to navigate their way. In any way, it is the main problem for people with visual disabilities for navigation.\nThere are gadgets such as navigation bracelets that are available in the market. But their cost is relatively high. The navigation bracelet costs around 300 Usd. And there is a gadget which uses sensors but it also costs around 300Usd. And many people use a white cane to navigate around. But canes are not so reliable as t"}, {"idNo": 12, "name": "SOOTHE", "desc": "A mental wellness web app platform to connect patients, doctors, developers designing mental health psychotherapies, and volunteers to support mental health and untuck the stigma attached with it.", "devfolioLink": "https://devfolio.co/submissions/soothe-d3d6", "githubLinks": ["https://github.com/SiddheshShinde-tech/Soothe2.0", "https://soothe-8075f.web.app/"], "special_mention": " ", "stacksUsed": ["Node.js", "npm", "Firestore", "Tailwind CSS", "Firebase Authentication"], "longDesc": "The problem SOOTHE solves\nThe app aims at connecting doctors, technology, and users who seek mental health aid.\n The app helps people with social anxiety and physical limitations to come forward and lead a happy life. They can use this app to take therapies to overcome their mental depression."}, {"idNo": 13, "name": "Light up", "desc": "Using this tech we reduce the number of road accidents that occur and it provides a fastest movement of emergency vechicles to the spot", "devfolioLink": "https://devfolio.co/submissions/light-up-80d5", "githubLinks": ["https://www.youtube.com/channel/UCNf7NX5_jQ4f1Rc9drhksBQ"], "special_mention": " ", "stacksUsed": ["Android Studio", "Internet of Things (IoT)", "Li-fi"], "longDesc": "The problem Light up solves\nIndia accounts for 11 per cent of the global death in road accidents, the highest in the world, according to a report by the World Bank. The country accounts for about 4.5 lakh road crashes per annum, in which 1.5 lakh people die and more over passage of emegency vehicle becomes difficult during the night times due to heavy traffics creating a complex situation for the emergy vehicles , so the team started to search there by landing on a tech called lifi . \nSolution : A lifi transmitter is fixed in the emergency vehicles siren head and a lifi receiver is attached with the vehicle , so when ever the siren is switched on the tansmitter passes a message to the receiver there by we can making a pathway for the emergency vehicles during night time reducing night time indicating other vehicles \nComing to the road accidents , 60 % of accidents are due to the Blind spot that the driver have while driving , so a lifi Transiver is fixed in each vehicle , when ever a vehicle appear closer to another vechicle , the transiver transmits data embeded light to other transiver indicating other vehicles , so that people in other vehicle can act upon the situation , we can aso use a software application to track the vehicle using geo-location where the driver should register the vehicle number plate for his own medical emergency in case of an accident ."}, {"idNo": 14, "name": "HIRE THEM", "desc": "FOR ALL TO WORK AND EARN", "devfolioLink": "https://devfolio.co/submissions/hire-them-c8c0", "githubLinks": ["https://github.com/Vishu2410/HireThem/tree/master"], "special_mention": " ", "stacksUsed": ["JavaFX", "FXML", "Scene Builder tool", "major IDEs ( NetBeans", "and Eclipse)", "and SQL"], "longDesc": "The problem HIRE THEM solves\nWe as a team have committed to resolve the problem of the invasion and dependency over a third party for some of the very basic daily availability of helpers and workers. The problem we are looking at can be termed as “Third Party System” or “Mediator drawback”. We want to make a transparent deal and reliable communication system in which we all can share our required information to get hired by some people to earn our livelihoods directly without anybody’s self-interest.\nWe generally depend on different helpers and workers for very basic needs such as a painter, carpenter, electrician, etc. Routinely we don’t have the contacts of these helpers and workers. Hence, we depend on a third person for the same information and support. This system ensures us for the better work done or we can say the quality of the work done but on the other-hand becomes a financial impairment for the workers and helpers as they undergo a “Commission based system” under this. The person who brings the information regarding the work to the helpers charges them a particular commission for the same. When we analyse this complete scenario, we find that the helpers aren’t getting paid according to the work done, instead they lose a particular amount of money as the commission that they have to pay. Accordingly, we find that the distribution of money between the worker and the third party is unnecessary, inappropriate and undesirable. One who worked should get the complete salary/payment of the work done and for this particular challenge our team has worked for the required solution."}, {"idNo": 15, "name": "SwiftShop", "desc": "Scan What You Eye", "devfolioLink": "https://devfolio.co/submissions/swiftshop-8acd", "githubLinks": ["https://github.com/Rosy-Chadha/SwiftShop_WebApplication", "https://github.com/Aditya-jain23/SwiftShop-MobileApplication"], "special_mention": " ", "stacksUsed": ["Firebase", "Visual Studio Code", "Android Studio", "OAuth", "Flutter", "Firestore", "React.js"], "longDesc": "The problem SwiftShop solves\nThe proposed solution to the problems is shopping via scanning QR codes. When a customer in-store is interested in an item, the person can scan the respective QR code of the product while having an option of visiting multiple available stores for ticking items off their list without having to carry anything themselves, with just a tap on their smartphone screen. Once scanned, shoppers can confirm their order from the app and are then redirected to their virtual cart wherein they can make the purchase and have the option to get the items delivered on their doorstep in the most contactless and effortless manner. \nNotable Features:\n1. Product Mapping: The USP of our app is the product mapping system which offers the customers a list of available products near them in the store.\n2. Fast QR code scanning: SCAN. SHOP. BUY. making the shopping experience fun and hassle-free for the customers, helping them eliminate queue waiting time while ensuring ultimate convenience. \n3. Flexible checkout methods: We offer multiple checkout options like the standard checkout method or home delivery while taking care of security at the time of checkout, ensuring customers' affinity."}, {"idNo": 16, "name": "Pack-It-Up", "desc": "Tagline: We pack for less. Objective: To provide an Optimal Solution for food Packaging in which cost is the prime objective.", "devfolioLink": "https://devfolio.co/submissions/packitup-c986", "githubLinks": ["https://github.com/deeps21/pack_it_up", "https://pack-it-up.netlify.app/"], "special_mention": " ", "stacksUsed": ["HTML", "Firebase", "CSS", "JavaScript", "Python"], "longDesc": "The problem Pack-It-Up solves\nA software service i.e website in which the properties like chemical reactions and physical dimensions of the objects will be taken as input from the user and then select the best suitable material for that. In which the product can be sustained much longer than usual. \nAlso, the design of the product can minimize the area of packing in order to decrease the packaging cost. In this whole process, the prime objective is cost optimization. Thus it will make the packaging efficient and will bring more profits to businesses by reducing packaging costs."}, {"idNo": 17, "name": "AWflow", "desc": "Develop an application that focuses on estimating air and water turbidity using a smartphone.", "devfolioLink": "https://devfolio.co/submissions/awflow-4c99", "githubLinks": ["https://github.com/chiirag2611/Hackathon"], "special_mention": " ", "stacksUsed": ["Python", "Flutter"], "longDesc": "The problem AWflow solves\nOur problem statement was to develop an application that focuses on estimating air and water turbidity using a smartphone. Air quality estimation involves imaging of the sun by placing appropriate light-diffusing mechanisms using hardware and development of an application to process different sun geometry or controllers to estimate the atmospheric optical thickness. On the other hand, water quality is determined by finding dynamic water turbidity value and its analysis using IR turbidity sensors."}, {"idNo": 18, "name": "Move!", "desc": "AR Personalized Trainer", "devfolioLink": "https://devfolio.co/submissions/move-4935", "githubLinks": ["https://github.com/aparna-anto/Move-", "https://movefitnessapp.hashnode.dev/"], "special_mention": " ", "stacksUsed": ["Flutter", "GOOGLE ARCORE", "Google Poly", "Adobe Areo"], "longDesc": "The problem Move! solves\nI'm sure you've heard the saying, \"Sound Body, Sound Mind\". However, not a lot of people are able to maintain a sound body. There is a multitude of reasons for this, a common one being a lack of physical activity. An obvious solution to this problem would be joining a gym to work out regularly. Whatever the reason may be, the absence of physical activities can be very dangerous. For example, obesity, stroke, and diabetes.\nUsing a fitness app can tackle most of the issues one has with going to the gym. In fact, [fitness apps that help you work out from home are extremely popular nowadays.\nHowever, fitness apps might be a little insufficient due to the lack of interaction and unclear instructions. Without live interactions, one may find it difficult to stay motivated and complete the workout with resilience. \nWe are proposing a fitness app based on Augmented Reality and Virtual Reality technologies. Along with AR visuals, we also provide a 360° camera view so that people can better their form. This way, our app Move! can overcome all the shortcomings of the other fitness apps in the market."}, {"idNo": 19, "name": "E.V.E. (Event Engineering)", "desc": "Paging Memories", "devfolioLink": "https://devfolio.co/submissions/eve-event-engineering-4e7d", "githubLinks": ["https://github.com/Voodoo-exe/TEAM_CYBORG--EVE", "https://docs.google.com/presentation/d/175dZLSqDzednyUnrNQ1HzUmbgphyRxg7-cJnlYr3YyA/edit?usp=sharing"], "special_mention": " ", "stacksUsed": ["HTML", "Visual Studio Code", "Django", "Python", "CSS3", "Django Template"], "longDesc": "The problem E.V.E. (Event Engineering) solves\nBringing all the essential Services that are required to host an event at one single platform, like Venues, Artists, Floral Decoratives and etc. at the cheapest rate possible. People will have varieties of options to choose from, for services and venues.\nBringing you a variety of Venues to choose from, so you never run out of Venues to host your event. You do not like the catering service of one company, no issues at all, go and select the other one in just a few clicks, it's that easy. Wanna organize an event in two days or later, it's very easy. In order to provide the best service possible to our clients, we have developed four steps easy process, to book any kind of event in less than ten minutes. Immediately after booking, the client can get the final bill in less than two hours.\nFour Easy Step Process:\nOpen the Web App., select the event type and Destination of Venue.\nSelect the Desired Venue. Based on Your Budget, Location, and Event type.\nSelect the Essential Services like Caterers, DJ Artists, Decoration Artists and etc.\nClick on \"Request For Quotation\" and After Receiving Click \"Approve\"."}]