[{"idNo": 0, "name": "Filling_Gaps", "desc": "Button Dabao Coolie Bulao", "devfolioLink": "https://devfolio.co/submissions/fillinggaps-597b", "githubLinks": ["https://github.com/yuvaraj-06/Filling_Gaps-Team", "https://yuvaraj-06.github.io/Filling_Gaps-Team/", "https://drive.google.com/file/d/18ht1HC51PrYMc1J1ALRM5BfZOIOy_N8n/view"], "special_mention": " ", "stacksUsed": ["Firebase", "Android Studio", "FAST API"], "longDesc": "The problem Filling_Gaps solves\nThe pandemic has made us all learn many things. Whether it's studies, food ordering or jobs we all faced several challenges and the only help to us during this time was the internet. Whether we agree or not, the world is moving towards digitalization at a very rapid rate. Several services are getting digitalized. Thinking about the same we came up with an idea of why we can’t make our railway journeys much more easier, especially that part of the journey off the train. Think of how clumsy it gets when you're carrying huge luggages and searching for coolies everywhere in the station and then bargaining with them. The idea of our project is to save time and efforts for you by finding a coolie. You can now book your coolie before you even reach the station. If you are a patient or with disability you need not worry. We have got a service to book wheelchairs at railway stations which will be made ready for you before your arrival. On the other hand, this app benefits coolies and gets customers to them through one click of a button who otherwise had to literally run beside passengers to get a pickup. Currently the realization of the idea only contains baggage pickup and wheelchair services. But the idea doesn't stop here, in future we also think to add more services for both the users and coolie, using which they can benefit a lot.\nWith digitalization and the stablishment of free wifi and services at railway stations, we are moving towards the path of hightech railways stations. The availablity of 24/7 internet facility makes the task for the coolie easier. They just need a smartphone availability and they are all set to operate the services provided by the app. Looking at many ongoing services outside the railway stations like Swiggy, Zomato, Urban Clap, Uber, and Ola we feel that someday it's possible to get a facility like these into the stations as well."}, {"idNo": 1, "name": "Hit Beat", "desc": "The Most Practical approach to learn BeatBoxing, beat by beat.", "devfolioLink": "https://devfolio.co/submissions/hit-beat-db8f", "githubLinks": ["https://github.com/rishavnaskar/hitbeat", "https://github.com/Akshat1903/Hack-Ingenium", "https://www.figma.com/file/cA2lXbpCzvimGDKZvlbI0z/Tech-Ingenium?node-id=0%3A1", "https://www.figma.com/file/cA2lXbpCzvimGDKZvlbI0z/Tech-Ingenium?node-id=109%3A0"], "special_mention": " ", "stacksUsed": ["Dart", "LibROSA", "Python", "Figma", "AWS", "RestAPIs"], "longDesc": "The problem Hit Beat solves\nMusic comes from practice not from books. \nProblems:\n1.) After researching, we found there are 100's of youtube videos on Beat Boxing and Just by listening to the video & trying, you never know whether you are doing the beatboxing the right way or not?\n2.) There is not even a single App where the Beat Boxing enthusiast can actually evaluate his/her progress and practise it the right way. \n3.)There are 100's of different sounds in Beat Boxing like lip roller, Siren, clip roller etc and to master beatboxing in general, you need to work on every sound separately.\nso to tackle these problems, Our Team: \"Console.log()\" has made an Educational yet fun product called \"Hit Beat\" by which the user can select a sound which he/she wants to practise and then just by listening to it (for say Clip roller) & recording it, the user will get a score out of 100. Now the user can keep practising that particular sound and try to improve the score(or you may say his/her BeatBoxing skill).\nFor Future work: We will be adding the Challenge Tab where Beat Boxers can challenge each other and will learn from each other. It will also make our business model stronger. (You can check our Github read me for Inspiration and all the other details.)"}, {"idNo": 2, "name": "Lokal", "desc": "A platform that allows a small store owner to build his own online community and turn his LOKAL customers into loyal. It rewards everyday consumers and makes the entire process feel like a game.", "devfolioLink": "https://devfolio.co/submissions/lokal-b8d1", "githubLinks": ["https://github.com/yashrajkakkad/lokal"], "special_mention": " ", "stacksUsed": ["Node.js", "JavaScript", "Heroku", "MongoDB", "Express", "reactjs"], "longDesc": "The problem Lokal solves\nGood businesses thrive on loyalty, especially small businesses.\nAnd we want to help this particular segment come online and thrive via their own online community.\nThe idea is to get the customers engage, and ultimately buy more (and more often) from the store owner.\nWe are trying to make the process of buying from small shop owners much more interactive and rewarding via gamification and introducing concepts like seasons, membership levels, etc\nThe customer gets to see a game, where levels are unlocked by buying more, and more often. As the levels progress, rewards go up. If he doesn't buy for some time, the concept which we are calling as season, their level reduces. They can choose to bypass levels by paying a token upfront.\nHere's how Lokal helps all the stakeholders involved:\nBusiness Owner\nBuild an online presence with a community.\nIncreased sales from customers at the cost of some profit percentage. (If the discount rates are set right, the business owner can make a profit).\nCustomer\nGet discounts for everyday shopping.\nDeveloper/Business\nMake money from the store as an upfront fee.\nOffer monetary credit to high-paying customers (Concept of a credit card). Make money from interest.\nTake a cut from upfront payments for bypassing levels (gamification concept)"}, {"idNo": 3, "name": "Davai", "desc": "One stop solution to all your medical needs", "devfolioLink": "https://devfolio.co/submissions/societree-8847", "githubLinks": ["https://github.com/"], "special_mention": " ", "stacksUsed": ["scikit-learn", "AWS"], "longDesc": "The problem Davai solves\nMedical Poverty of the country"}, {"idNo": 4, "name": "Self-Stabilizing Spoon with Remote Monitoring", "desc": "The stabilizing spoon compensates for unintended tremors or shivers and keeps the spoon bowl stable. The application displays sensor data graphically to the doctor for remote monitoring.", "devfolioLink": "https://devfolio.co/submissions/selfstabilizing-spoon-with-remote-monitoring-f2a4", "githubLinks": ["https://github.com/AryanG100/Team-Chiral-Ingenium-21", "https://drive.google.com/drive/folders/1C7lJJSVqfYoEVlXXE_w2JAb4W04WehM_?usp=sharing"], "special_mention": " ", "stacksUsed": ["Firebase", "Java", "Internet of Things (IoT)", "NodeMCU", "Kotlin", "Arduino", "Android NDK", "Sensors"], "longDesc": "The problem Self-Stabilizing Spoon with Remote Monitoring solves\nParkinson’s disease is a neurological degenerative disease that results in irrepressible shivers in the limbs. Due to unintended tremors in their arms, patients are unable to perform everyday menial tasks like eating food out of a bowl with a spoon.\nThe stabilizing spoon compensates for unintended tremors or shivers received from the user and calibrates its head against these forces, thus keeping the spoon bowl stable at all times. This spoon can move as quickly as 500°/second, hence effectively steadying the spoon and easing the eating process of patients.\nAnother part of the holistic product is a mobile application for a designated doctor to monitor the patient’s progress.\nDuring this pandemic, people have been terrified of entering hospitals for non-COVID diseases and ailments, and we aim to create and market a product to help people adjust better to this new norm.\nWe have developed an application that analyses data collected from the spoon via sensors and statistically displays it to the designated doctor. By using this application, a doctor can not only monitor your progress but also offer diagnosis and treatment remotely, without the patient needing to leave their home.\nWith this project, the absolute aim is to make a product that can make a patient’s life easier.\nThe product will not only make it easy for the user to eat food out of a plate/bowl but also help their recovery by enabling inexpensive and thorough communication with a designated doctor.\nIn an age where people are petrified of the thought of entering the premises of a hospital, we are trying to use all the technical experience we have to create an experience that avoids as much physical contact as possible.\nIn the case of neuro diseases associated with nerves and muscles, it is imperative for the doctor to check up on the patient’s movements regularly, but we have attempted to find a way for doing that without requiring the patient to ever enter a hospital."}, {"idNo": 5, "name": "Lingenium", "desc": "Tired if waiting at the restaurant? Pre-book your seat and order before leaving for the restaurant/cafeteria", "devfolioLink": "https://devfolio.co/submissions/lingenium-a43f", "githubLinks": ["https://github.com/Krishnaraj27/Lingenium.github.io", "https://krishnaraj27.github.io/Lingenium.github.io/index"], "special_mention": " ", "stacksUsed": ["JavaScript", "Nodejs", "CSS3", "HTML5"], "longDesc": "The problem Lingenium solves\nMany times we have faced the problem, i.e, waiting too much in que at the restaurant (or any fast fod center), especially on holidays or festivals. So we have tried to create a platform where you can come and check the restaurants around you, which suits your preferences and you can also check the waiting time(time taken to make your food ready). So you can book your order through us and thus, you can leave for the restaurant accordingly and will get the tasty meal ready by the time you reach there.\nTalking about the restaurant owners, they can contact us by filling the collaboration form if they want to list their restaurant here and want more happy:) customers."}, {"idNo": 6, "name": "Color Clash 3D", "desc": "Learn with fun", "devfolioLink": "https://devfolio.co/submissions/color-clash-d-a487", "githubLinks": ["https://github.com/khushsoni"], "special_mention": " ", "stacksUsed": ["Visual Studio", "Unity Game Engine"], "longDesc": "The problem Color Clash 3D solves\nIt make our mind Fresh"}, {"idNo": 7, "name": "Wear OS Radio Flutter", "desc": "The world’s first deployment of an idea based on network radio where we provide independent radio stations for a smartwatch running Wear OS.", "devfolioLink": "https://devfolio.co/submissions/wear-os-radio-flutter-6fbb", "githubLinks": ["https://github.com/SatYu26/Wear-OS-Radio-Flutter", "https://tinyurl.com/7jpybrxm", "https://youtu.be/MIRwema678U", "https://drive.google.com/file/d/1MxXe0p41cs4XzZ39r8CN7mGpXHTPVD-2/view?usp=sharing"], "special_mention": " ", "stacksUsed": ["REST API", "Flutter", "WatchOS"], "longDesc": "The problem Wear OS Radio Flutter solves\nTo set an example of hybrid mobile development on a platform, as small as a smartwatch.\nOur main objective for this tech deployment is to create a customizable and accessible standalone internet radio access for all Wear OS users, making it independent of a 2nd party device like an Android Phone.\nTo display the flexibility & expanded features of using hybrid application development platforms such as Flutter SDK on platforms such as Android Auto, Wear OS, etc."}, {"idNo": 8, "name": "Handwriting Rating System", "desc": "Used a CNN classifier to recognise and lowlevel computer vision concepts to rate them.", "devfolioLink": "https://devfolio.co/submissions/handwriting-rating-system-1740", "githubLinks": ["https://github.com/KashishShah1411/Handwriting_Rating_System"], "special_mention": " ", "stacksUsed": ["Python"], "longDesc": "The problem Handwriting Rating System solves\nHelp people to improve on their handwriting."}, {"idNo": 9, "name": "Day Maker", "desc": "A website that will give you inspiration through quotes and will give you a good start for a positive day with great UI/UX", "devfolioLink": "https://devfolio.co/submissions/day-maker-d433", "githubLinks": ["https://github.com/ShubhamPatel33/Day-maker"], "special_mention": " ", "stacksUsed": ["jQuery", "PHP", "JavaScript", "CSS3", "HTML5"], "longDesc": "The problem Day Maker solves\nIt gives you a good start of the day which has a good UI/UX"}, {"idNo": 10, "name": "StyleDraft : An online fashion marketplace", "desc": "Quality is Priority, Online retail made worry-free with blockchain", "devfolioLink": "https://devfolio.co/submissions/styledraft-an-online-fashion-marketplace-14f5", "githubLinks": ["https://github.com/vatsalcshah/StyleDraft-App"], "special_mention": " ", "stacksUsed": ["Node.js", "Firebase", "Flutter", "Adobe XD", "JSON", "Firestore", "Dart Programming Language", "IBM Hyperledger"], "longDesc": "The problem StyleDraft : An online fashion marketplace solves\nThere is an abundance of applications where buyers and sellers can exchange products but there is a lack of a trustable platform where the organization is involved in the transparency of transcations this causes scepticism for users. Trading applications are also not involved in the process of validating the authenticity of the product which further increases the mistrust.\nStyleDraft serves as an online marketplace, facilitating auctions between sellers and buyers, then collecting transaction and payment fees.HyperLedger Fabric provides transparency using blockchain technology. Sellers send purchased items to StyleDraft facilities for inspection and verification, then authenticated products are shipped to buyers.StyleDraft features a \"stock market-like\" variable pricing framework and discloses price histories for specific items.\nUsers will be able to track the journey of each product from the seller to our facility and finally till their doorstep using HyperLedger Fabric which is a private blockchain technology by IBM. Each product will be assessed at our facility and the exact condition of the product will be noted in the hyperledger, along with that fake products will be removed from the chain of supply."}, {"idNo": 11, "name": "Care4U", "desc": "The idea we proposed is related to help the people to identify the disease and to assist them with smart AI Bot system. Our system also remind the people to intake the medicine without fail.", "devfolioLink": "https://devfolio.co/submissions/careu-b02a", "githubLinks": ["https://github.com/Bala137/Smart-Disease-Prediction", "https://prezi.com/view/5IIXOLpHSJt2HBdrBJf0/"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "Machine Learning", "Artificial Intelligence", "Python", "Flutter", "Dart Programming Language", "HTML/CSS"], "longDesc": "The problem Care4U solves\nIndia is a hotbed of tech innovations and startups across the world. Tech-equipped medical devices and the development of top-notch technology for critical ailments such as heart diseases, diabetes, and cancer are already bringing laurels to Indian health-tech startups.\nA website has been developed to predict the disease in the patients body by various parametric value and by creating a dataset the model has been deployed into the website for the result of the prediction of the diseases, and analysis the stage of affection of the particular diseases and its types by its symptoms and personally assisting the person based on the type of disease which has precautions, prevention, daily caring of the patients etc., A bot has been implemented to answer up the queries of the patients and guide them accordingly. A remainder system has been done to remain the patients about the intake of medicines by mentioning what medicine and for what purpose?"}, {"idNo": 12, "name": "FoodPal", "desc": "Help us Help You", "devfolioLink": "https://devfolio.co/submissions/accisafe-0542", "githubLinks": ["https://github.com/FoodPal-CRCE/foodpalclient"], "special_mention": " ", "stacksUsed": ["MERN stack"], "longDesc": "The problem FoodPal solves\nIn the post corona world, it would be more beneficial to the public to have least amount of contact and interaction, specially in public places. \nRestaurants being one of the major places where people tend to come in contact very often, maintaining social distance with the staff could be a major challenge. \nSo as to minimize the contact we propose a user friendly portable software which can provide a descriptive interface to place orders with ease."}, {"idNo": 13, "name": "Connect", "desc": "People in this pandemic have become so self-centered and to increase social interaction among people or even to match you with someone with the same taste of movies/books as you.", "devfolioLink": "https://devfolio.co/submissions/connect-c979", "githubLinks": ["https://github.com/JeetKaria06/Ingenious_Hackathon_Cheese_Salad/"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JavaScript", "Python's Django framework"], "longDesc": "The problem Connect solves\nIn Japan, more people died from suicide last month than from Covid in all of 2020. And this is an alarming message to all the countries of this planet that social interaction and social well-being is still the most important aspect of human life. And to decrease depression in the minds of people and allowing them to interact with people of their own interests of books and movies, we have designed this platform that allows users to increase their social well-being.\nAnd this inspired us to design this and connect people and hence the name \"CONNECT\" was born."}, {"idNo": 14, "name": "CP-Arena", "desc": "A minimalistic platform to practice CP with your friend. Challenge your friend in 1v1 coding now ! Create or Join the room and start clashing, all you need is just the account on codeforces.", "devfolioLink": "https://devfolio.co/submissions/cparena-a8dc", "githubLinks": ["https://github.com/imdeep2905/cf-arena"], "special_mention": " ", "stacksUsed": ["React", "Django", "Django rest framework", "Django-channels"], "longDesc": "The problem CP-Arena solves\nThere are no websites to do 1v1 coding competition where problem's points can be claimed by only one user. One more unique feature is that it is guranteed that any of the given problems is not attempted by either of the participants."}, {"idNo": 15, "name": "JOBAPPS", "desc": "An App which promotes job employment.", "devfolioLink": "https://devfolio.co/submissions/jobapps-2c96", "githubLinks": ["https://github.com/JENIL2018/JOBAPP/blob/main/README.md"], "special_mention": " ", "stacksUsed": ["PHP", "HTML", "CSS", "java.xml", "hosting", "jeliohost", "phpmyadmin."], "longDesc": "The problem JOBAPPS solves\nThe online recruitment sites have witnessed exponential growth since the 2000s. With the internet becoming a prominent part of everyone’s life, there has been an increase in the use of recruitment sites by both job seekers and employers. Indeed has become the top-rated job and recruitment portal across the world. The platform connects over 250 million unique visitors every month by allowing them unrestrained access to its large job database. Another interesting report shows that the Indeed mobile app has been downloaded 46 million times globally, which includes over 20 million downloads in the U.S. alone. Over 50% of the platform’s traffic now comes from mobile devices."}, {"idNo": 16, "name": "MySpace", "desc": "An aggregated platform for collaborative storage and accumulation of paramount documents and images, along with Task management and resource management features to handle workspaces.", "devfolioLink": "https://devfolio.co/submissions/myspace-908d", "githubLinks": ["https://github.com/rushil1999/mySpace/tree/routing"], "special_mention": " ", "stacksUsed": ["Firebase", "React and Material UI"], "longDesc": "The problem MySpace solves\nPeople face a conundrum of storing a variety of files and documents(resource) across different folders and devices that can be brought into one single platform. You can create a 'Box' having all your doc, bookmarks, category-wise. We also provide a Task storing feature"}, {"idNo": 17, "name": "@@", "desc": "@@", "devfolioLink": "https://devfolio.co/submissions/inroute-a1fc", "githubLinks": ["https://github.com/ayushmawasthi/Inroute"], "special_mention": " ", "stacksUsed": ["PHP", "Android", "SQL", "Inertial Sensors"], "longDesc": "The problem @@ solves\n@@"}, {"idNo": 18, "name": "MediPoint - Care Yourself", "desc": "Medipoint is an application which optimizes medical healthcare services and improvises patient's health care journey. It caters to the health care needs of the people by providing At-Home Service.", "devfolioLink": "https://devfolio.co/submissions/medipoint-care-yourself-6528", "githubLinks": ["https://github.com/clue1ess/IngenuimHackathon.git"], "special_mention": " ", "stacksUsed": ["scikit-learn", "Python", "Express.js", "React Native", "MongoDB", "Nodejs"], "longDesc": "The problem MediPoint - Care Yourself solves\nWe have been witnessing the wrath of the COVID-19 Pandemic for a year now. While this fatal airborne disease continues to spread around the globe, it has put health care facilities under immense pressure. In most of the regions, hospitals are outnumbered by the increase in number of patients. Patients with normal cough, cold or some trivial infection are not being attended without a negative report, even though the patient doesn’t show all symptoms of COVID-19. Through this platform, we aim to minimize the communication gap between the patient and the health care service providers by developing an online interface that can improve accessibility, quality of treatment, avoid physical contact with any other person and reduce the long waiting hours. \nImapcts on Stakeholders:\n1. Saves Time - Visting hospital for booking appointment is very time consuming and can be hectic now-a-days. MediAppoint can be your saviour.\n2. Book anything from anywhere - Users are not limited to any specific working times of hospital for booking,they can book the appointment round the clock at anytime from anywhere.\n3. Save Resources - MediAPoint is an automated appointment system as it removes the expensive of going hospital for manual booking\n4. Minimize communication gap between Doctors and Patients - Patients can themselves get the info about the diseases using MediPoint app.\n5. First Aid treatment - User can get home remedies for the diseases which can act as first aid or additional help in treatment of diseases.\n6. ML prediction of diseases using symptoms - Helpful for users who are unsure about the disease"}, {"idNo": 19, "name": "Contactless Attendance System", "desc": "Now attendance does not require you to share bacteria.", "devfolioLink": "https://devfolio.co/submissions/contactless-attendance-system-392c", "githubLinks": ["https://github.com/yash49/Ingenious-Hackathon"], "special_mention": " ", "stacksUsed": ["Firebase", "Android", "Google Vision API", "Python-Django"], "longDesc": "The problem Contactless Attendance System solves\nOwing to the current (COVID) situation it is essential to have a system, which has minimum contact, for attendance. Biometric attendance possesses the risk of spreading bacteria among its users. So in the pursuit of a solution, we came up with an idea of taking attendance with the help of a camera sensor. The current systems were capable of processing only one user's request at a time, which was very inefficient. Hence the inspiration came from the pursuit of a solution for no contact attendance system.\nOur team RTE has comeup with a solution for this. we have created a contactless attendance system which allows the user to mark himself for entry exit without actually being in contact with the device physically."}]