[{"idNo": 0, "name": "Ethereum Hack: Karbonize", "desc": "Decentralized Personal Carbon Trading. This is an improved ideation of the model implemented by Lahti, Finland. It gives the users incentives to reduce their carbon footprint while earning money.", "devfolioLink": "https://devfolio.co/submissions/vybe-8201", "githubLinks": ["https://github.com/AL-S4H3R/karbonize-pwa"], "special_mention": "Best Individual Hack: 2nd Runner Up", "stacksUsed": ["React", "Matic", "Tailwind CSS", "Polygon", "Portis by Shapeshift"], "longDesc": "The problem Ethereum Hack: Karbonize solves\nMain Issue: Global Carbon Footprint per Individual\nSecondary Issue: Side Income generation\nThe POC for Karbonize includes a mobile application where the users can register their accounts and based on some initial questions, they'll will be given a weekly carbon emission allowance for travel. This is based on the same model as implemented by Lahti in Finland: https://carbonwatchdog.org/lahti-finland-carbon-rationing/\nWhen the app is given location permissions, it runs a ML model to determine the mode of transport for users and deduct the Karbon Kredits(weekly carbon emission quota). This credit management is done on the blockchain for verified user accounts.\nThe users can also trade their Karbon Kredits and all the trade transactions execute on the blockchain.\nIn essence, Karbon Kredits are just ERC-20 Tokens that are in limited supply, when users buy or sell kredits, they trade these tokens with ETH & their Price is decided by the ratio of Total Kredits: Available Kredits."}, {"idNo": 1, "name": "Feather", "desc": "A simple to use, lightweight video calling service", "devfolioLink": "https://devfolio.co/submissions/feather-1458", "githubLinks": ["https://feather.cf/", "https://github.com/IshaanOhri/Feather"], "special_mention": "Best Design and Interaction", "stacksUsed": ["HTML", "CSS", "JavaScript", "WebRTC", "PeerJS"], "longDesc": "The problem Feather solves\nDuring the lockdown period, the only means of connecting to our dear ones is through a video call. But at times the video becomes laggy or pixilated and it gets frustrating that we can't view the other person clearly. This leaves us with the only other solution, an audio call. But audio calls are just too boring!\nWell, not anymore. Connect to your dear ones using Feather.\nFeather is a simple to use, lightweight video calling service that lets you connect to your dear ones even in the poorest of networks.\nSo how exactly does Feather work?\nFeather converts your video stream into ASCII stream right before transmission, in order to provide a seamless user experience, simply because transmission of text requires less bandwidth as compared to the transmission of a video stream.\nConventional video calling services transmit video and audio, while Feather transmits text and audio."}, {"idNo": 2, "name": "NextLife", "desc": "A blood donation app in which users can see all people who need help in their state and help them by donating their blood.", "devfolioLink": "https://devfolio.co/submissions/nextlife-bc10", "githubLinks": ["https://github.com/Vaibhav2002/NextLife", "https://github.com/Vaibhav2002/NextLife/blob/master/app/release/nextLife.apk"], "special_mention": "Best Individual Hack", "stacksUsed": ["XML", "Adobe XD", "Google Maps API", "Kotlin", "Native Android", "Google Firebase", "Android Jetpack", "Android Architecture Components"], "longDesc": "The problem NextLife solves\nProblem\nPeople usually need blood, when they get ill and are hospitalized . People usually rush to near blood banks to get blood. This is the best way to get blood when in need and most of the time it doesn't cause any problem. But sometimes there are shortages of blood in the blood bank, like during covid-19 pandemic there was a shortage of blood all around the globe, no one knows when there can be shortage of blood and hence we should be always ready to fight it. \nThere are also people who are not in a financially good condition and hence are unable to afford the cost of blood.\nSolution\nThe NextLife app helps people who want to do something good for the world know about people in their city or state who need blood , be it due to shortage or they cant afford it. People who need blood can post their requirement here and hence other people who live in their city and use this app can see their posts. This helps people who want to help such people in need see their location , contact them and help them by donating their blood ,or by donating cash or in any way in which they can help."}, {"idNo": 3, "name": "Green Map", "desc": "Our first step towards understanding the importance of a better and sustainable future and creating a better world for the future generation!", "devfolioLink": "https://devfolio.co/submissions/green-map-2bbd", "githubLinks": ["https://greenmap-djapp.herokuapp.com/", "https://github.com/Tuntai/Green_Map_WebApp"], "special_mention": "Jury Award", "stacksUsed": ["Bootstrap", "Django", "JavaScript", "Heroku", "SQLite", "Geocoding", "Mapbox API", "CSS3", "HTML5"], "longDesc": "The problem Green Map solves\nProblem we Target:\nCarbon neutrality has been around for a few years now but the theoretical definition and practical application of the idea remain a bit cloudy, even among the eco-friendly community.\nFor many journeys to and from work are the bookends of the daily grind. But how we choose to travel to the office, or even to pop to the shops, is also one of the biggest day-to-day climate decisions we face.\nGlobally, transport accounts for around a quarter of CO2 emissions.\nMaking changes in how you get around can significantly cut your carbon budget.\nOur Product:\nHas a bunch of Resources that will help the user to be aware of their Carbon footprint and will also help them to actually visualize the Carbon dioxide that is produced daily due to their day-to-day activities.\nOnce the user understands the concepts of Carbon Footprint, Carbon Offset, and Carbon Neutrality, they can keep a Detailed Record of their Offset Contribution.\nThe user will have an option to neutralize their Carbon Offset by Donating an amount proportional to their Carbon Offset, towards a Tree Plantation.\nOnce the user confirms their donation, their Offset gets neutralized.\nAdded Features: Once the user selects their destination and their mode of travel, they will get a detailed rout and direction to reach the destination."}, {"idNo": 4, "name": "Shifu by Celestial Biscuit", "desc": "A revolutionising and user friendly technology to promote sustainable agriculture by detecting soil type and suggesting crops.", "devfolioLink": "https://devfolio.co/submissions/shifu-by-celestial-biscuit-fc5e", "githubLinks": ["https://github.com/Nishtha0801/shiwu"], "special_mention": "Jury Award", "stacksUsed": ["HTML", "CSS", "JavaScript", "Flask", "TensorFlow", "Machine Learning", "Figma", "Adobe Photoshop", "Adobe Illustrator", "Keras CNN"], "longDesc": "The problem Shifu by Celestial Biscuit solves\nShiwu covers 3 Sustainable Development Goals:\n1. Zero Hunger: With the knowledge of the right crop for your soil, more crops can be produced thereby ending hunger. \n2. Responsible Consumption and Production: We detect the correct soil and suggest the best crops which can be grown thereby ensuring sustainable production patterns.\n3. Life on Land: When the right crop is being grown on the soil, the soil resources are utilised properly thereby preventing desertification and trying to halt it.\nTarget Audience:\n1. Farmers who wish to check which soil lies on their land and decide which crop should be grown on their land. \n2. Gardening enthusiasts who wish to start an in-house garden and decide which will be the best plant/crop to grow in the soil that is available around their place.\nFuture Scope: \n1. Allow users to register and save the types of soil they have on their different fields.\n2. A personalised dashboard for the user where they can see a list of the different fields they have, and the crop that they would grow there. \n3. Personalised articles related to farmer's soil and crops. \n4. A chatbot for easy navigation around the website and providing answers to farmers' crop and soil related queries. Google's Speech to Text API can come in handy for this scenario. \n5. To offer the farmers a more personalised experience, we are also planning to put Google's Translation API to use to convert the languages into the regional languages of the farmers."}, {"idNo": 5, "name": "RAHAT", "desc": "Remote Application for Health Assistance And Tracking \"COVID mein dooriyan nahi\"", "devfolioLink": "https://devfolio.co/submissions/rahat-245a", "githubLinks": ["https://github.com/mrcodefrost/sparkathon_220_volts", "https://drive.google.com/drive/folders/1n7m83BC7HIsAB22Z02U7yCpzIJEsBkI1?usp=sharing"], "special_mention": "Jury Award", "stacksUsed": ["Android", "Java", "Internet of Things (IoT)", "Arduino Uno", "Flutter", "Sensors", "Cloud", "RestAPIs"], "longDesc": "The problem RAHAT solves\nRAHAT implements sensor technology and the internet to communicate with loved ones in case of problems. This system also shows patients' temperature and heartbeat tracked live data with timestamps over the Internetwork. Using the cloud nearby hospitals can access the data and help the patient if in case of an emergency. The mobile app has been developed as a smart portal for end-users integrated with a push notification service. It also has other features like COVID-19 News, videos. The app has an authentication feature also. This project will continuously monitor the vitals of the patient and send the alert to the app if and when some unusual trend is seen for a period of time. It will also intimate the nearby hospitals."}, {"idNo": 6, "name": "ChartBay : Create, Share & Analyse on the Go", "desc": "ChartBay is an instant Chart Provider based on inputs from CSV files or manual entry. It outputs data in PNG and PDF format which is also directly sent to the user via e-mail within few seconds.", "devfolioLink": "https://devfolio.co/submissions/chartbay-create-share-and-analyse-on-the-go-5697", "githubLinks": ["https://chartbay.herokuapp.com/", "https://github.com/kothawleprem/chartz"], "special_mention": "Best Overall Hack: 2nd Runner Up", "stacksUsed": ["Bootstrap", "Django", "JavaScript", "Python", "CSS3", "HTML5", "API"], "longDesc": "The problem ChartBay : Create, Share & Analyse on the Go solves\n💻 Data visualization made easy – no complicated software to learn\n⚡ Publish, share or download your high-resolution charts on the Go quickly.\n➡️ For Large Data, upload CSV Files.\n➡️ Instant delivery to user's inbox.\n➡️ 12 different types of Charts along with Information about each of them.\n🖥️ User Friendly Interface with no complications."}, {"idNo": 7, "name": "Self-Stabilizing Spoon with Remote Monitoring", "desc": "The stabilizing spoon compensates for unintended tremors or shivers and keeps the spoon bowl stable. The application displays sensor data graphically to the doctor for remote monitoring.", "devfolioLink": "https://devfolio.co/submissions/selfstabilizing-spoon-with-remote-monitoring-668c", "githubLinks": ["https://github.com/vishalvhingorani/Chiral_Sparkathon-", "https://drive.google.com/drive/folders/1rkdjcFsLQ63kz9DgfM9mqWkd1bVh64W0?usp=sharing"], "special_mention": "Best Overall Hack: Runner Up", "stacksUsed": ["Firebase", "Java", "Internet of Things (IoT)", "Kotlin", "Arduino", "Android NDK", "Sensors"], "longDesc": "The problem Self-Stabilizing Spoon with Remote Monitoring solves\nParkinson’s disease is a neurological degenerative disease that results in irrepressible shivers in the limbs. Due to unintended tremors in their arms, patients are unable to perform everyday menial tasks like eating food out of a bowl with a spoon.\nThe stabilizing spoon compensates for unintended tremors or shivers received from the user and calibrates its head against these forces, thus keeping the spoon bowl stable at all times. This spoon can move as quickly as 500°/second, hence effectively steadying the spoon and easing the eating process of patients.\nAnother part of the holistic product is a mobile application for a designated doctor to monitor the patient’s progress.\nDuring this pandemic, people have been terrified of entering hospitals for non-COVID diseases and ailments, and we aim to create and market a product to help people adjust better to this new norm.\nWe have developed an application that analyses data collected from the spoon via sensors and statistically displays it to the designated doctor. By using this application, a doctor can not only monitor your progress but also offer diagnosis and treatment remotely, without the patient needing to leave their home.\nWith this project, the absolute aim is to make a product that can make a patient’s life easier.\nThe product will not only make it easy for the user to eat food out of a plate/bowl but also help their recovery by enabling inexpensive and thorough communication with a designated doctor.\nIn an age where people are petrified of the thought of entering the premises of a hospital, we are trying to use all the technical experience we have to create an experience that avoids as much physical contact as possible.\nIn the case of neuro diseases associated with nerves and muscles, it is imperative for the doctor to check up on the patient’s movements regularly, but we have attempted to find a way for doing that without requiring the patient to ever enter a hospital."}, {"idNo": 8, "name": "HealthHub", "desc": "HealthHub plans to guide people lead a healthy lifestyle by helping them plan healthy meals under the guidance of health coaches and gamifying exercise!", "devfolioLink": "https://devfolio.co/submissions/healthhub-055c", "githubLinks": ["https://github.com/vrushti-mody/HealthHub", "https://the-health-hub.herokuapp.com/"], "special_mention": "Best Overall Hack", "stacksUsed": ["Embedded Javascript (EJS)", "Git", "Socket.IO", "Express.js", "MongoDB", "HTML/CSS", "Nodejs", "GoogleDialogFlow", "GoogleFitAPI", "SpoonacularAPI"], "longDesc": "The problem HealthHub solves\nWhy HealthHub?\nThe COVID-19 pandemic has disrupted just about every aspect of ordinary life — and diet and exercise routines are no exception.\nWork-from-home, remote learning, and public health guidelines for gyms and fitness facilities that include capacity limitations, cleaning protocols, mask wearing, and social distancing has changed how, when, and where we exercise.\nMeal planning for a family, a challenge on its own, can be more so now with seclusion at home, more people to feed with different tastes, and more food stores with limited groceries and shopping times. There’s also the uncertainty of bare shelves, with normal staples of a nutritious diet unavailable, at least temporarily. It’s tempting to buy whatever is available, even if it’s not something that’s part of your normal diet which can throw plans for healthy eating out the window.\nWhat we help with\nGoals\nYour first step towards a healthy lifestyle is setting two goals. The first goal is your target number. Once you've set this goal, next is to figure out your deadline. Be realistic about them.\nExercise Plan\nExercise at a local gym, go for a jog or try those workout videos at home! However you choose to exercise, a great way to help you stay focused on your goal is to use a fitness tracker.\nEating Right\nIn addition to your new exercise routine, you will also be changing your diet. But don't think of it as dieting, you will simply be forming new and healthier eating habits.\nKey Features\nThe Healthy Recipe Guide: A list of curated recipes based on your ingredients\nLifestyle Tracker: Track your steps, calories, etc with the lifestyle tracker\nThe Healthy Bot: Clear your doubts about anything health or fitness related\nRetrospective Journal: A safe space to express and analyse your emotions\nHealth Coaches: To guide you on your fitness journey\nCommunity Corner: To Interact with the HealthHub users"}, {"idNo": 9, "name": "Kuch Socha ni", "desc": "ALL the stuff", "devfolioLink": "https://devfolio.co/submissions/kuch-socha-ni-80ba", "githubLinks": ["https://github.com/abhaykatheria"], "special_mention": " ", "stacksUsed": ["SQL", "DBMS"], "longDesc": "The problem Kuch Socha ni solves\nHmm"}, {"idNo": 10, "name": "GardenFresh", "desc": "Eat Fresh, Feel Fresh.", "devfolioLink": "https://devfolio.co/submissions/gardenfresh-873c", "githubLinks": ["https://padavekartik.wixsite.com/garden-fresh"], "special_mention": " ", "stacksUsed": ["Wix Website Builder"], "longDesc": "The problem GardenFresh solves\nIt mainly focuses on selling fresh farm products at reasonable prices to the customer which would otherwise be sold at a higher price due to all the middle people being involved. It provides farmers a name they can trust with their produce and also by customer to deliver all fresh products safely."}, {"idNo": 11, "name": "I-EASSY", "desc": "IMPROVING COMMUNICATION WITH I-EASSY. We have worked on an idea that makes communication between Banks and channels more efficient, convenient, or automated.", "devfolioLink": "https://devfolio.co/submissions/ieassy-80c0", "githubLinks": ["https://youtu.be/jIXTIhYsj9o"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "Python", "Figma", "RASA"], "longDesc": "The problem I-EASSY solves\nCustomers are looking for speed and personalization when interacting with their financial institution. At the same time, they don’t want the impersonal experience of email or online forms. Customer support chatbots offer a mix of both live conversation and speed.\nAI Chatbots can handle multiple queries simultaneously. Banks deploying bots can handle millions of queries in a month. Employing agents to do so is expensive and time-consuming. Hence, bots are helping banks to save up-front costs \nBanks can integrate bots on their application whereby customers can type and find solutions to their queries.\nOur chatbot can be used to implement features such as \n1.Book a meeting with a representative of bank, \n2.Report an issue -> File a complaint\n3.sentiment analysis -> predict the sentiment to offer products\n4. backend integration ->Helps in making complex tasks possible for the bot to implement\n5.Alerts -> daily alerts to keep them up to date with upcoming bank policies\n6.Escalation ->invites a senior staff to the conversation when the need is required\n7.Reporting-> observes potential threat and reports\n8.Analytics -> gives statices to improve banks practices \n9.Automated Routing -> this invites the representative staff on the go\n10.suggesting products -> personalised suggestion helps customer get his desired product\n11.private conversation-> the inter staff communication can be made private to avoid any miscommunication"}, {"idNo": 12, "name": "RoboTarantula", "desc": "A robot to reach places where a man can't", "devfolioLink": "https://devfolio.co/submissions/robotarantula-197f", "githubLinks": ["https://drive.google.com/drive/folders/1EDwk5pxZy-L2I3LDoi04_88-Q-cDTbL4?usp=sharing"], "special_mention": " ", "stacksUsed": ["Arduino", "Klann's Mechanism"], "longDesc": "The problem RoboTarantula solves\nIt can be used in rescue missions and rough terrains that are inaccessible by humans."}, {"idNo": 13, "name": "Shot of Hope", "desc": "Easy Covid Vaccine Appointment Scheduler", "devfolioLink": "https://devfolio.co/submissions/shot-of-hope-f0d8", "githubLinks": ["https://github.com/AbhilashaBansal/soh"], "special_mention": " ", "stacksUsed": ["jQuery", "Bootstrap", "JavaScript", "SQLite", "HTML/CSS", "Nodejs", "HTML5"], "longDesc": "The problem Shot of Hope solves\nPresently, we need a means to efficiently distribute the Covid 19 Vaccine. This application allows users to book an appointment online to get themselves vaccinated without hassles. It shows the various available hospitals, dates & slots to users.\nIt allows one user per slot, and hence would help to avoid overcrowding of people in hospitals.\nIt would allow people to get vaccinated hassle free.\nIt would allow hospitals to keep track of the appointments they have received and intoduce more slots for people to choose from."}, {"idNo": 14, "name": "Recommendation by tracking user’s scroll behaviour", "desc": "Track user's scroll activity using frontend techniques, and use it to place ads or recomendations at the point frequently used or seen by users. ( No Code track ).", "devfolioLink": "https://devfolio.co/submissions/recommendation-by-tracking-users-scroll-behaviour-5425", "githubLinks": ["https://prod-recommend.herokuapp.com/", "https://github.com/adithyaharish/product-recommendation"], "special_mention": " ", "stacksUsed": ["Django", "JavaScript", "AJAX", "Machine Learning", "Heroku", "Python", "Kaggle", "React.js"], "longDesc": "The problem Recommendation by tracking user’s scroll behaviour solves\nPeople’s behaviors are rarely stable and their usability gestures change over time. But one user behavior that did change is the tendency to scroll. Most of the time we spend in an app goes in scrolling, and the remaining few in actual viewing of the content. So, what if we can track the scrolling behaviour, understand where they stop and recommend based on that.\nMost of the user's time goes wasted in scrolling content that he/she isn’t interested in. To understand their interest, their scrolling behaviour can be tracked. Point where they stop scrolling and spend some time viewing the content shows that they are interested in that content. So, our idea is to retrieve the products when scrolling stops, get similar products to that using ML techniques and display that at their point of scroll. We can aslo display ads instead of recommendations.\nTo track the user’s scroll behavior, we use Javascript. The JavaScript detects the scrolling activity. It also creates a div with an id which is used to display the data present on the screen. Once, the user stops scrolling, we extract the product present in that div tag and send it to the recommendation system. After finding the user’s interesting products we intend to find similar products using cosine similarity. For this, we implement ML techniques based on content recommendation."}, {"idNo": 15, "name": "DataSec.AI - Data Anonymization Microservice", "desc": "DataSec.AI aims to tackle data privacy issues of the 21st century by leveraging cutting-edge technologies integrated with state-of-the-art Artificial Intelligence Algorithms.", "devfolioLink": "https://devfolio.co/submissions/datasecai-data-anonymization-microservices-08be", "githubLinks": ["https://github.com/Shreyas-l/Sparkathon"], "special_mention": " ", "stacksUsed": ["Flask", "Heroku", "PostgreSQL", "Redis", "Google Cloud Platform (GCP)", "Squid proxy", "ICAP server", "Presidio Analyzer Spacy NLP Engine"], "longDesc": "The problem DataSec.AI - Data Anonymization Microservice solves\nOur project aims to mask all the sensitive Personally Identifiable Information (PII) on the web. This masking logic will work in real-time and can connect to the company VPN and intercept all the traffic passing through the network. The masking logic can be configured by our clients, once their accounts are authorized by the admin. Several types of masks will be provided to ensure that our software covers all types of PII, especially in the pharmaceutical industry. The software can be deployed as both Cloud and On-Premise setup based upon our client company’s desire. Containerized deployment on Google Kubernetes Engine helps speed up the anonymization process, auto-scaling, auto-healing in case of errors, regular health checks, and periodic report generation. The CI/CD pipeline helps to push and deploy new code modifications with great ease. We have employed Istio’s Service Mesh Architecture to deploy our Project on Google Kubernetes Engine. Squid Proxy acts as a Reverse Proxy capable of intercepting all the traffic on a given network. Squid Proxy acts as a sidecar to the Python ICAP Server which Masks/Unmasks PII Data from the intercepted traffic. Redis is used for the purpose of in-memory caching of Masking logic, Request Configurations, Response Configurations, and User ID Management. Flask framework is used to develop the Configuration Software. PostgreSQL Database is used for the purpose of RDBMS. SpaCy's Presidio Analyzer Engine is leveraged to detect and anonymized the sensitive PII data from requests and responses."}, {"idNo": 16, "name": "Krishi Sahaayak", "desc": "Ek kadam Krishi Sahaayta ki ore !", "devfolioLink": "https://devfolio.co/submissions/krishi-sahaayak-6695", "githubLinks": ["https://github.com/harshitkumar77/krishisahaayak.github.io"], "special_mention": " ", "stacksUsed": ["Java", "Android Studio", "XML", "SQLite"], "longDesc": "The problem Krishi Sahaayak solves\nGiving detailed instructions related to crops yeilding and treatement and related information about government schemes also tried to make a direct platform where the buyer can come in direct contact of the farmer cutting the middleman"}, {"idNo": 17, "name": "Healthify an App for ALL", "desc": "Providing digital solutions and Creating Awareness among the people regarding this pandemic situations", "devfolioLink": "https://devfolio.co/submissions/healthify-an-app-for-all-d74f", "githubLinks": ["https://github.com/sanjnasiboo24/Healthify"], "special_mention": " ", "stacksUsed": ["Dart", "Python", "Flutter", "Jupyter Notebook", "Actions On Google"], "longDesc": "The problem Healthify an App for ALL solves\nWe have made a model for detecting if people are wearing marks and abiding to social distancing practises since most of the people are not following it so we have provided a digital solution. Also we have created a chatbot that diagnoses certain basic diseases based on the symptoms mentioned by the user since people often tend to get confused as to what disease they actually are suffering from .Lastly we have created basic flutter app which contains a bmi calculator and an awarness page that provides the user with basic info related to health"}, {"idNo": 18, "name": "Disease detector", "desc": "Get to your chest X-ray analysis within few seconds. Our project Disease detector can detect 4 different diseases namely Covid, Tuberculosis , Bacterial and Viral Pneumonia or Normal.", "devfolioLink": "https://devfolio.co/submissions/disease-detector-bc1b", "githubLinks": ["https://github.com/BlueKNIGHT107/Disease-Detection"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "Django", "TensorFlow", "Keras"], "longDesc": "The problem Disease detector solves\nIn today's busy world we need to"}, {"idNo": 19, "name": "PollutoPatrol (Pollution Patrol)", "desc": "An app that determines your departure time, for your and mother nature's advantage.", "devfolioLink": "https://devfolio.co/submissions/pollutopatrol-pollution-patrol-3e80", "githubLinks": ["https://github.com/gauravthakur2003/Sparkathon-Ignite-2021-Submission"], "special_mention": " ", "stacksUsed": ["JavaScript", "CSS3", "HTML5"], "longDesc": "The problem PollutoPatrol (Pollution Patrol) solves\nThe problem of polllution due to Peak hour traffic, leading to an increase in the AQI is solved using this app."}]