[{"idNo": 0, "name": "WECARE", "desc": "Our main slogan is \"Your wellbeing meets a new room.\" A forum where patients can choose where they want to get their prescription and a great place to find the best option for their health care needs.", "devfolioLink": "https://devfolio.co/submissions/wecare-112a", "githubLinks": ["https://github.com/sooddhruv/Sociothon"], "special_mention": " ", "stacksUsed": ["Bootstrap", "JavaScript", "TensorFlow", "AngularJS", "Express.js", "MongoDB", "Nodemailer", "mongoose", "HTML/CSS", "Nodejs"], "longDesc": "The problem WECARE solves\n1) Buying and Selling space: Medicines can be sold and bought in bulk according to their quality. This service can create a unique platform for bestselling quality products and can offer services for medicines according to the patient's demand.\n2) Compare the market prices: A customer in reality cannot compare the prices of medicines. So, they can compare the prices of medicines here.\n3) Buying of medical supplies: Medicines at times are of inferior quality. An excellent quality medicine can be put up on the site. It can provide a platform to list all the most required medicines in your locality. \n4) Basic awareness: It can be used as a smart platform to make users aware of the best and genuine medicine price. \n5) Constant notifications for users: Sending them constant emails regarding purchases, buying quotes and also the availability. We also give the numbers of those who are interested to buy medicines."}, {"idNo": 1, "name": "INIGMA", "desc": "MEDICINE GUIDE IN YOUR POCKET", "devfolioLink": "https://devfolio.co/submissions/inigma-48f8", "githubLinks": ["https://github.com/VibhutiBansal-11/inigma_socio", "https://aavaigrocks2001.github.io/IItRoorkeeWebsite/", "https://drive.google.com/file/d/1pb321KrF_CxDQmzgNoSu7dNyFNdvDuqj/view?usp=sharing", "https://drive.google.com/drive/folders/1KojKIe7fp5puXDmt5HnxtVDGjxe2buP3?usp=sharing"], "special_mention": " ", "stacksUsed": ["JavaScript", "Flutter", "Website: Bootstrap", "App : Dart", "Common real time database created on firebase", "Web Api: used for medicine based database"], "longDesc": "The problem INIGMA solves\nWeak supply chain and the poor distinction between the price of branded and generic medicines.\nNon availability of generic medicines available at an affordable price.\nMissing regular health checkup and wrong dosage of medicine"}, {"idNo": 2, "name": "TRUEMED", "desc": "\"Lets Think Of Saving Money & Access to Medication To the Poorest\"", "devfolioLink": "https://devfolio.co/submissions/truemed-312c", "githubLinks": ["https://truemed.herokuapp.com/", "https://github.com/Mrityunjay383/TrueMed"], "special_mention": " ", "stacksUsed": ["HTML", "CSS", "JavaScript", "Python", "Data Science", "Nodejs", "web scrapping"], "longDesc": "The problem TRUEMED solves\nMedicines constitute a substantial proportion of out-of-pocket (OOP) expenses,\nAnd That is Because People Aren't Aware of the The Price Range Over Generic/Branded/JAS,\nBasic Problem is Lack Data Available.\nSo with Modern Art Of Data Science we Created A Web Portal,\nWhere User has to Input The Prescribed Medicine Name By the Doctor , and Then Our Portal will Recommend Cheapest Generic Alternative. \nas we know one of the biggest problems faced by poor and middle class Indian households are the expensive medical bills.\nWhich are mostly affected by the branded medicine vastly available at most the pharmaceutical stores. \nRecent research has shown that around 70 - 80% of generic medicine are much more cheaper than there branded counter parts.\nBut due to lack of awerness among commone people who does not have proper knowledge about the inticrare medical terms, they often end up buying costly branded medicine.\nTo overcome this massive everyday difficulty we have developed this simple to use website based platform.\nAll that the user have to do is just to type in the name of the branded medicine in the seach engine and the platform will show output. The platform will take the input and identify its salt composition. After indentifying its salt composition the platform will give an output which will show a generic medicine which will consist of the same salt composition as that of the branded one.\nAs we know in majority of cases generic medicine are cheaper and as much as effective as the branded medicine so this platform will overall help to reduce the medical expenses."}, {"idNo": 3, "name": "JAC informer", "desc": "Focus on the benefits. Payless, get more.", "devfolioLink": "https://devfolio.co/submissions/jac-informer-a75e", "githubLinks": ["https://devfolio-sociothon.netlify.app/", "https://github.com/Rohit275/devfolio-sociothon"], "special_mention": " ", "stacksUsed": ["Netlify", "React js", "CSS Grid and Flexbox"], "longDesc": "The problem JAC informer solves\nPromotes the purchase of generic medicines which creates awareness about generic medicines to the people."}, {"idNo": 4, "name": "Clinica", "desc": "Clinica tackles the problem of a weak supply chain using AI and bridges the poor distinction between the price of branded and generic medicines by building a specific platform for selling medicines.", "devfolioLink": "https://devfolio.co/submissions/clinica-e4f7", "githubLinks": ["https://shrouded-basin-46770.herokuapp.com/", "https://github.com/404Enigma/Sociothon-Hackathon-2021", "https://healthapi1.herokuapp.com/[month]/[category]"], "special_mention": " ", "stacksUsed": ["Node.js", "JavaScript", "Flask", "scikit-learn", "NumPy", "pandas", "expressjs", "Google Authentication", "Firebase Cloud Firestore", "HTML5 CSS3"], "longDesc": "The problem Clinica solves\nTo tackle the problem of a weak supply chain, Clinica uses a machine-learning algorithm which is used to predict the sales of the drugs for the current month by calling out a private API made by us which basically consists of a machine learning algorithm. So, the algorithm's main task is to identify the relationship between the sales of the drugs of previous years considering data back from 2014 to the present month in the field of pharmaceutical. After predicting the sales of the current month, it is used by the vendor to predict the amount of stock needed by him for that particular month. It then helps in building a strong supply chain system by directly keeping in contact with the supplier and the vendor. Clinica also has a feature named \"Emergency Need of Stock\" which is available to the vendor in case of need of emergency stock. It can be used when there is a sudden increase in the demand for a particular drug which forces the supplier to increase the supply of that respective drug to avoid the sudden break in the supply chain system. Using Clinica, one can predict the sales of the future too using our API. By predicting the sales of the current month, our system surpasses the problem of the supply chain system.\nSecondly, to tackle the problem of the poor distinction between the branded and the generic medicines, Clinica has a platform for its customers to know about what are generic medicines and how they are different from branded medicines in terms of price and quantity. A platform built to let know its customers about the generic medicines provided under JAS and where a customer has a choice to add a particular medicine to its cart of future references. Our platform is a positive means to spread awareness of the ongoing Govt. scheme. People of don't know the variation of prices in the medicines, our platform shows the same before the eyes of the customer so that they can choose wisely and buy the much better deal."}, {"idNo": 5, "name": "MediSure", "desc": "We have developed a web as well as an Android App(which employs the web app) named MediSure to provide the most economical result matching the prescription using JAS & Open medicinie dataset.", "devfolioLink": "https://devfolio.co/submissions/medisure-151b", "githubLinks": ["https://iamaj69.pythonanywhere.com/", "https://github.com/iamajitsingh/Medisure-project"], "special_mention": " ", "stacksUsed": ["NumPy", "pandas", "Django 3"], "longDesc": "The problem MediSure solves\nSince the concept of community Pharmacists doesn’t exist in India, the onus for cost reduction from the point of view of drug selection lies with the doctors. MediSure will help doctors easily recommend the most economical and effective drug combinations to their patients."}, {"idNo": 6, "name": "Jan Aushadhi and Government of India", "desc": "Generic medicine at your footstep", "devfolioLink": "https://devfolio.co/submissions/jan-aushadhi-and-government-of-india-d58d", "githubLinks": ["https://github.com/HariPrasad5724/MedicineWebApp/tree/master", "https://github.com/Kiruthika111/gitrepo", "https://github.com/Jagapradeep/Sociothon-Assessment"], "special_mention": " ", "stacksUsed": ["Express.js", "MongoDB", "Node js", "React js", "Bootstrap"], "longDesc": "The problem Jan Aushadhi and Government of India solves\nMaking these generic medicines available to everyone especially at the rural areas by eradicating the indermediate charges."}, {"idNo": 7, "name": "Easy-Meds", "desc": "Our project mainly aims in promoting the usage of generic medicines from Jan Aushadhi Scheme by the Government of India and to reduce the Out-of-Pocket (OOP) expenses of Indian households.", "devfolioLink": "https://devfolio.co/submissions/easymeds-69ad", "githubLinks": ["https://github.com/RagulRaj-S/Easy-meds", "https://easy-meds108.herokuapp.com/"], "special_mention": " ", "stacksUsed": ["JSON", "Materialize CSS", "React.js"], "longDesc": "The problem Easy-Meds solves\nAs India is one of the highest per capita out-of-pocket expenditures’ country, such generics will save a lot of money which can be used for other health issues. In all countries, the use of generic drugs has increased significantly in recent years. In India, most people with high financial backgrounds always go for the prescribed branded drug. But it is a huge burden for the people in the middle class to spend on branded medicines. People can be benefitted from this website by knowing the equivalent substituent for the branded medicine they consume and the feedbacks received by the people consuming the same medicine. By knowing the equivalent substituent of the medicine they can consult with the doctor about whether they can use that medicine as it is cost-efficient. The consumers will trust the generic medicines by going through the feedbacks which are posted by people with the same health conditions. The people who are benefitted from generic medicines can post their feedback through this website, so other consumers who are hesitating to use these medicines will get aware. Generic medicines are typically 30% - 80% cheaper than originator equivalents. However, as the study shows, the price of some generic medicines available under JAS is costlier than the corresponding branded medicine available in the market. This suggests that the existing pricing of JAS would actually increase the OOP expenditure of patient households, which fails the purpose and objective of the scheme. For this problem, the prices of the medicine should be regularized. The prices of medicines that are relatively much cheaper than the branded medicines can be increased slightly. The profit obtained from increasing such medicines prices can be utilized to lower the generic medicine prices which are more than the branded medicines."}]